{"mind_virus":["Cokie Roberts: People Call Obama Muslim Because They Can\u0027t Say \u0027I Don\u0027t Like Him Cause He\u0027s Black\u0027 "],"zenmeta4":["\"You know our current president is (Muslim). You know he\u0027s not even an American.\""],"ftcnt":["Obama reaches out to Muslim world "],"upaya":["In Latest Compromise with GOP, Obama Agrees He is a Muslim "],"7redacted":["\"President Barack Obama has launched twice as many strikes on countries that are predominantly Muslim than President George W. Bush.\" Politifact: TRUE"],"multiplyinghorsey":["Is Obama a good or bad president, and why?"],"emagine":["Reddit, what do you do when someone brings up politics and you disagree with what they have to say?"],"alanwil2":["One In Six Americans Believe Obama Is Muslim, Only One In Four Identify Him As Protestant"],"luciussullafelix":["Isis threatens to behead President Barack Obama and \u0027transform America into a Muslim province\u0027"],"electricrebel":["A feature request for all webmail clients: automatic Urban Legend detector. If you are a developer for Gmail, Yahoo Mail, Hotmail, or another email system, please read this."],"fongaboo":["Obama explains Trolling to the Muslim world..."],"izzypop112":["Donald Trump on anti-Muslim questioner controversy: Would Obama defend me? No chance!"],"bobbelcher":["GOP Volunteer Calling FL Voters: \u0027I Don\u0027t Know if You\u0027ve Done Any Research on Obama... He Is a Muslim\u0027","54% of Republicans say that, \"deep down,\" Obama is a Muslim"],"davidreiss666":["Donald Trump has been criticised for failing to correct a supporter who said US President Barack Obama was a Muslim and \"not even an American\".","State-Certified Handgun Instructor In Texas Refuses To Teach Muslims, Obama Supporters","A volunteer for the Republican Party of Clay County in Florida was caught on an answering machine falsely claiming that President Barack Obama believes in Islam."],"iamthefish":["Poll: 52% of Mississippi GOP voters think Obama is a Muslim, 66% don\u0027t believe in evolution"],"trioprice":["Police officer suspended for calling Barack Obama a \"Muslim commie\" who should \"go die in a shallow grave\" on Facebook"],"hurricanelantern":["Catholic League slams Obama for admitting Muslims have contributed to America."],"ksutherland91":["54% of Republicans say deep down, Obama is a Muslim"],"dsagjiiggsscjjigsjsb":["One user in /r/Islam thinks \"Obama is a disbelieving oppressor\" and can\u0027t fathom why \"any Muslim would want to meet him for any other reason than to take this taghut to task for his transgressions against Allah and humanity.\" /r/Islam is not amused."],"turd-polish":["Why I will not be voting for Hillary Clinton in 2016, and may vote for Trump if Bernie Sanders does not win the Democratic nomination"],"templarjls":["Obama being a Muslim"],"retrocorn":["I need help convincing my hardcore conservative dad to vote for Obama, or at least someone other than Romney.","I need help convincing my hardcore conservative dad to vote for Obama, or at least someone other than Romney."],"dougmataconis":["Iowa GOP Focus Group: Obama Is A Muslim"],"33mmpaperclip":["\"OBAMA IS A MUSLIM - DEAL WITH IT.\""],"blacktealeaves":["Reggie Love: There Were Definitely Folks From Hillary Clinton’s Camp Who Spread Rumors President Obama Was A Muslim","Did Obama come out as an atheist on Marc Maron\u0027s podcast?"],"avangelism":["Arlington Mayor attacks Obama accusing him of being a muslim that intentionally blocked Peanuts Christmas special (and gospelmessage)"],"thestatelessman":["Dear Muslims: Obama and the Dems Are Not On Your Side"],"noname99":["Nearly a quarter of Democrats (23%) who hold a negative view of Obama believe he is a Muslim"],"tyrath":["Mom dropped this gem yesterday about Obama being \"half Muslim\" "],"caribosa":["Obama\u0027s \"Muslim Prayer Curtain\""],"spartan2600":["Obama Humiliates Muslim Guests at White House Ramadan Event, Endorses Israel’s Gaza Assault and NSA Surveillance"],"shady_as_fudge":["Europe must do more to better integrate its Muslim communities, and not \"simply respond with a hammer\", US President Barack Obama said Friday in the wake of last week\u0027s terror attacks in France"],"cypressgreen":["I believe American politics have gone downhill due to the marriage of the GOP to the religious right This began a few decades ago, but in recent years the RR has become the master of the GOP. Religious Right attitudes have bled into the system, causing division and inflexibility."],"its_dangernova_bitch":["When the big lie works: The percentage of Republicans who believe that Barack Obama is Muslim has doubled since October 2008."],"donaldrobertsoniii":["Is Obama a Muslim? "],"mootchell":["\"We are a nation of Christians and Muslims. Jews and Hindus... and non-belivers.\" Thanks, Obama."],"see0red":["Muslim Leader Calls on US, Obama to Stop Ignoring Saudi Arabia\u0027s Religious Freedom Violations"],"mujahideenryder":["CNN: So what if Obama was an Arab or Muslim!","Ben Affleck speaks the Truth on Obama, Muslims and Islam in America","Ben Affleck speaks the Truth on Obama, Muslims and Islam in America"],"halo-one":["OBAMA FLASHBACK: THE DAY I\u0027M INAUGURATED MUSLIM HOSTILITY WILL EASE"],"sirboozebum":["Ron Paul supporter posts in /r/christianity urging readers to not vote for \"Muslim Obama\" or \"Mormon Romney\" and claims only Ron Paul is a Christian. Receives response and goes ballistic. Hilarity ensues."],"orangutan":["Appearing on NBC, Obama blames \u0027network of misinformation\u0027 for rumors of Muslim faith"],"saydrah":["Three men at McCain rally handing out Obama stickers with Muslim crescent run off the premises by Muslim Republicans."],"soupyhands":["November 7, 2012 /r/Obama: Once you go black...."],"the_pinball":["Why does it matter if Obama is Muslim or not?"],"somehowivebeenbanned":["Reddit-approved thoughts and opinions."],"eyefish4fun":["CBS Edited Out Harsh Critique of Obama, U.S. \u0027Militarism\u0027 by Muslim Focus Group"],"pojut":["Hank Williams Jr.: Obama Is \u0027A Muslim President Who Hates Farming, Hates The Military, Hates The U.S. And We Hate Him\u0027"],"ephilei":["What\u0027s the Muslim response to the Obama-is-Muslim conspiracy?"],"myearsmyears":["Is Obama a Muslim? About.com poll: 57% Yes, 37% No, 10% Undecided. Let\u0027s correct this."],"schadenfreudeiest":["Obama: \u0027I\u0027m Not The Strapping Young Muslim Socialist I Used To Be\u0027"],"zeinshver":["Earlier Donald Trump posted a tweet questioning President Obama\u0027s line that Muslim\u0027s are our sports heroes. \"What sport is he talking about, and who?\" Here is a picture of Trump presenting an award to Muhammed Ali."],"sfbruin":["The \"I share memes about Obama being a Muslim on Facebook\" starterpack"],"undrdawg":["60% of Voters Correctly Identify Romney as a Mormon. Only 49% Say Obama is a Christian (30% of GOP Think Obama is a Muslim)"],"arbassa":["(Twitter) Muslim sport heroes? Yea right, Obama."],"roark":["WSJ Poll: 13% of voters think Obama is Muslim (pdf)"],"fiftyshadesofdutch":["ELI5: Why people still maintain that Obama is a Muslim, terrorist, not born in America, etc."],"onkneesforjesus":["Florida GOP Phone Bank Tells People, \"Obama Is Muslim \u0026amp; Socialistic\""],"jonahrod20":["Huckabee: Man Who Called Obama Muslim At Trump Rally Possibly “A Plant”"],"indonesiathrowaway":["Obama on the US\u0027 past with Indonesia, and the growing conservatism amongst Indonesian muslims"],"twolf1":["At Florida Town Hall, Rick Santorum Cowardly Panders To Woman Who Alleges Obama Is \"An Avowed Muslim\"","Convicted Felon G. Gordon Liddy Says ‘I’m Convinced’ That ‘Barack Obama Is A Muslim,’ Gary Bauer Doesn’t Disagree","Fox hosts fall for hoax: Obama personally funding Muslim museum during shutdown","Sen. Inhofe Rips Obama As \"Un-American,\" Suggests He’s On The Side Of Terrorists - “I just don’t know whose side he’s on”"],"ser_davos_cworth":["Obama Spent His Day At A Radical Mosque, Praising Muslims","Obama: Criticism of Muslim Americans \u0027Has No Place In Our Country\u0027"],"deller85":["Do you think Mr. Obama is a Muslim or a Christian? ....I know, I know...some Arkansans can\u0027t get it right...help them Obama redditors!"],"romneysbainer":["Obama jokes: I’m not the strapping young Muslim socialist I used to be"],"derpinski":["Rachel Maddow Goes After The Half Of American Politicians Who Live In An ‘Evidence-Free Right-Wing World’ - \u0027politics dominated by the perceived desire to defend against the Muslim Obama jihad\u0027 - Feb 1, 2013","Rachel Maddow Goes After The Half Of American Politicians Who Live In An ‘Evidence-Free Right-Wing World’ - \u0027politics dominated by the perceived desire to defend against the Muslim Obama jihad\u0027 - Feb 1, 2013"],"kimura":["Obama Muslim Smear Resurfaces: NYT Op-Ed Tags Obama As Muslim \u0027Apostate\u0027"],"sneekey":["\"That’s shameful. That’s not American\" Obama calls out Jeb Bush\u0027s plan to limit U.S. aid to Christian refugees"],"sonikuu113":["FW: MUSLIM HERITAGE MY ASS!!!"],"asshat_backwards":["Egyptians rally outside White House to protest Muslim Brotherhood, Obama"],"jacquie_kubin":["Crowley was wrong; Romney was right. Obama avoided offending Muslims by using \"terrorism\" word"],"kingcreon":["A question from a non-socialist about Stalin and Mao."],"appleseed_":["Here are my Republican-style reasons for voting for Obama this election."],"jazjon":["Obama is a Muslim? (Old high school friend\u0027s mother\u0027s response to my facebook Obama celebration post \u0026amp; more)"],"iu34":["Can I have a little rant about conspiracy theorists?"],"isaristh":["If you think Obama is a Muslim, you are an idiot."],"euphoricmaster":["Anti-Trump Cuck gets WRECKED on r/PoliticalDiscussion"],"bobbymack":["(World Nut Daily Alert) Obama and his secret Muslim identity ring."],"dicydax":["In less than 3 minutes, John Green proves that Obama is not a Muslim. If only this had any impact."],"sm4269a":["Obama Thinks 99.9% Of Muslims Moderate? Think Again"],"bean829":["Some Muslim Americans Irritated By Obama\u0027s Call For Them To \u0027Root Out\u0027 Extremism"],"leahlionheart":["It’s not just that 47% of Republicans believe the lie that Obama is a Muslim, or that 27% in the GOP doubt that the president is a citizen. But fully half of them believe falsely that the big bailout of banks and insurance companies under TARP was enacted by Obama, and not President Bush."],"oneyearsteakday":["True American Patriot™ encounters an SRS Cuck in \"his\" natural habitat."],"ddplz":["Remember when Obama got elected and the crazy hillbillies all said he was a Muslim terrorist and the world was going to end?"],"kharos":["Obama paying lip service to Muslims is for America\u0027s best interest. In a sane world this would also be known as \"diplomacy\"."],"burtondesque":["Christian broadcaster clarifies for listener that Obama is actually \u0027an atheist with Muslim sympathies\u0027"],"whiskeyt":["ZOMG!!! Rick Perry refuses to place his hand on his heart during the Pledge, he must be a secret muslim! (Or does that standard only apply to Obama?) (x-posted from r/politics) "],"doc-hopper":["While Obama wants to take our weapons, he is giving Egypt F-16s.  Why aren\u0027t people talking about this?"],"awake-at-dawn":["Poll: Majority of Republicans thinks Obama is a Muslim","TRUMP: \u0027Obama is waging a war against Christians\u0027"],"cyanogenhacker":["I was sitting at a stoplight yesterday, minding my own business..."],"0913752864":["Hillary Rips Trump For Not Correcting Obama Muslim Question, But Her 2008 Obama Smearing Was Even Worse"],"misteraction":["TiIME: 28% of voters do not believe Muslims should be eligible to sit on the U.S. Supreme Court. ~33% say Muslims should be barred from running for President — slightly higher than the 24% who believe Obama is a Muslim."],"janu_":["To not offend Muslim sensitivities, Obama/Hilary and others are now refraining now saying \"Islamic\" state or \"Radical Islam\" .... Islamism literally has won."],"mothcock":["Obama comes out as muslim"],"eyulfable":["To Muslims (And I guess any other religion as well): Do you find the idea of Obama being Muslim ridiculous?"],"cosmic-surfing":["18% of Republicans believe Obama is a Muslim; most actually believe they act Christian-like - Gallup’s new poll results are a frightening reminder of today’s misinformed voter base"],"seeellayewhy":["Honest question, what has Obama done since he\u0027s been in office?"],"frycook":["Most  Southern Republicans Think Obama Is A Muslim And Doubt Evolution"],"agnosticomex":["Catholic.org: \"Yes, Obama is a Secret Muslim\""],"macdangerous":["Why Obama is a \u0027Muslim\u0027: Republicans and symbolic belief"],"zohandvir":["Audience member on Megyn Kelly\u0027s show tries to explain how more proof has arisen that Obama is a Muslim since 2008 (expecting surrounding agreement) only to realize she is the only one on the set with that view. Notice the look of the women next to her when she finishes speaking."],"teddie1056":["\u0026lt;--- Distance between Bernie Sanders birthplace and Obama\u0027s Muslim Kenyan Birthplace"],"vb5215":["Sue-Ann Levy Tweet Suggests Obama Might Be Muslim, causes online stir amongst journalists and bloggers"],"xxshteviexx":["My Orthodox rabbi says President Obama is halachicly a Muslim, a descendant of the nation of Ishmael. What are your thoughts?"],"torusaurus":["We Bernie Sanders supporters owe it to ourselves to know Hillary Clinton started the whole \"Barack Obama is a Muslim\" and the \"Birther\" nonsense flaring up racism and giving ammo to Trump."],"libertatea":["GOP’s Louie Gohmert, wannabe speaker, headlines the House’s latest freak show \"Arguing against gun control, he drew a link between gay marriage and bestiality. He has alleged that there are \u0027so many Muslim Brotherhood members\u0027 in the Obama administration ...\""],"johngalt50":["Anderson Cooper destroys \"Tea Party\" Leader who says Obama Is An \"Indonesian Muslim Turned Welfare Thug\" (VIDEO)"],"codyave":["Obama warns: Discrimination against Muslims helps ISIS"],"karmicwhiplash":["Behind Closed Doors, Cheney Tells Republicans That Obama Supported Muslim Brotherhood"],"reddit4":["\"Newt Gingrich said Friday that President Obama gives people reason to believe that he’s a Muslim.\""],"billflax":["Obama isn\u0027t a Muslim. He\u0027s a Marxist."],"mandazi":["The Muslim vote helped Obama defeat Romney in the 2012 Presidential Election"],"souldrift":["Obama Has Never Been A Muslim, And Is a Committed Christian"],"thatrightwinger":["Why Obama Thinks All Muslim Terror Attacks Are \u0027Random\u0027"],"shiraazmohamed":["Obama to meet with Muslims on 1st visit to US mosque"],"weliveamidst":["I have a friend who tries to talk to me about his preference for Romney over Obama because he knows I don\u0027t know anything about the presidential candidates"],"djork":["Sometimes, I really hate Christians."],"itsmisterrogers":["Oh Fox News, you slay me..."],"abudabu":["The Washington Post Knowingly Passed on the Lies That Obama \"Is a Muslim\" and \"Will Take the Oath of Office Using the Koran\".  It\u0027s Their Job, They Say to Pass in \"Factual Falsehoods\""],"i_am_a_balbc":["PEW Survey: 17% of voters think Obama is Muslim, 40% don\u0027t know Romney is Mormon. "],"jahonay":["This needs to be talked about reddit. Most redditors believe muslims are non-violent. That they have similar views to people in America. That Egypt isn\u0027t going to become a theocracy. Have you, too, fallen for this bullshit?"],"mranon515":["Obama: \"I\u0027m not the strapping young Muslim socialist I used to be.\""],"throwaway948ty-039ir":["Me [48M] with a lot of my relatives [20-70s M/F] they\u0027re all canceling on Christmas because they\u0027re scared of ISIS attacks"],"drjulianbashir":["The Problem With Polls About Whether Obama Is a Muslim - By asking voters what they think about the president\u0027s religion, pollsters help to perpetuate a falsehood."],"rwolpz":["Obama:\"--- we do not consider ourselves a Christian nation or a Jewish nation or a Muslim nation.\""],"andrewoneverything":["Newt: Republican voters believe Obama is Muslim because he\u0027s been acting awful Muslim lately"],"slintercelldoubleage":["Fox Falls For Fake Story About Obama Personally Funding Muslim Museum During Shutdown"],"mav3rick490":["Shit Mormons say in Nephi, UT"],"twenafeesh":["Tea Party Group Jokes About Beating Obama To Death -- When asked, member of group \"explained that the missive was funny because it’s predicated on the notion that Obama \u0027may be a Muslim.\u0027\""],"maddoktor2":["Fox News\u0027 Anna Kooiman Falls For Parody About Obama Funding Muslim Museum"],"kokomocat":["Ignorant shit my MIL says"],"jest09":["Polls in the Muslim world show Obama\u0027s administration is now more hated in the middle east than Bush\u0027s","Polls in the Muslim world show Obama\u0027s administration is now more hated in the middle east than Bush\u0027s","Polls in the Muslim world show Obama\u0027s administration is now more hated in the middle east than Bush\u0027s","Polls in the Muslim world show Obama\u0027s administration is now more hated in the middle east than Bush\u0027s"],"maxwellhill":["WikiLeaks smoking cable: Israel said it had ’secret accord’ with U.S. over expanding settlements even as Obama said in Cairo they must stop"],"p_u_c_k":["How is Obama not getting a ridiculous amount of credit for the successful attacks he\u0027s ordered on Al-Qaeda and Al Shabaab? And his economic accomplishments?"],"jmeasley":["Mitch McConnell Refuses to Say that Obama is Not a Muslim","John Boehner Claims It’s Not His Job To Tell The Right Obama Isn’t Muslim"],"montreal01":["Obama: \u0027Osama wasn\u0027t a Muslim leader, he was a mass murderer of Muslims\u0027"],"itsjustkeegs":["Malaysian Muslims protest against Obama visit – BorneoPost Online"],"propshaft":["Obama administration Says Muslim Immigrants Do Not Have To Serve This Nation If It Conflicts With Their Religious Beliefs","High School Student Tears Into Obama For Playing ‘Agenda’ Politics (muslim clock/bomb maker issue)"],"reeds1999":["Florida Republican Volunteer Tells Senior Citizens: Obama Is A \u0027Muslim\u0027 Who Will \u0027Get Rid Of Your Medicare\u0027."],"rdwittsteeler":["40% of people in a Fox News group focus group raise their hands when Frank Luntz asks them if they believe Obama is a Muslim (Video)"],"thebramblewish":["Has Obama faced more personal attacks than previous presidents?"],"r3dd173r":["NYT opinion piece says Obama\u0027s a muslim apostate. Commenters point out the illogic and evil intentions of the opinionator."],"fractal_soul":["I\u0027m seeking perspective from conspiracy experts:"],"positronix":["US Ambassador killed by muslim outrage just as Obama is starting to back off from supporting Israel"],"redkrypton":["Thank you for your service!"],"progxian":["Gordon\u0027s Blog: Is Obama a Muslim?"],"rweavere":["Why did people make such a big deal about the rumor of Obama being a Muslim, but those same people don\u0027t seem to care about the fact that Romney is a Morman?"],"rosiewoods35":["One in five Americans think Barack Obama is Muslim"],"justancsuthrowaway":["Student Body President Candidate Dwayne O\u0027Rear\u0027s racist rant: ripping on Obama for being muslim, calling a student and raghead and to \"blow himself up like his cousins lmfao\"."],"quikjl":["Santorum\u0027s Speech today in Alabama: Not just hilarious but interesting. "],"thinkythought":["famous shitlord andrewsmith strikes again! \"I told my coworkers today (who refer to obama as a muslim) that people only call him a muslim because they can\u0027t call him a nigger.\nThey didn\u0027t think it was funny.\" +1000. seriously."],"iamabioticgod":["my stepdad just gave the vape back I gave him because \"It\u0027s a million times worse than air\""],"saxonjf":["Obama treats Muslim Brotherhood with More Respect than College Republicans"],"cos":["In Latest Compromise with GOP, Obama Agrees He is a Muslim."],"tsukamori":["TIL Obama\u0027s parents were both non-religious"],"sketerpot":["12% of Republicans think Obama is a Muslim. So do 12% of Democrats."],"cah75":["Santorum: It\u0027s not my job to correct voters who say Obama is Muslim"],"vietxtract":["Those darn muslims, Thanks obama"],"spacepilots":["What happened to all the people that thought Obama was the Antichrist?"],"duckandcover":["When I see all the posts about how unfair it\u0027s been for Ron Paul, I think about Obama being called a Kenyan Muslim Commie Terrorist, who\u0027s going to Kill your grandma with healthcare, for 4 years."],"abyssmeister":["I think Bernie should call out Ben Carson after his\"No muslim should become president\" gaffe. IT\u0027s just unacceptable and is a bigoted statement. Bernie already called out Trump so why not Carson?"],"colejosephhammers":["President Obama comes out as an Gay Atheist Muslim. We did it, reddit!"],"sgt--hulka":["After saying earlier that Sept. 11 was not the day to criticize President Obama on foreign policy matters, Mitt Romney late Tuesday issued a statement blasting the Obama administration for sympathy for Muslims. "],"anomaly100":["My Take: Obama is not a Muslim (and Romney is a Mormon)"],"agoodone":["What the rally meant to me..."],"dotz-n-bubblez":["Muslims Hijack Michelle Obama\u0027s Hashtag Activism With \"#Stop Drone Bombings\""],"me24601":["[x-post from r/subredditdrama] Ron Paul supporter posts in /r/christianity urging readers to not vote for \"Muslim Obama\" or \"Mormon Romney\" and claims only Ron Paul is a Christian. Receives response and goes ballistic. Hilarity ensues."],"sixvisix":["Trump Refuses To Accept That Obama Was Born In U.S., Is Not Muslim"],"robotoverlordz":["ISIS to Obama: We\u0027ll Behead You and Make America Muslim"],"ron-paul-sucks":["\"Obama Declares November National Muslim Appreciation Month\" - This is currently making its way around Right Wing bloggers and Facebook patriots.","Tea Baggers get duped by satire article saying Obama declared November \"Muslim Appreciation Month\" from NationalReport.net and it makes it to all corners of the right wing blogosphere."],"interestingstuff1776":["Hank Williams Jr. Blasts Obama Again, Says President Is Muslim, \u0027Hates Cowgirls,\u0027 \u0027Loves Gays\u0027"],"rommel79":["The \"Obama is a Muslim\" stuff is about to start again"],"dvance":["Boston Muslim Terrorist an Obama Fan. Will the media report this fact?"],"bradyblack":["Obama said that “at a time when anyone with a cellphone can spread offensive views around the world with the click of a button,” the notion that governments can control the flow of information is obsolete.\n(!)"],"madam_waggles":["MRW my FIL tells me that Obama is a Muslim, even after I explained the Koch brothers trying to manipulate the media into believing those kinds of things. He literally stared at me like I was just a dumb girl."],"legalpolishcentipede":["Philip Schuyler: \"Obama describes the Muslim migrants as \"women \u0026amp; children.\" Red Cross: 72% are men of fighting age. Typical Obama."],"chajimak":["Obama wished Muslims a happy Ramadan? Time to shit in his mouth and kill him!"],"pilebsa":["Forget being Muslim, is Obama an atheist?"],"kaiuk":["Obama makes a joke, Infowars takes it seriously."],"ezratwitch":["How do you stand it (Vent)."],"emalik25":["Since 2008, Twice as Many Conservatives Think Obama\u0027s Muslim"],"randel55":["Muslim Obama classifies Christianity as a mental illness"],"eeepc":["1 in 5 think Obama is Muslim?  Well 14% of Republicans believe in the \u0027evil eye\u0027 and 36% of democrats believe they can communicate with the dead."],"twogee":["Have Lawmakers Tired Of Correcting Constituents Who Think Obama\u0027s A \u0027Muslim Terrorist\u0027?"],"drewiepoodle":["Gun Owners of America executive director Larry Pratt and talk show host Stan Solomon speculated that liberals in the U.S. are teaming up with Muslim radicals in order to destroy America. Solomon further suggested that President Obama is a homosexual Muslim who is married to a man."],"nicka_please":["MRW my mom says that she doesn\u0027t like President Obama because he\u0027s a Muslim"],"pensivebadger":["Christianity Today: Point/counterpoint on whether Obama is a Christian"],"unclefred":["Hannity and Gingrich have been lusting for war against Iran for years – though neither has ever suited up in a military uniform. But each not only seems downright eager for a new war ... Newt Gingrich Suggests Obama Is A Muslim-Appeasing Traitor"],"privateblue":["President Obama: Our TV Shows Should Have Muslim Characters ‘That Are Unrelated to National Security’"],"dogmaticmother":["My [M17] mother talks about my GF [F17] like she is a whore"],"sexi_squidward":["They complain that free speech is being taken away but when someone else exercises it then Obama is a racist muslim."],"ilikerutypoon":["My dad just revealed he thinks Obama is a Muslim and a nigger, also that IF I was going ot vote him he would disown me!  I\u0027m really unsure what to say to this..."],"blankverse":["Ad for gun training bars Muslims and Obama voters","51% [of Republican voters] overall want to eliminate birthright citizenship. 54% think President Obama is a Muslim. And only 29% grant that President Obama was born in the United States. That’s less than the 40% who think Canadian born Ted Cruz was born in the United States.","Trump Doesn\u0027t Challenge Man\u0027s Anti-Muslim, False Obama Claims -- Trump, who was an early and vocal questioner of President Barack Obama\u0027s U.S. citizenship, did not correct the man about Obama\u0027s faith."],"cmoar6":["Nearly Half of Today’s Primary Voters Believe Obama Is Muslim"],"partytillidei":["This guy posts a new video every 5 hours on Youtube about Obama being a muslim, Kenyan, etc.... for like the past several years."],"daven26":["Obama, the muslim, is killing the Golden Egg Laying Hen?"],"drakedrake":["Barack Obama: NASA must try to make Muslims \u0027feel good.\u0027 When did NASA become an ambassadorial agency?"],"honorable_doofus":["According to PPP, only 29% of Republicans believe Obama was born in the US (Q29), 40% believe Ted Cruz was born in the US (Q30), and 54% believe that Obama is a Muslim (Q31). What gives?"],"pixelmagic":["Tired Of All The \"Obama Hate\" E-mail Fowards, So I Replied To ALL..."],"kosmozoan":["Poll: 54% of Republicans say that, \"deep down,\" Obama is a Muslim"],"jewiscool":["Obama Condemns Killings of Muslim Students as Hate Crime Inquiry Begins","Jewish groups join call on Obama to stop marginalizing American Muslims","A radio ad for a handgun training class that bars Muslims and Obama voters"],"scientologist2":["The Problem With Polls About Whether Obama Is a Muslim"],"therussell":["U.S. Muslims Most Approving of Obama, Mormons Least"],"physicsismymistress":["/r/Conservative still thinks Obama is a Muslim"],"sid13":["Poll: 1 In 10 Think Obama Is Muslim \u0026amp; A Third Don\u0027t Know Or Are Confused.."],"amaurer":["No, Obama Didn\u0027t Become A Muslim - And This Is Why You Don\u0027t Use Invisible Quotes When Speaking"],"conspirobot":["175 Obama backed Muslim terrorists exterminated in a single column entering Syria...most of them Saudis, Qataris and Chechens. Aftermath link provided. NSFW"],"billtowne":["How Do Christians Feel About Romney Being Mormon?","Hank Williams Jr. calls Obama a Muslim who ‘hates the U.S.’ at Iowa concert - NY Daily News"],"antimasada":["Netanyahu\u0027s former envoy to U.S. under fire for essay on Obama\u0027s Muslim roots. Anti-Defamation League Head says it veers into the realm of conspiracy theories."],"waterjugging":["I\u0027m sick of the made up corporate media controversies (mosques at ground zero, Obama\u0027s-a-Muslim, yada, yada). Please get back to the FACT that Americans are violently occupying Middle Eastern countries, murdering and torturing their people. Oh and by the way the Gulf of Mexico is DEAD.  "],"moneymatador":["People in Middle America believe that Obama is a Muslim"],"tequilasundae":["I am dealing with an extremely low info coworker, who won\u0027t shut up. What recourse do I have?"],"fashion198":["If you still believe Obama is a muslim"],"food_bag":["Evolution of a circlejerk: Reddit\u0027s changing attitude towards Ahmed Mohammed, the boy arrested for bringing a clock to school."],"kayejazz":["President Obama compares anti-Muslim rhetoric to historic persecution of Mormons"],"wonderfuldog":["Barack Obama: non-Muslim. Can anybody point me \r\nto any simple evidence on this? [self]"],"politicbot":["Cop Who Pushed CNN\u0027s Don Lemon in Ferguson Suspended for Hate-Filled Speech Against Women, Gays, Muslims and Obama (Video)","54% of Republicans say that, \"deep down,\" Obama is a Muslim"],"barackoblogger":["Ohio Voter On 60 Minutes: I Hear Obama Is Muslim, Doesn\u0027t Know National Anthem","Wall of Shame: NJ Local Newspaper Refuses to Take Down Obama Muslim Sear Column.  (The editor has been sent numerous letters to the editor asking them to retract it.)"],"amerrickangirl":["Obama\u0027s a Muslim?  Meet the man who started that false rumor ... a man so mentally unbalanced he wasn\u0027t allowed to become a lawyer, but Fox gives him air time."],"billyhowcr":["My rebuttal to all the Obama\u0027s \"Muslim Prayer Curtain\" posts.","My rebuttal to all the Obama\u0027s \"Muslim Prayer Curtain\" posts that are now popping up in social networks yet again."],"anutensil":["Rep Gohmert (R-TX) Says Muslim Brotherhood Members in Obama Administration are Influencing US Decisions - “Thank God for moderates that don’t approve of what’s being done. This administration has so many Muslim brotherhood members that they\u0027re making wrong decisions for America.”","Preacher Billy Graham Son\u0027s New Obama-Muslim Conspiracy Theory - \nSays president has allowed the Muslim Brotherhood to infiltrate the US government"],"brandomcgregor":["Romney Campaign Call from Clay County (TX)  volunteer claims: \"Obama is a Muslim who will take away your medicare\""],"funkdracula":["Did you ever find out something about someone that you would have preferred not to know?"],"briangmac":["Poll: 54% of Republicans say that, \"deep down,\" Obama is a Muslim"],"dst187":["Europe needs to better integrate Muslim communities: Obama"],"bangsnaughtybits":["Watch Ohioans Explain That Obama Is An Atheist Muslim (And That Buddhists Are Invading The Country)"],"unbliever":["Harlem Church Rails Against Obama, Muslims, “No-Honor” Blacks; Wishes “Cancer, HIV” on Gay-Friendly Believers"],"apairofdocks":["Boston: The Anti-Muslim Horde Rears its Head Before the Blood Dries"],"oranjemania":["Trump: Who are these Muslim sports heroes that Obama is talking about?"],"drunkrevolver":["It Is Impossible to Convince the Bitters That Barack Obama Is Not a Muslim"],"mahidevran":["Barack Obama uses mosque visit to call for rounded Muslim characters on TV"],"nadiasindi2":["Obama\u0027s \u0027Muslim Socialist\u0027 Joke Draws Big Laughs (VIDEO)"],"mrd0om":["according to /r/european obama is not the only muslim"],"shallah":["Rep. Jeff Landry (R-LA) Baselessly Claims the Obama Administration offers Muslim Airline Passengers \u0027Waivers\u0027 to bypass TSA Screenings"],"subzerogts":["After Obama Win, Black Muslim Teen Beaten With Bat on Staten Island"],"ethicalreasoning":["Reality: Obamas father was an atheist. Obama is a practicing Christian. He is not and never was a muslim. He was not \"born a muslim.\" Who cares if he was? The GOP has successfully manufacturing an issue to rally their xenophobic and racist base for November elections"],"thepoliticalcom":["Poll results: Muslims love Obama!"],"foreveralonebetch":["Obama is a Muslim Socialist who wants to be King of America."],"pruppetkingdom":["At Baltimore mosque, President Obama encourages U.S. Muslims: “You fit in here”"],"votefortrump2016":["Donald Trump: Obama ‘Apologizes’ to Muslims in Mosque"],"yankhoser":["Fox News Falls For Fake Story About Obama Personally Funding Muslim Museum During Shutdown"],"ghostofpennwast":["Donald Trump declines to correct man who says President Obama is Muslim"],"fjardis":["Sorry if this sounds ignorant, but would it really matter all that much if Obama actually WAS a Muslim?"],"qu1nlan":["A clearly angry President Barack Obama on Monday used the world stage to call out Republican presidential candidates for being counterproductive, \"talking as if they\u0027re tough\" on ISIS and stoking fears about Muslim refugees from Syria."],"clflava":["She scoffs at the idea of voting for Obama: \"I don\u0027t want to be a Muslim!\" She looks dubious when told Obama is Christian. \"Then why did he go see what\u0027s-his-name over in Iraq, that Lama?\""],"lingben":["Some Muslim Americans Irritated By Obama\u0027s Call For Them To \u0027Root Out\u0027 Extremism"],"alwaysreadthename":["Obama\u0027s Muslim Army"],"atomikradio":["Aghast over my aunt\u0027s ignorant-ass Facebook post."],"flame_in_darkness":["Obama + Muslims - Jesus \u003d New World Order"],"mjsolaro":["Smears Working? 13 Percent Of Voters Believe Obama Is A Muslim.","Watch Chris Matthews argue with Clinton supporter on whether Obama is a muslim [video]."],"darthweezie":["Why do all Muslims bomb stuff?"],"mcantelon":["14% of Kentucky voter *still* think Obama is a Muslim"],"pissbeuponhim":["Europe needs to better integrate Muslim communities: Obama"],"rhythmictalent":["Alabama senators to block Obama\u0027s judge nomination for the 11th circuit Court of Appeals because he is not an evangelical Christian"],"mic9ael":["Cenk on Racist Alabama Republicans: \"You Think Obama is Muslim Because... He\u0027s Black\""],"madgrafx":["GOP group\u0027s head calls Obama \u0027a Muslim socialist\u0027"],"55ten":["Over half of Evangelicals who voted for McCain think Obama is or was a Muslim"],"fangolo":["Do you think Obama is a Muslim? Hillary: “No. No, there is nothing to base that on. As far as I know,” No integrity whatsoever."],"datman216":["Poll: Majority of Republicans think Obama is a Muslim"],"sachmo_muse":["Quran refers to Jews as apes and pigs (5.60) and the Hadith is filled with Jew-hatred, but Obama says Muslim antisemitism is only decades old"],"vork":["Guy Holds Sign Calling Obama a Muslim, Wears Shirt Saying \"Glenn Beck is My Hero\". [PIC]"],"lancercan":["Why would it be so horrible if Obama was a muslim?"],"blackstar9000":["Attempts to \"smear\" Obama as a Muslim may have sent Muslim out to support him in droves; Collin Powell\u0027s \"Is there something wrong with being a Muslim in this country\" a watershed moment."],"psclosetheboarders":["Even members of /r/cons are getting sick of Obama Muslim comments"],"b_deam":["Obama: Muslims have built the very fabric of our nation. Such as?"],"ownthenwo":["Egypt Attorney General Says Muslim Brotherhood Leaders On Secret Salary From Obama"],"misterthingy":["Arlington mayor thinks Obama pre-empted Peanuts because he\u0027s a Muslim."],"johnspidey":["In response to the post about fox news believing Obama funded a muslim museum"],"designthing":["Wajahat Ali: Barack Obama, \u0027Muslim\u0027 President (funny op-ed)"],"ibiteyou":["Obama: Europe should better integrate Muslims","UK condemns Muslim Brotherhood in break from Obama administration"],"colloquy":["A campaign volunteer was recorded calling people and saying President Barack Obama is a Muslim who will take away Medicare."],"wisubmittyman":["Superior mayor apologizes for calling Obama a Muslim"],"fremankynes":["To Christians: Why is it that so many American christians seem to believe that there are huge organizations trying to cover up proof of Christianity."],"sandmanviscera":["Treason Exposed! Obama Used Benghazi Attack to Cover Up Arms Shipments to Muslim Brotherhood"],"quietlike":["My ultra fundamentalist, racist in-laws are forced to pick between a black man and a Mormon for president.  I find their endless debates hilariously entertaining.  Is anyone else enjoying something similar?  "],"sorac":["A question about UK politics from across the pond."],"dcoldiron":["Here We Go Again: President Obama Is A Muslim, Tenn. Mayor Declares -- I wonder if he\u0027s facebook friends with Palin?"],"adistantrelative":["Obama wishing a peaceful Ramadan to Muslims in America and around the world."],"chrisisbeast1":["fwd: Obama is a muslim terrorist sympthizer!!"],"mohawk1":["Obama Attacks Anti-Homosexual Laws in Uganda but Not Muslim Violence"],"diglettdiddler":["Well, CPS should be knocking down our door soon."],"crewman-chu":["If Islamic terrorists aren\u0027t considered \"real\" or \"true\" Muslims, why did the U.S. give Osama bin Laden an Islamic burial at sea?"],"captainweaver":["Madonna confused some Washington, D.C. fans by demanding that they support the \"black Muslim in the White House\" as she gave a profanity-riddled political endorsement of President Obama Monday night."],"grand_key":["Wisconsin mayor apologizes for calling Obama a Muslim"],"gloomdoom":["Dear America: You fought and sent a clear message to the powers that be by rejecting the notion that money should equate to power. If you want that work to pay off, you need to start understanding the power and importance of unions or it\u0027s all for naught."],"shrekisponzo":["EVIL PEOPLE LIKE OBAMA AND MUSLIMS"],"drugzrbad":["Obama is a Muslim again and hates Christians, how else do you explain the Iran deal?"],"murican_freedom1776":["Obama the Muslim... IT WAS YOU OBAMA!"],"menses_maiden":["Some Muslim Americans Irritated By Obama\u0027s Call For Them To \u0027Root Out\u0027 Extremism : NPR"],"corchirvingmyers":["Obama, Who Tried to Censor \"Innocence of Muslims\" Vid, Says Sony Shouldn\u0027t Have Pulled The Interview"],"thatoneguys":["It’s time for Obama to admit that the ISIS terrorists are Muslim"],"newsflash31":["Anti-Muslim Incident in Austin Goes Viral. President Obama Speaks Out against Discrimination"],"alphaque":["Sarah Palin Retweets Photo That Says Obama is \"Taliban Muslim\""],"stormy001":["Malaysia will not succeed if non-Muslims marginalised, says Obama | Malaysia"],"vp4e":["Donald Trump \u0027\u0027Under Obama, Only Muslim Immigrants Allowed In\u0027\u0027"],"dougbolivar":["Obama to Muslims and Jews: \"Learning to stand in somebody else\u0027s shoes to see through their eyes, that\u0027s how peace begins\""],"georgesteelo":["If Obama was a muslim why would it even matter?"],"pablocc":["More Iowans On Fox News Believe Obama Is A Muslim. It is very difficult to build a responsible conservative movement when ignorance like that prevails. "],"grendels-dad":["Ted Cruz says that Obama has \"made anti-Muslim speech illegal,\" despite the fact that he and the other Republican candidates engage in anti-Muslim speech all the time and amazingly enough, don\u0027t get arrested"],"michaelconfoy":["Texas police chief asks every resident to buy guns to protect against Muslims and ‘potentate’ Obama","The Foolish, Historically Illiterate, Incredible Response to Obama\u0027s Prayer Breakfast Speech: The use of religion to brutalize other people is not a Muslim invention, nor is it foreign to the American experience."],"nothing_2_do_here":["More Americans Believe Obama is Muslim Than in Theory of Evolution"],"roryd883":["Let\u0027s see how many generalizations we can pack into this. And remember, Obama is a Muslim!"],"dislak":["Whenever someone identifies themselves as a member of the \"Tea Party\", I automatically think of them as less intelligent. Is this wrong of me?"],"the-beer-baron":["Trump declines to correct man who says Obama is Muslim"],"herbcharles":["Watch McCain Supporter Gayle Quinnell explain to a reporter how she fears Obama will turn the US into a Muslim nation, AFTER McCain tells her he isn\u0027t an Arab. Some people just dont get it!"],"the_senator":["UNREAL… Obama Invites Egypt’s Muslim Brotherhood President to Meet Next Week – Refuses to Meet Netanyahu"],"chiponyasu":["I\u0027m not a Libertarian, but I just donated $50 to Ron Paul"],"squishydodo":["President Obama and Islam"],"ooftyman":["You can\u0027t make this up: Madonna Endorses Obama, a \"Black Muslim\" for President"],"alecb":["Israeli\u0027s In Jerusalem Respond To Barack Obama\u0027s Cairo Speech: \"Fuck that nigger, white power\" \"He\u0027s definitely a Muslim terrorist\" [incredible video]"],"undue-influence":["Obama Praises Muslim Cleric Who Backed Fatwa on Killing of U.S. Soldiers"],"grouch1980":["What are some \"facts\" or beliefs that a large number of Liberals/Democrats often parrot despite being demonstrably false?"],"anobscurity":["Christian-Conservative culture is so draining..."],"mrcleandrawers":["Here’s How Donald Trump Responded to a Person Saying President Obama is Muslim"],"dubhghlas":["Obama\u0027s Muslim Prayer Curtain"],"fuckreligiousnuts":["Is it possible to sway a fanatic away from their beliefs?"],"kramer2025":["Obama Call for Muslim Brotherhood Role Overtaken in Egypt"],"thinkexist":["As the republican party moves to the right and I refuse to move along with it, I am mad because I now have a one party system. Here is my rant."],"gliliumho":["Obama invites arrested Muslim schoolboy to White House"],"shakegetinhere":["Dear Teabaggers, Just Because I Work At The Counter Of A Bank, Bar, Store, Restaurant Etc. And Am Required To Serve You In Some Capacity, That Does Not Give You The Right To Harangue Me About Obama, Socialism, Taxes, Morality or Muslims. Now Please Kindly Fuck Off So I Can Help The Next Guest."],"jaysw66":["Why are so many people mad at Obama for saying that we are at war with Radicals and not Islam during his Extremism Summit?"],"mnocket":["Obama: Europe should better integrate Muslims"],"kingvitaman":["Is the Obama administration making the right decision by not linking the latest attacks in Europe with Islam in any way?"],"pardonmyfranton":["Senator Al Franken Has Answered Your Questions"],"notaprotist":["Got This From My Grandfather Today. Are YOU Ready For The Full-Fledged Obama-Led Muslim Takeover?"],"chemicallycastrated":["Mitt Romney\u0027s Birth Certificate.  His Father was born in Mexico.  Romney is just as \u0027foreign\u0027 as Obama is Kenyan or Muslim."],"vgmgc":["Apparently American Muslims didn\u0027t exist before Obama created his alternate universe"],"kaibunny143":["Obama is a Muslim rabble rabble.."],"sand_mann":["Obama at Muslim Brotherhood-linked Mosque: “Muslim Americans Keep Us Safe” - And: “Islam has always been part of America.” Really?"],"carc":["One in four Americans believe Obama is Muslim. This helps support my argument that 25% of all Americans are complete idiots."],"spaceghoti":["Obama Is Right: Christian Violence Is Just as Bad as Muslim Violence—Or Worse"],"ravenloft":["Ann Coulter: Obama is not a Muslim... He\u0027s something worse: an atheist!"],"doremusjessup":["Tea Party Congressman: Muslim Brotherhood Is Guiding Obama In Boston Bombings Investigation"],"mrsjonstewart":["Why is calling Obama a Muslim an insult?  "],"ursofuckingdumb":["/r/atheism upvotes a [likely] fake story and then circlejerks about how they literally hate all religions"],"eldercunningham":["New poll shows that fewer people think Obama is a Muslim. But now almost 1 in 5 people think he\u0027s Jewish","New poll shows that fewer people think Obama is a Muslim. But now almost 1 in 5 people think he\u0027s Jewish"],"mikearuba0":["John Dorsey: \"Obama Is a Black Muslim\""],"bookwormskates":["What is the best way to organize (or at least begin) a systematic removal of US elected representatives?"],"insanitywolf77":["Polls in the Muslim world show Obama\u0027s administration is now more hated in the Middle East then Bush\u0027s [X-Post from /r/Alltheleft"],"progress18":["Trump declines to correct questioner who says Obama is a Muslim","Carly Fiorina Doesn\u0027t Correct Man Who Calls Obama a \u0027Black Muslim\u0027","Obama rebuts anti-Muslim rhetoric in first U.S. mosque visit","Obama: Prejudice and discrimination against Muslims help ISIS"],"deyoungrepublicans":["‘We’re Just Telling the Truth, Sorry’: MSNBC Co-Hosts Say Obama-Muslim Rumors ‘All Started’ With Hillary","Obama: Too many have \u0027distorted\u0027 views of Muslims"],"goldiedust":["Do conservatives really think Obama is Muslim, or are they just dicks?"],"kingpin99":["The same people who think Obama is a Muslim think Palin is a Christian."],"newsens":["The Muslim Lawyers Association in Johannesburg wants US President Barack Obama arrested and tried for war crimes when he arrives in South Africa on June 29."],"wormwood03":["No amount of research can convince me....(Obama is turning the US into a muslim paradise)"],"makesureimjewish":["Well no wonder people who only watch/read FOX are uninformed. When you try to raise an opposing point you get banned.."],"compute_":["Upvote this to all so that those uninformed can learn that Trump has 100% authority as president to ban all muslim immigration: \"Whenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States\""],"pc25":["ALGERIA\u0027S BLOODY CLIMAX: OBAMA STILL SILENT AFTER MUSLIM SAVAGES KIDNAP AND EXECUTE AMERICANS IN THE CAUSE OF ISLAM"],"monk123":["Proof that Obama is a Muslim!!!"],"tobar7":["Who to vote for?\nDemocrats: Middle Class Tax Cuts, Jobs, Global Warming, Stop Outsourcing.\nRepublicans: Obama a Muslim, Birth Certificate, President didn\u0027t visit Israel, Women More Prone to Road Rage.\n\nIt\u0027s a Hard Choice?"],"qgyh2":["This morning, I received an email from someone who called Obama a Muslim.","Or is it that people BELIEVE Obama is a crazy leftist who has Muslim leanings, so isn\u0027t it \"funny\" to mock their misplaced apprehensions by showing how absurd their fears are?"],"akwala":["Poll finds that 95.5% of registered U.S. Muslim voters voted on 11/6, and 85% of them voted for Obama"],"quantum_finger":["Scientist asks why Americans believe Obama is a Muslim"],"ghostpantsmcgee":["He\u0027s almost gone, can we finally talk about the implications of Obama\u0027s tremendously obvious fake birth certificate?"],"jiandersonzer0":["Obama is a Muslim again.","Obama is a Muslim (loving) commie","Obama is a Muslim, bro."],"bluebeard":["Chain letter calling Obama a Muslim extremist says \"proved true by snopes.com\" but people are too stupid to actually go on the website and check for themselves"],"newt4prez":["Conservatives: Why do you really dislike Obama?"],"dislodged_tampon":["Someone’s suing the government for $43 trillion dollars and this definitely proves Obama is Muslim, terrorist, communist, half-breed."],"clatsop":["Sorry Obama, Harvard study says poor Muslims are LESS likely to be terrorists!!","Obama Does Not Mention – Islam, Muslim, Al-Qaeda, Islamists – Not Once in Today’s 9-11 Memorial Speech","Obama Praises Muslim Brotherhood Convention -- Obama hits bottom and keeps digging. His unequivocal support of the vicious Muslim Brotherhood has undermined national security and been an overwhelming destructive force for freedom across the world.","Rush Compares Left-Wing Reaction to Obama Rodeo Clown to Muslim Outrage","Ted Cruz Just Threw Down the Gauntlet on Obama and Support of the Muslim Brotherhood"],"sqwibb":["Fw: Muslim My Ass ( a.k.a. the worst thing gramma has ever sent me )"],"mkorostoff":["WYR only be allowed to hang out with graduate students, or rednecks?"],"dom19":["It has been established that Obama is a christian, but if he was a Muslim, why would it matter?"],"alaskamaniac":["Poll: 43 percent of Republicans believe Obama is a Muslim"],"madscientist420":["Hypocrisy in Christianity at its finest: An Obama bash thread in a Christian forum filled with racist, \"Obama is a Muslim\" slander. "],"big-dreams":["Obama on Islamophobia, ISIS, and Muslims"],"jocker12":["Trump Supporters Think Obama is A Muslim Born in Another Country"],"strictscrutiny":["Poll: 54% of Republicans say that, \"deep down,\" Obama is a Muslim: \" only nine percent said \"Christian,\" his stated religion.\"","Poll: 54% of Republicans say that, \"deep down,\" Obama is a Muslim: \" only nine percent said \"Christian,\" his stated religion.\""],"captain_unremarkable":["My mother is a beautiful woman, she gave birth to me, and I love her unconditionally, but she genuinely believes Barack Obama is a Muslim. Is there any way I can tear her away from the cult-like grasp Fox News has on her? It\u0027s destroying her."],"lastchance":["\"Obama is a Muslim\" Origin Revealed"],"ringopendragon":["Rush Limbaugh says Barack Obama turned NASA into a \u0027Muslim outreach department\u0027"],"yolfer":["In Latest Compromise with GOP, Obama Agrees He is a Muslim"],"burnt-orange":["Proof that there is hope...My mom supports OWS"],"pocahontas_spaceman":["Happy Freedom! An open letter to users here, and the mods/users at r/conservative"],"zadocpaet":["Muslim Obama attacks NFL","Apparently \"Muslim\" Obama is attacking the NFL"],"mepper":["Why the IRS Has Stopped Auditing Churches—Even One that Calls President Obama a Muslim: The decision on who can authorize investigations of churches that influence voters is frozen for foreseeable future","Republican Islamophobes shocked to learn Romney\u0027s more Muslim than Obama: It is curious that conservative evangelical Republicans are supporting Willard Romney when he belongs to a religion that has more in common with Islam than it does Christianity","WorldNetDaily Columnist \u0027Read Somewhere\u0027 That Obama \u0027Was Registered As A Muslim In Hawaii\u0027","Why the IRS Has Stopped Auditing Churches—Even One that Calls President Obama a Muslim: Bureaucracy","Tea Party Congressman Louie Gohmert (R-TX) on WND\u0027s radio program: Muslim Brotherhood is guiding Obama in Boston bombings investigation"],"mr_majorly":["Obama to Urge U.N. to Confront Roots of Muslim Rage: “Today, we must affirm that our future will be determined by people like Chris Stevens, and not by his killers,”"],"chabanais":["Powers: \u0027If Christians Threw 12 Muslims to Their Deaths Would Obama Have Been So Disinterested?\u0027","Christians Killed and Persecuted by Muslim Brotherhood That Obama and Clinton Supported","27 Iraqi Christians face deportation in U.S. while Obama offers asylum to thousands of Muslims from Syria","Obama to Visit Mosque, Host Muslim Leaders on July 4th"],"mendokusai":["Hannity: No One At Fox News Has Ever Accused Obama Of Being A Muslim"],"normalstranger":["School district stops Christian group from meeting during school hours. Christians spew the usual anti-Muslim/Obama/atheist garbage in comments."],"wang-banger":["The speech that spread democracy faster than any war: Obama\u0027s message to the Muslim world in Cairo. ","I just accidentally watched Glenn Beck explain that that reason people think Obama is Muslim is because the President is not the right kind of Christian. Dude. Glenn, you\u0027re a Mormon. Scientologists make fun of Mormons.","It\u0027s National Tell-A-Stupid-Person-That-Barrack-Obama-Isn\u0027t-Muslim Weekend.  Get Busy!","Personally, I Preferred Obama\u0027s Speech to the Muslim World a Little More Than George W. Bush\u0027s Seven-Year Plan to Piss Off the Muslim World"],"rkkim":["Hank Williams Jr: Obama is Muslim \"who hates the U.S.\" - Celebrity Circuit - CBS News"],"presidentender":["THIS IS A LIST OF THE GUNS YOU SHOULD GET. NO. NO QUESTIONS. THIS IS THE LIST."],"apopheniac1989":["Yes, any tower with some circly things on it is an \"Islamic Minaret\". Therefore, Obama is Muslim. QED"],"imtoophilosophical":["Does anybody else dislike to a degree the american strand of conservatism?"],"mr_ron_mexico":["Do you think Barack Obama is a muslim? Alabama \nRepublicans: 45% say yes. Mississippi: 52%."],"freeth1nker":["Obama warns: Discrimination against Muslims helps ISIS"],"ppmd":["CMV: Muslim communities should help in the fight against extremist Islamic terrorists"],"atheistness":["A conservative on IG trying to convince me that President Obama is a Muslim."],"certificateofmerritt":["Christmas Eve Megathread"],"former_fat_princess":["Obama reads book written by Muslim; hates America"],"yantando":["Mojo Panel: Hillary Started the Obama Muslim Rumors She Condemns"],"scootypuffjunior":["Why are some people obsessed with proving that Obama is a Muslim?"],"meowlsarereal":["Egyptian media says Obama is a Muslim Brotherhood member"],"ablack9000":["In light of the census, I\u0027d like to provide some insight into the lack of religious representation."],"dfohpngtfbs":["I was only a young child during the Clinton presidency. Do conservatives always attack Democrat presidents like they have Obama?"],"dons":["Stay classy Conservapedia: \"Obama will likely become the first Muslim to be sworn in as President\""],"kkmph7":["Bullshit called on \"When will Obama force MUSLIMS to Gay Marry?!\""],"axolotl_peyotl":["South Africa High Court war crimes case against US President Barack Obama: The Muslim Lawyers Association (MLA) brought an application to court on Tuesday to charge Barack Obama with a number of crimes before he enters South Africa on June 28th, 2013."],"cb1037":["Superior Mayor says: \"Unbelievable! She [Michelle Obama] and her Muslim partner have destroyed the fabric of democracy that was so very hard fought for!\""],"molly9945":["Ok I give up, why would it be bad if President Obama was Muslim?"],"helbertnc":["If Obama is a Muslim, he isn\u0027t very good at it..."],"scannerbrightly":["Poll: 54% of Republicans say that, \"deep down,\" Obama is a Muslim"],"pinkspaceship17":["FWD:FWD: I guess we can thank obama and his muslim beliefs for this one folks!!! Ridiculous!!!"],"fcdrandy":["If you think this sub is for you, it\u0027s probably not for you.","\"Hillary is the one who started the Obama is a muslim thing. Eight years later we\u0027re still calling Obama a muslim\""],"fuzzo":["Obama in league with Muslim Brotherhood according to neocons."],"patrick_winn_bangkok":["I\u0027m Patrick Winn, a US journalist covering Burma/Myanmar. I\u0027ve embedded with guerrillas, covered violence between Buddhists and Muslims (including the Rohingya), investigated military-owned mines and gone boozing with foreign investors swarming to get rich in reform-era Myanmar. AMA"],"tuoder":["Perhaps in an effort to rehabilitate the United States’ image in the Muslim world, the Obama administration has joined a U.N. effort to restrict religious speech. This country should never sacrifice freedom of expression on the altar of religion."],"parrallax91":["What do you think would piss off evangelicals more, if Obama was secretly a Muslim or if he was secretly an Atheist?"],"paperwasp":["Poll finds 23% of Texans think Obama is Muslim"],"greengrasser11":["I missed the meeting last week guys, but could someone fill me in on when we\u0027re allowed to let everyone know that Obama is Muslim?"],"pinkslimeispeople":["Ted Nugent Goes Birther, Suggests Obama Is Muslim In Latest Tirade","The Latest Right-Wing Conspiracy Theory: Obama\u0027s Third Term. Our Kenyan-born, secret Muslim president has apparently cooked up a sneaky plot to subvert the 22nd Amendment."],"powersthatbe1":["\"President Barack Obama has launched twice as many strikes on countries that are predominantly Muslim than President George W. Bush.\" Politifact: Mostly TRUE"],"tasmajdan":["Obama is already fighting two wars in Muslim countries he did not start and did not want to author another, but after weeks pondering he finally made his mind up: the US wants Muammar Gaddafi\u0027s head and it will fight to get it"],"twisteddrum5":["As a republican,when I heard other republicans say Obama is a Muslim I automatically assume they are ignorant of all politics.  As a democrat, what is something you hear from other democrats that makes you hardcore face-palm?"],"suekichi":["Juan Cole: Netanyahu, Seeking $5 Billion a Year From U.S., Hires Man Who Called Obama a Muslim Hate Sympathizer - Juan Cole"],"tpaulman":["Things Only a Republican Could Believe"],"ahoyhoyhey":["54% of Republicans Think Obama Is a Muslim According to New Poll"],"jaysnapmatic":["Bernie Sanders: Trump\u0027s Reaction to Obama Muslim Question a \u0027Disgrace\u0027"],"swimshoe":["Is Obama really a Muslim?"],"justinpgardner":["Poll: 13% think Obama is a muslim, up from 8% in December."]}