{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"I need help convincing my hardcore conservative dad to vote for Obama, or at least someone other than Romney.","label":"retrocorn","duration":"","id":0,"color":"red","redditID":"t3_112ik7","isTrueCluster":"true","timestamp":1.34960308E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/obama/comments/112ik7/i_need_help_convincing_my_hardcore_conservative/","permalink":"/r/obama/comments/112ik7/i_need_help_convincing_my_hardcore_conservative/?ref\u003dsearch_posts","author":"RetroCorn","title":"I need help convincing my hardcore conservative dad to vote for Obama, or at least someone other than Romney.","subreddit":"obama","subredditId":"t5_1a8ah","thumbnail":"self","selftext":"To put this into perspective: He loves Reagan, pretty much hates Obama, possibly still thinks Obama was born in Kenya, possibly thinks Obama is Muslim, thinks trickle-down economics work, thinks capitalism is 100% correct 100% of the time, thinks Glenn Beck/Bill O\u0027Reilly/Rush Limbaugh are right and that what they say is true, and more. At this point, he\u0027ll vote for Romney because he isn\u0027t Obama.\n\nHere\u0027s the kicker, and one of the larger reasons I want to convince him to vote for someone else. I\u0027m gay. Mitt Romney has gone on the record saying that he wants a constitutional amendment which specifically prevents same-sex marriage. I fear that many other anti-LGBT policies could be enacted should Romney sit in the oval office. It just hurts me to see my dad, who KNOWS I\u0027m gay, supporting individuals who don\u0027t believe in equality.\n\nSo basically I need to convince him to either vote for Obama or just someone other than Mitt Romney. I have no idea what all I would need to say to convince him, but I know I would need multiple sources showing the real Mitt Romney from all manner of sites. It\u0027s probable that he would write off anything which comes from a specifically liberal website.\n\nI have no idea where to start... Any help would be appreciated.\n\nThanks.","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;To put this into perspective: He loves Reagan, pretty much hates Obama, possibly still thinks Obama was born in Kenya, possibly thinks Obama is Muslim, thinks trickle-down economics work, thinks capitalism is 100% correct 100% of the time, thinks Glenn Beck/Bill O\u0026amp;#39;Reilly/Rush Limbaugh are right and that what they say is true, and more. At this point, he\u0026amp;#39;ll vote for Romney because he isn\u0026amp;#39;t Obama.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Here\u0026amp;#39;s the kicker, and one of the larger reasons I want to convince him to vote for someone else. I\u0026amp;#39;m gay. Mitt Romney has gone on the record saying that he wants a constitutional amendment which specifically prevents same-sex marriage. I fear that many other anti-LGBT policies could be enacted should Romney sit in the oval office. It just hurts me to see my dad, who KNOWS I\u0026amp;#39;m gay, supporting individuals who don\u0026amp;#39;t believe in equality.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;So basically I need to convince him to either vote for Obama or just someone other than Mitt Romney. I have no idea what all I would need to say to convince him, but I know I would need multiple sources showing the real Mitt Romney from all manner of sites. It\u0026amp;#39;s probable that he would write off anything which comes from a specifically liberal website.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;I have no idea where to start... Any help would be appreciated.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Thanks.\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.obama","gilded":0,"commentCount":18,"score":7,"upVotes":7,"downVotes":0,"created":1.34960308E9,"createdUTC":1.34957428E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"112ik7","fullName":"t3_112ik7"}],"sankeyNodes":[],"sentiments":[]}