{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"In light of the census, I\u0027d like to provide some insight into the lack of religious representation.","label":"ablack9000","duration":"","id":0,"color":"red","redditID":"t3_1ulii2","isTrueCluster":"true","timestamp":1.38909585E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/DebateReligion/comments/1ulii2/in_light_of_the_census_id_like_to_provide_some/","permalink":"/r/DebateReligion/comments/1ulii2/in_light_of_the_census_id_like_to_provide_some/?ref\u003dsearch_posts","author":"ablack9000","title":"In light of the census, I\u0027d like to provide some insight into the lack of religious representation.","subreddit":"DebateReligion","subredditId":"t5_2snuc","thumbnail":"","selftext":"For starters, past all the angry/frustrating/confusing/distracting comments from the ignorant atheists, the honest atheists ask questions that I can barely address with a BA from a Big Ten Uni with a minor in Religion.  As a philosophy loving Christian, I really do enjoy it, but its also something that I\u0027ve done my entire life, and I have access to it every Wednesday and Sunday mornings.  We call it bible study, and we challenge each other on most of the contradictions that we bring up in this sub all the time.  And yes, they tend to not be as aggressive about calling God a murderous, slavery loving rapist, but we hash out those kind of angry thoughts about God with a couple of beers around a campfire with our closest friends and family.  \n\nTo most of us, religion is a very simple way to create a philosophy of life together, as a community of people who care about each other.  Sure, we use scripture as a source of discussion topics and we listen to an expert on said topics each Sunday, but we don\u0027t sit around and talk about how America is being ruined by the gays and how Obama is a 007 Muslim.  This is the norm for the vast majority of Christian communities, and the protestant revolution ensured that we are able to control this environment democratically and socially progress appropriately.   \n\nMy point is that this subreddit has become a similar type of environment for atheists to address their thoughts about what we, as a species, call God.  Whether or not we like it, the concept of God is very much a part of the world we live in and the people we interact with.  Religious redditors already have a place to do this (church) and atheists typically do not.  \n\nSo there\u0027s little opportunity, and/or motivation for the average Christian to participate in a forum like this.  One way to increase Christian participation might be to include more links to blogs/videos/articles that represent popular opinion about scripture, instead of just an 1800 yr. old verse.  Another might be to link information if you recognize someone struggling to appeal to a more famous argument, instead of using it as an opportunity to ravish your opponent like there\u0027s a trophy to win.  And finally, for the genuine atheist amateur philosophers, moving forward, I will speak up when I see Ray Comfort fans, and I\u0027ll ask for reciprocation with the Bill Maher type of nonsense. \n\nThank you,\nand God Bless!;)","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;For starters, past all the angry/frustrating/confusing/distracting comments from the ignorant atheists, the honest atheists ask questions that I can barely address with a BA from a Big Ten Uni with a minor in Religion.  As a philosophy loving Christian, I really do enjoy it, but its also something that I\u0026amp;#39;ve done my entire life, and I have access to it every Wednesday and Sunday mornings.  We call it bible study, and we challenge each other on most of the contradictions that we bring up in this sub all the time.  And yes, they tend to not be as aggressive about calling God a murderous, slavery loving rapist, but we hash out those kind of angry thoughts about God with a couple of beers around a campfire with our closest friends and family.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;To most of us, religion is a very simple way to create a philosophy of life together, as a community of people who care about each other.  Sure, we use scripture as a source of discussion topics and we listen to an expert on said topics each Sunday, but we don\u0026amp;#39;t sit around and talk about how America is being ruined by the gays and how Obama is a 007 Muslim.  This is the norm for the vast majority of Christian communities, and the protestant revolution ensured that we are able to control this environment democratically and socially progress appropriately.   \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;My point is that this subreddit has become a similar type of environment for atheists to address their thoughts about what we, as a species, call God.  Whether or not we like it, the concept of God is very much a part of the world we live in and the people we interact with.  Religious redditors already have a place to do this (church) and atheists typically do not.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;So there\u0026amp;#39;s little opportunity, and/or motivation for the average Christian to participate in a forum like this.  One way to increase Christian participation might be to include more links to blogs/videos/articles that represent popular opinion about scripture, instead of just an 1800 yr. old verse.  Another might be to link information if you recognize someone struggling to appeal to a more famous argument, instead of using it as an opportunity to ravish your opponent like there\u0026amp;#39;s a trophy to win.  And finally, for the genuine atheist amateur philosophers, moving forward, I will speak up when I see Ray Comfort fans, and I\u0026amp;#39;ll ask for reciprocation with the Bill Maher type of nonsense. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Thank you,\nand God Bless!;)\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.DebateReligion","gilded":0,"commentCount":249,"score":32,"upVotes":32,"downVotes":0,"created":1.38909585E9,"createdUTC":1.38906705E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"1ulii2","fullName":"t3_1ulii2"}],"sankeyNodes":[],"sentiments":[]}