{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"THIS IS A LIST OF THE GUNS YOU SHOULD GET. NO. NO QUESTIONS. THIS IS THE LIST.","label":"presidentender","duration":"","id":0,"color":"red","redditID":"t3_118keg","isTrueCluster":"true","timestamp":1.349873956E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/guns/comments/118keg/this_is_a_list_of_the_guns_you_should_get_no_no/","permalink":"/r/guns/comments/118keg/this_is_a_list_of_the_guns_you_should_get_no_no/?ref\u003dsearch_posts","author":"presidentender","title":"THIS IS A LIST OF THE GUNS YOU SHOULD GET. NO. NO QUESTIONS. THIS IS THE LIST.","subreddit":"guns","subredditId":"t5_2qhc8","thumbnail":"self","selftext":"ALRIGHT SNOWFLAKES. Listen up. You\u0027re special and unique and your mommy loves you very much and if you just applied yourself I\u0027m sure you\u0027d go real far (as if that\u0027s somehow a compliment). But guns are guns and your performance is pretty well independent of the platform you\u0027re using, barring extreme differences in quality or your five insurmountable minutes of familiarity with Paw Paw\u0027s 1911. \n\nSo these are the guns you should buy, *and the order in which you should buy them*. \n\n(Yeah, I know, general readership; you bought a Mosin first and you learned super good and now you and your sandbags and your concrete table can always hit the clay pigeons you set on the ground at a distance that\u0027s actually 73 yards, but what the hell, call it 100 for the internet. I\u0027m not writing for you, and newbie here should make purchases he\u0027ll use to learn things instead of following in your illustrious footsteps.)\n\n**FIRST GUN:** First we\u0027re going to put on our big boy pants and go to the local Wal-Mart and get us a Ruger 10/22. There\u0027s nothing wrong with most other .22 rifles, sure. Your grandpa wanted you to learn on a bolt action so you\u0027d \"take your time and value each shot.\" Your grandpa has no idea what he\u0027s talking about. 10/22. [Tech sights](http://tech-sights.com). USGI sling. [Appleseed](http://appleseedinfo.org). No more fucking questions until you do that. Also, Wal-Mart is peopled by dispassionate wage slaves who won\u0027t try to upsell you to some other bullshit you neither want nor need. If you go to a gun store, you\u0027re gonna walk out with some random WASR or something, because you\u0027re too dumb to do your research beforehand and are asking strangers of unknown wisdom on the internet what to buy. \n\nYou\u0027re all Appleseeded up and you\u0027re super cool and now you want a\n\n**HANDGUN:** Glock 19. No. I don\u0027t care that the M\u0026amp;P fits your hand better or that the SR9 is cheaper. Shut the fuck up. You\u0027re asking vapid entry-level questions on the internet. Get the Glock. Not a 1911, not my beloved CZ-75, not a SIG, not an overpriced goddamn HK that\u0027s gonna turn you into Tom Cruise from Collateral. Glock 19.\n\nThe communist zombie 1% martian UN muslim Obama Axe body spray troops are invading and you need a\n\n**RIFLE:** HOLY SHIT I CAN STILL EDIT THIS ARCHIVED AS HELL POST I AM SO HAPPY [Palmetto State Armory](https://www.palmettostatearmory.com/) AR-15. Play fucking legos with it. Go nuts. Throw red dots and lasers and a vertical goddamn frontpenis on there. It\u0027ll make you tacticooler and you wouldn\u0027t listen to my real advice (which is to leave it bone-stock and add accessories as necessary to address real shortcomings you experience on the range rather than perceived problems invented by marketers) anyway.\n\nYeah, but for home defense you want to make badguy shit his pants in the universal language and so you need a\n\n**SHOTGUN:** [Mossberg 590](http://www.mossberg.com/product/shotguns-pump-action-590-special-purpose-special-purpose-9-shot/50645). Mossberg 500s are fine but those listed on their web site are either all tacticool or designed for Elmer Fudd to shoot gooses and shit. God damn. Just spend some reasonable fucking money on a black-furniture-having shotgun that\u0027s short enough for your hallway, dipshit. Oh, and if there\u0027s a pistol grip on there, I will laugh at you as soon as you leave.\n\nNow take some blurry pictures of your special and exciting new \"family,\" because I care a whole goddamn lot about your ego investment purchases and wish to validate you as a human being via that little orange arrow and I think it\u0027s just *darling* when you refer to guns as if they\u0027re people. \n\n**UH OH HERE COMES THE EDIT:**\n\n\u0026gt;I LIEK MY 1911 AND OR DIFFERENT SELECTION FOR OTHER CATEGORY OP IS TROLLING\n\nYou\u0027re an idiot. I\u0027ve never seen your username before. You only came here because this thing has 4,780,000 upvotes and is on your front page. You know why it gets those? BECAUSE I\u0027M RIGHT, YOU DUMBASS. \n\n\u0026gt;This is a list of my guns in the comment! Look how much value I bring to the table! Love me please!\n\nNo. Shut the fuck up. Nobody cares. Your thirty random purchases illustrate your consumerism and borderline hoarding, not competency. Most of those are your dad\u0027s anyway.\n\n\u0026gt;GLOCKS R BAD OP IS TROLLING\n\nWHERE ARE YOU PEOPLE IN EVERYDAY /R/GUNS COMMENTING? I would relish the opportunity to metaphorically remove your entrails via your anus and strangle you with them in arguments. unfortunately there are about a hundred of you in these comments and so responding to all of you would take too long. \n\n\u0026gt;EVERYONE IS A SPECIAL UNIQUE OPINION HAVER AND SHOULD DO WHATEVER THEY WANT PRESIDENTENDER IS NOT MY REAL DAD\n\nThat\u0027s great. How\u0027s the liberal arts degree working out for you? Yes, I would like fries with that. \n\n\u0026gt;OMG I LOVE YOU PRESIDENTENDER\n\nI love you too. \n\n\u0026gt; THIS POST SHOULD BE MORE BROAD\n\nYou are a moron and you do not understand how any of this works\n\n\u0026gt; LOOK GUYS I WROTE A BUYING GUIDE\n\nthat\u0027s cute\n\n\u0026gt; SPIKES TACTICAL IS THE WRONG ADVICE\n\nlook again it says PSA now","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;ALRIGHT SNOWFLAKES. Listen up. You\u0026amp;#39;re special and unique and your mommy loves you very much and if you just applied yourself I\u0026amp;#39;m sure you\u0026amp;#39;d go real far (as if that\u0026amp;#39;s somehow a compliment). But guns are guns and your performance is pretty well independent of the platform you\u0026amp;#39;re using, barring extreme differences in quality or your five insurmountable minutes of familiarity with Paw Paw\u0026amp;#39;s 1911. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;So these are the guns you should buy, \u0026lt;em\u0026gt;and the order in which you should buy them\u0026lt;/em\u0026gt;. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;(Yeah, I know, general readership; you bought a Mosin first and you learned super good and now you and your sandbags and your concrete table can always hit the clay pigeons you set on the ground at a distance that\u0026amp;#39;s actually 73 yards, but what the hell, call it 100 for the internet. I\u0026amp;#39;m not writing for you, and newbie here should make purchases he\u0026amp;#39;ll use to learn things instead of following in your illustrious footsteps.)\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;FIRST GUN:\u0026lt;/strong\u0026gt; First we\u0026amp;#39;re going to put on our big boy pants and go to the local Wal-Mart and get us a Ruger 10/22. There\u0026amp;#39;s nothing wrong with most other .22 rifles, sure. Your grandpa wanted you to learn on a bolt action so you\u0026amp;#39;d \u0026amp;quot;take your time and value each shot.\u0026amp;quot; Your grandpa has no idea what he\u0026amp;#39;s talking about. 10/22. \u0026lt;a href\u003d\"http://tech-sights.com\"\u0026gt;Tech sights\u0026lt;/a\u0026gt;. USGI sling. \u0026lt;a href\u003d\"http://appleseedinfo.org\"\u0026gt;Appleseed\u0026lt;/a\u0026gt;. No more fucking questions until you do that. Also, Wal-Mart is peopled by dispassionate wage slaves who won\u0026amp;#39;t try to upsell you to some other bullshit you neither want nor need. If you go to a gun store, you\u0026amp;#39;re gonna walk out with some random WASR or something, because you\u0026amp;#39;re too dumb to do your research beforehand and are asking strangers of unknown wisdom on the internet what to buy. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;You\u0026amp;#39;re all Appleseeded up and you\u0026amp;#39;re super cool and now you want a\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;HANDGUN:\u0026lt;/strong\u0026gt; Glock 19. No. I don\u0026amp;#39;t care that the M\u0026amp;amp;P fits your hand better or that the SR9 is cheaper. Shut the fuck up. You\u0026amp;#39;re asking vapid entry-level questions on the internet. Get the Glock. Not a 1911, not my beloved CZ-75, not a SIG, not an overpriced goddamn HK that\u0026amp;#39;s gonna turn you into Tom Cruise from Collateral. Glock 19.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The communist zombie 1% martian UN muslim Obama Axe body spray troops are invading and you need a\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;RIFLE:\u0026lt;/strong\u0026gt; HOLY SHIT I CAN STILL EDIT THIS ARCHIVED AS HELL POST I AM SO HAPPY \u0026lt;a href\u003d\"https://www.palmettostatearmory.com/\"\u0026gt;Palmetto State Armory\u0026lt;/a\u0026gt; AR-15. Play fucking legos with it. Go nuts. Throw red dots and lasers and a vertical goddamn frontpenis on there. It\u0026amp;#39;ll make you tacticooler and you wouldn\u0026amp;#39;t listen to my real advice (which is to leave it bone-stock and add accessories as necessary to address real shortcomings you experience on the range rather than perceived problems invented by marketers) anyway.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Yeah, but for home defense you want to make badguy shit his pants in the universal language and so you need a\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;SHOTGUN:\u0026lt;/strong\u0026gt; \u0026lt;a href\u003d\"http://www.mossberg.com/product/shotguns-pump-action-590-special-purpose-special-purpose-9-shot/50645\"\u0026gt;Mossberg 590\u0026lt;/a\u0026gt;. Mossberg 500s are fine but those listed on their web site are either all tacticool or designed for Elmer Fudd to shoot gooses and shit. God damn. Just spend some reasonable fucking money on a black-furniture-having shotgun that\u0026amp;#39;s short enough for your hallway, dipshit. Oh, and if there\u0026amp;#39;s a pistol grip on there, I will laugh at you as soon as you leave.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Now take some blurry pictures of your special and exciting new \u0026amp;quot;family,\u0026amp;quot; because I care a whole goddamn lot about your ego investment purchases and wish to validate you as a human being via that little orange arrow and I think it\u0026amp;#39;s just \u0026lt;em\u0026gt;darling\u0026lt;/em\u0026gt; when you refer to guns as if they\u0026amp;#39;re people. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;UH OH HERE COMES THE EDIT:\u0026lt;/strong\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;I LIEK MY 1911 AND OR DIFFERENT SELECTION FOR OTHER CATEGORY OP IS TROLLING\u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;You\u0026amp;#39;re an idiot. I\u0026amp;#39;ve never seen your username before. You only came here because this thing has 4,780,000 upvotes and is on your front page. You know why it gets those? BECAUSE I\u0026amp;#39;M RIGHT, YOU DUMBASS. \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;This is a list of my guns in the comment! Look how much value I bring to the table! Love me please!\u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;No. Shut the fuck up. Nobody cares. Your thirty random purchases illustrate your consumerism and borderline hoarding, not competency. Most of those are your dad\u0026amp;#39;s anyway.\u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;GLOCKS R BAD OP IS TROLLING\u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;WHERE ARE YOU PEOPLE IN EVERYDAY /R/GUNS COMMENTING? I would relish the opportunity to metaphorically remove your entrails via your anus and strangle you with them in arguments. unfortunately there are about a hundred of you in these comments and so responding to all of you would take too long. \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;EVERYONE IS A SPECIAL UNIQUE OPINION HAVER AND SHOULD DO WHATEVER THEY WANT PRESIDENTENDER IS NOT MY REAL DAD\u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;That\u0026amp;#39;s great. How\u0026amp;#39;s the liberal arts degree working out for you? Yes, I would like fries with that. \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;OMG I LOVE YOU PRESIDENTENDER\u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;I love you too. \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;THIS POST SHOULD BE MORE BROAD\u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;You are a moron and you do not understand how any of this works\u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;LOOK GUYS I WROTE A BUYING GUIDE\u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;that\u0026amp;#39;s cute\u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;SPIKES TACTICAL IS THE WRONG ADVICE\u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;look again it says PSA now\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.guns","gilded":0,"commentCount":1355,"score":1566,"upVotes":1566,"downVotes":0,"created":1.349873956E9,"createdUTC":1.349845156E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"118keg","fullName":"t3_118keg"}],"sankeyNodes":[],"sentiments":[]}