{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"Dear America: You fought and sent a clear message to the powers that be by rejecting the notion that money should equate to power. If you want that work to pay off, you need to start understanding the power and importance of unions or it\u0027s all for naught.","label":"gloomdoom","duration":"","id":0,"color":"red","redditID":"t3_13d82t","isTrueCluster":"true","timestamp":1.353214884E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/politics/comments/13d82t/dear_america_you_fought_and_sent_a_clear_message/","permalink":"/r/politics/comments/13d82t/dear_america_you_fought_and_sent_a_clear_message/?ref\u003dsearch_posts","author":"gloomdoom","title":"Dear America: You fought and sent a clear message to the powers that be by rejecting the notion that money should equate to power. If you want that work to pay off, you need to start understanding the power and importance of unions or it\u0027s all for naught.","subreddit":"politics","subredditId":"t5_2cneq","thumbnail":"self","selftext":"After reading a significant amount of anti-union sentiment on reddit, it was a good reminder that Americans claim to want one thing (a stronger middle class, better treatment of workers, healthcare for all) and they tend to contradict that sentiment with this blind distaste for unions.\n\nLet\u0027s acknowledge a few things first: As the unions have gone, so has the middle class. So has health care. So have fair wages. So have pensions and security. So has the workers\u0027 voice. \n\nNow a little bit about the history of the American worker and the necessity of the union: Deep in the coalfields of Appalachia, there was a time long after slavery was abolished where poor people were treated like slaves. They worked in horrid conditions, regularly exposed to dangerous situations where they were sickened and died in order to make a wage that wouldn\u0027t even cover the costs of living. Many of them were paid in company script and were forced to live in company provided housing. That script was only good at the local store that was owned by the company. So by the time the worker paid his rent to the company and bought a few things at the company store to keep his family fed, there was nothing left.\n\nWell, the miners knew this wasn\u0027t a fair shake and they decided to stand up and demand actual pay and some safe conditions. They stood together, they fought, many died and they won the right to make demands from the company and its management. \n\nUpon doing so, they set a standard for workers everywhere and proved a point: Corporations were inherently designed to make the worker give up everything possible and to get the job done for the least amount of compensation possible. And then some. And unions spread across most industries and workers *knew* that if they wanted to be fairly compensated and to be treated like humans, they *had* to unionize. They needed strength to stand up to an entity loaded with money and lawyers and they were able to do that by investing in unions. After all, all unions were/are is a collective of average workers who demand a voice in how they are treated.\n\nThe middle class expanded at a record rate. American families had nice homes, a decent car (sometimes two), amazing health care, pensions, so that they could one day retire by paying into the company plan. Fair amounts of vacation and sick days. A voice in the collective direction of the company and representation should they need it if they are treated unfairly. America was the envy of the entire world at this point and equality was as solid as it had ever been in the history of the United States.\n\nFast forward to the early 80s: Ronald Reagan is president. He is working with an organized group of people who, like most current republicans, see the middle class as a drain on society and a bunch of leeches with too much power. The RICH should be running the show and the rich cannot run the show as long as the middle class are organized, active and making fair wages. So he started a push to put an end to that.\n\nAnd from that time on, unions were demonized in the media, they were made to seem like an outdated idea, they were made to look corrupt and greedy, they were made to blame anytime business went bad. Americans were living great, successful lives and started to buy into the media backlash on the unions. Because when you\u0027re doing well, have a cache of vacation days, amazing wages, health care, a fat pension as a worker, then you start to think, *\"I don\u0027t need a union! Look how well I\u0027m doing! These union fees are a waste of my money and I don\u0027t always agree with them anyway!\"*\n\nSo the people bought into it. The same way that many republicans buy into irrational ideas today as promoted by Fox News, et al. During that era, American equality started to shift to the ultra wealthy. Middle class wealth started to slide away. Companies busted unions left and right and that was acceptable because they were \u0027bad and corrupt and outdated.\u0027 The middle class started to shrink significantly and quickly.\n\nFast forward 30+ years: The middle class is smaller than it\u0027s been in 40 years and continues to shrink. The wealth of the middle class is at record lows while corporate profits are at records highs in many cases. Pensions and health care are considered \u0027luxuries\u0027 instead of standard. Wage freezes are common, vacation days limited, sick days are frowned upon from ever direction of upper management. People are *again* working for the least amount of compensation possible by the company who takes the money the workers *should* be earning for their role in the company and those funds are sent directly up to the top.\n\n**We\u0027re made to believe that if a company is successful, it\u0027s because of an amazing team of ultra qualified managers who make $17 million per year plus huge bonuses. BUT, if the company is struggling, it\u0027s all the fault of the workers who demand too much and don\u0027t work hard enough and are a drain on the company itself.**\n\nLike all false narratives, this is to create the means to an end: To continue treating American workers like they\u0027re leeches, to continue taking from them instead of giving..to make sure they don\u0027t make any kind of progress in wages or benefits.\n\nAnd that\u0027s ultimately what we saw with Hostess: A team of managers who were incapable of running a successful, competitive company and then demanding concessions from the *workers* as a result, all the while, giving the CEO and upper management huge raises of ridiculous sums. \n\nBut here\u0027s the bottom line, America: Unions built the middle class. They set the standards for working Americans: the 40-hour workweek, the paid vacation, the paid sick days, the health care, the pensions, the overtime pay, etc, etc. And as the unions have gone, so have those elements of what made us a successful nation and what built the middle class so well and so quickly. They *demanded* this stuff. They *knew* their worth as workers and they organized and stood up to speak in a single, consistent voice with legal representatives and by maintaining certain standards of work, production and output.\n\nAmericans stood up to collectively demand that things like Citizens United should be overturned and that the concept should be refuted. They stood up to defend things like Social Security, medicare, and other programs that ensure that Americans have a safety net and that the weakest Americans should still have a shot at a good life.\n\nBut if you think you can hand this power over to politicians and that\u0027s the end of it, you\u0027re wrong. Now is the time for Americans to become the active, organized, intelligent people they were going all the way back to those coal fields in West Virginia and Kentucky. I can promise you....if you\u0027re against unions, much of it is the result of what you\u0027ve *heard* rather than what you\u0027ve learned. The same reason that republicans who watch Fox News think that Obama is a muslim, a kenyan, a socialist, etc. I find it laughable when people are smart enough to realize those Fox News lies were created specifically to demonize Obama but when it comes to lies about Unions, they tend to believe those lies unquestionably as fact. \n\nIs there corruption in unions? Of course there is in some unions. Is there corruption in every level of government in some places? Absolutely. Is there corruption in companies and corporations, in their management and policies? ABSOLUTELY. Is there corruption in churches and school systems? Yes...so the point is that because there are pockets of corruption, you don\u0027t completely do away with and demonize government, corporations, churches, school systems, etc. You realize they\u0027re necessary and you eliminate the corruption and move them forward.\n\nIf Americans continue to buy into the right\u0027s deeply held concept that unions are bad for America, they\u0027ll never, ever move forward to reach the point where they were at the time whenever equality was at record levels and every American had a certain amount of safety nets provided to them by the companies they help make successful and profitable. It\u0027s that simple. And the idea of unions are *not* outdated. Anywhere there are people who are working for the success of a company, those people need to be organized so that there is communication between management and those who are being managed. \n\nWill it take balls? Yes. Your great-grandparents had them. Will it take a lot of work? Yes..your great-grandparents proved that it can be done with hard work. But until it happens, companies like Walmart will continue to pay sub-standard wages, control hours to avoid obligations of health care and benefits, they will continue outsourcing their jobs overseas anytime it\u0027s possible, they will always be trying to freeze wages and make *one* worker do the work of *two* or *three* people. \n\nSo it\u0027s time to move the country forward from the middle instead of from the top. And politicians *cannot* make this happen on their own...they need the work and the commitment of the middle class to stand up for themselves the way coal miners did at the Battle of Blair Mountain back in 1921. ","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;After reading a significant amount of anti-union sentiment on reddit, it was a good reminder that Americans claim to want one thing (a stronger middle class, better treatment of workers, healthcare for all) and they tend to contradict that sentiment with this blind distaste for unions.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Let\u0026amp;#39;s acknowledge a few things first: As the unions have gone, so has the middle class. So has health care. So have fair wages. So have pensions and security. So has the workers\u0026amp;#39; voice. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Now a little bit about the history of the American worker and the necessity of the union: Deep in the coalfields of Appalachia, there was a time long after slavery was abolished where poor people were treated like slaves. They worked in horrid conditions, regularly exposed to dangerous situations where they were sickened and died in order to make a wage that wouldn\u0026amp;#39;t even cover the costs of living. Many of them were paid in company script and were forced to live in company provided housing. That script was only good at the local store that was owned by the company. So by the time the worker paid his rent to the company and bought a few things at the company store to keep his family fed, there was nothing left.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Well, the miners knew this wasn\u0026amp;#39;t a fair shake and they decided to stand up and demand actual pay and some safe conditions. They stood together, they fought, many died and they won the right to make demands from the company and its management. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Upon doing so, they set a standard for workers everywhere and proved a point: Corporations were inherently designed to make the worker give up everything possible and to get the job done for the least amount of compensation possible. And then some. And unions spread across most industries and workers \u0026lt;em\u0026gt;knew\u0026lt;/em\u0026gt; that if they wanted to be fairly compensated and to be treated like humans, they \u0026lt;em\u0026gt;had\u0026lt;/em\u0026gt; to unionize. They needed strength to stand up to an entity loaded with money and lawyers and they were able to do that by investing in unions. After all, all unions were/are is a collective of average workers who demand a voice in how they are treated.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The middle class expanded at a record rate. American families had nice homes, a decent car (sometimes two), amazing health care, pensions, so that they could one day retire by paying into the company plan. Fair amounts of vacation and sick days. A voice in the collective direction of the company and representation should they need it if they are treated unfairly. America was the envy of the entire world at this point and equality was as solid as it had ever been in the history of the United States.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Fast forward to the early 80s: Ronald Reagan is president. He is working with an organized group of people who, like most current republicans, see the middle class as a drain on society and a bunch of leeches with too much power. The RICH should be running the show and the rich cannot run the show as long as the middle class are organized, active and making fair wages. So he started a push to put an end to that.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;And from that time on, unions were demonized in the media, they were made to seem like an outdated idea, they were made to look corrupt and greedy, they were made to blame anytime business went bad. Americans were living great, successful lives and started to buy into the media backlash on the unions. Because when you\u0026amp;#39;re doing well, have a cache of vacation days, amazing wages, health care, a fat pension as a worker, then you start to think, \u0026lt;em\u0026gt;\u0026amp;quot;I don\u0026amp;#39;t need a union! Look how well I\u0026amp;#39;m doing! These union fees are a waste of my money and I don\u0026amp;#39;t always agree with them anyway!\u0026amp;quot;\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;So the people bought into it. The same way that many republicans buy into irrational ideas today as promoted by Fox News, et al. During that era, American equality started to shift to the ultra wealthy. Middle class wealth started to slide away. Companies busted unions left and right and that was acceptable because they were \u0026amp;#39;bad and corrupt and outdated.\u0026amp;#39; The middle class started to shrink significantly and quickly.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Fast forward 30+ years: The middle class is smaller than it\u0026amp;#39;s been in 40 years and continues to shrink. The wealth of the middle class is at record lows while corporate profits are at records highs in many cases. Pensions and health care are considered \u0026amp;#39;luxuries\u0026amp;#39; instead of standard. Wage freezes are common, vacation days limited, sick days are frowned upon from ever direction of upper management. People are \u0026lt;em\u0026gt;again\u0026lt;/em\u0026gt; working for the least amount of compensation possible by the company who takes the money the workers \u0026lt;em\u0026gt;should\u0026lt;/em\u0026gt; be earning for their role in the company and those funds are sent directly up to the top.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;We\u0026amp;#39;re made to believe that if a company is successful, it\u0026amp;#39;s because of an amazing team of ultra qualified managers who make $17 million per year plus huge bonuses. BUT, if the company is struggling, it\u0026amp;#39;s all the fault of the workers who demand too much and don\u0026amp;#39;t work hard enough and are a drain on the company itself.\u0026lt;/strong\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Like all false narratives, this is to create the means to an end: To continue treating American workers like they\u0026amp;#39;re leeches, to continue taking from them instead of giving..to make sure they don\u0026amp;#39;t make any kind of progress in wages or benefits.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;And that\u0026amp;#39;s ultimately what we saw with Hostess: A team of managers who were incapable of running a successful, competitive company and then demanding concessions from the \u0026lt;em\u0026gt;workers\u0026lt;/em\u0026gt; as a result, all the while, giving the CEO and upper management huge raises of ridiculous sums. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;But here\u0026amp;#39;s the bottom line, America: Unions built the middle class. They set the standards for working Americans: the 40-hour workweek, the paid vacation, the paid sick days, the health care, the pensions, the overtime pay, etc, etc. And as the unions have gone, so have those elements of what made us a successful nation and what built the middle class so well and so quickly. They \u0026lt;em\u0026gt;demanded\u0026lt;/em\u0026gt; this stuff. They \u0026lt;em\u0026gt;knew\u0026lt;/em\u0026gt; their worth as workers and they organized and stood up to speak in a single, consistent voice with legal representatives and by maintaining certain standards of work, production and output.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Americans stood up to collectively demand that things like Citizens United should be overturned and that the concept should be refuted. They stood up to defend things like Social Security, medicare, and other programs that ensure that Americans have a safety net and that the weakest Americans should still have a shot at a good life.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;But if you think you can hand this power over to politicians and that\u0026amp;#39;s the end of it, you\u0026amp;#39;re wrong. Now is the time for Americans to become the active, organized, intelligent people they were going all the way back to those coal fields in West Virginia and Kentucky. I can promise you....if you\u0026amp;#39;re against unions, much of it is the result of what you\u0026amp;#39;ve \u0026lt;em\u0026gt;heard\u0026lt;/em\u0026gt; rather than what you\u0026amp;#39;ve learned. The same reason that republicans who watch Fox News think that Obama is a muslim, a kenyan, a socialist, etc. I find it laughable when people are smart enough to realize those Fox News lies were created specifically to demonize Obama but when it comes to lies about Unions, they tend to believe those lies unquestionably as fact. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Is there corruption in unions? Of course there is in some unions. Is there corruption in every level of government in some places? Absolutely. Is there corruption in companies and corporations, in their management and policies? ABSOLUTELY. Is there corruption in churches and school systems? Yes...so the point is that because there are pockets of corruption, you don\u0026amp;#39;t completely do away with and demonize government, corporations, churches, school systems, etc. You realize they\u0026amp;#39;re necessary and you eliminate the corruption and move them forward.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;If Americans continue to buy into the right\u0026amp;#39;s deeply held concept that unions are bad for America, they\u0026amp;#39;ll never, ever move forward to reach the point where they were at the time whenever equality was at record levels and every American had a certain amount of safety nets provided to them by the companies they help make successful and profitable. It\u0026amp;#39;s that simple. And the idea of unions are \u0026lt;em\u0026gt;not\u0026lt;/em\u0026gt; outdated. Anywhere there are people who are working for the success of a company, those people need to be organized so that there is communication between management and those who are being managed. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Will it take balls? Yes. Your great-grandparents had them. Will it take a lot of work? Yes..your great-grandparents proved that it can be done with hard work. But until it happens, companies like Walmart will continue to pay sub-standard wages, control hours to avoid obligations of health care and benefits, they will continue outsourcing their jobs overseas anytime it\u0026amp;#39;s possible, they will always be trying to freeze wages and make \u0026lt;em\u0026gt;one\u0026lt;/em\u0026gt; worker do the work of \u0026lt;em\u0026gt;two\u0026lt;/em\u0026gt; or \u0026lt;em\u0026gt;three\u0026lt;/em\u0026gt; people. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;So it\u0026amp;#39;s time to move the country forward from the middle instead of from the top. And politicians \u0026lt;em\u0026gt;cannot\u0026lt;/em\u0026gt; make this happen on their own...they need the work and the commitment of the middle class to stand up for themselves the way coal miners did at the Battle of Blair Mountain back in 1921. \u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.politics","gilded":0,"commentCount":701,"score":1004,"upVotes":1004,"downVotes":0,"created":1.353214884E9,"createdUTC":1.353186084E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"13d82t","fullName":"t3_13d82t"}],"sankeyNodes":[],"sentiments":[]}