{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"If you think this sub is for you, it\u0027s probably not for you.","label":"fcdrandy","duration":"","id":0,"color":"red","redditID":"t3_2ustbq","isTrueCluster":"true","timestamp":1.423115096E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/ShitRConservativeSays/comments/2ustbq/if_you_think_this_sub_is_for_you_its_probably_not/","permalink":"/r/ShitRConservativeSays/comments/2ustbq/if_you_think_this_sub_is_for_you_its_probably_not/?ref\u003dsearch_posts","author":"FCDRandy","title":"If you think this sub is for you, it\u0027s probably not for you.","subreddit":"ShitRConservativeSays","subredditId":"t5_2xlfc","thumbnail":"","selftext":"Our mod queue has been full of genius new accounts that we generally approve unless you\u0027re a dummy.  But we\u0027ve also had a whole lot of dummies, so here\u0027s a little reminder on what we\u0027re here for.\n\nIf you only know about republicans from television shows on Comedy Central or NBC, or you say things like \"reality has a liberal bias,\" you are in the wrong place. /r/politics is for you. If you have ever unironically said \"libtard,\" or think Obama is a Muslim, you are in the wrong place. /r/conservative is for you.\n\nWe are here exclusively to make fun of the blatant liberal trolls in /r/conservative sent from the Illuminati to make conservatives look like fools.  There\u0027s no way anyone who posts over there is a real person, they\u0027re all parodies of what liberals think conservatives are, and we are here to document that lunacy.  We are not here to foster an environment of liberal feel-goodery, we\u0027re not here to promote anti-conservative values, we\u0027re here strictly because what goes on in /r/conservative represents American conservatives the same way Chris Matthews represents your delicate liberal sensibilities.  \n\nWe would make fun of both political extremes, but mocking hardcore left-wingers on reddit is way too easy.  Don\u0027t bring that shit in here, or you will be spam filtered and mocked.\n\nWe don\u0027t care if you\u0027re liberal or conservative or anarchist or pastafarian or whatever.  If you try to pass whatever idiot idea you have off as fact, or if you quote Thomas Sowell\u0027s opinions as evidence that all liberals are idiots, or if you think that socialism never took root in America because the poor think of themselves as go fuck yourself, you will be put in the spam filter and your posts will disappear unless we manually approve them.  The moderation team here is lazy as fuck and almost never looks at the thing, so chances are your brilliant paraphrase of Black Flag lyrics will inspire you alone.\n\nSo no, Sarah Palin is not the best the Republican party has, Obama is not a republican, Democrats did not free the slaves, and Elizabeth Warren does not have a chance in hell of doing anything other than getting on MSNBC.  You are wrong about all of that.  And if you want to talk about Dubs, the most patriotic President to serve between 2000 and 2008, go to /r/shrubs.  He\u0027s like Voldemort here, we dare not speak his name.\n\nEnjoy your time here laughing at what some liberals think conservatives are.  That\u0027s what we\u0027re here for.  Any dissent will be treated with beatings.  The beatings will continue until morale improves.\n\nITT: \u0027Liberals\u0027 fighting for the right to generalize and condemn","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;Our mod queue has been full of genius new accounts that we generally approve unless you\u0026amp;#39;re a dummy.  But we\u0026amp;#39;ve also had a whole lot of dummies, so here\u0026amp;#39;s a little reminder on what we\u0026amp;#39;re here for.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;If you only know about republicans from television shows on Comedy Central or NBC, or you say things like \u0026amp;quot;reality has a liberal bias,\u0026amp;quot; you are in the wrong place. \u0026lt;a href\u003d\"/r/politics\"\u0026gt;/r/politics\u0026lt;/a\u0026gt; is for you. If you have ever unironically said \u0026amp;quot;libtard,\u0026amp;quot; or think Obama is a Muslim, you are in the wrong place. \u0026lt;a href\u003d\"/r/conservative\"\u0026gt;/r/conservative\u0026lt;/a\u0026gt; is for you.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;We are here exclusively to make fun of the blatant liberal trolls in \u0026lt;a href\u003d\"/r/conservative\"\u0026gt;/r/conservative\u0026lt;/a\u0026gt; sent from the Illuminati to make conservatives look like fools.  There\u0026amp;#39;s no way anyone who posts over there is a real person, they\u0026amp;#39;re all parodies of what liberals think conservatives are, and we are here to document that lunacy.  We are not here to foster an environment of liberal feel-goodery, we\u0026amp;#39;re not here to promote anti-conservative values, we\u0026amp;#39;re here strictly because what goes on in \u0026lt;a href\u003d\"/r/conservative\"\u0026gt;/r/conservative\u0026lt;/a\u0026gt; represents American conservatives the same way Chris Matthews represents your delicate liberal sensibilities.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;We would make fun of both political extremes, but mocking hardcore left-wingers on reddit is way too easy.  Don\u0026amp;#39;t bring that shit in here, or you will be spam filtered and mocked.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;We don\u0026amp;#39;t care if you\u0026amp;#39;re liberal or conservative or anarchist or pastafarian or whatever.  If you try to pass whatever idiot idea you have off as fact, or if you quote Thomas Sowell\u0026amp;#39;s opinions as evidence that all liberals are idiots, or if you think that socialism never took root in America because the poor think of themselves as go fuck yourself, you will be put in the spam filter and your posts will disappear unless we manually approve them.  The moderation team here is lazy as fuck and almost never looks at the thing, so chances are your brilliant paraphrase of Black Flag lyrics will inspire you alone.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;So no, Sarah Palin is not the best the Republican party has, Obama is not a republican, Democrats did not free the slaves, and Elizabeth Warren does not have a chance in hell of doing anything other than getting on MSNBC.  You are wrong about all of that.  And if you want to talk about Dubs, the most patriotic President to serve between 2000 and 2008, go to \u0026lt;a href\u003d\"/r/shrubs\"\u0026gt;/r/shrubs\u0026lt;/a\u0026gt;.  He\u0026amp;#39;s like Voldemort here, we dare not speak his name.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Enjoy your time here laughing at what some liberals think conservatives are.  That\u0026amp;#39;s what we\u0026amp;#39;re here for.  Any dissent will be treated with beatings.  The beatings will continue until morale improves.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;ITT: \u0026amp;#39;Liberals\u0026amp;#39; fighting for the right to generalize and condemn\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.ShitRConservativeSays","gilded":0,"commentCount":106,"score":16,"upVotes":16,"downVotes":0,"created":1.423115096E9,"createdUTC":1.423086296E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"2ustbq","fullName":"t3_2ustbq"}],"sankeyNodes":[],"sentiments":[]}