{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"WYR only be allowed to hang out with graduate students, or rednecks?","label":"mkorostoff","duration":"","id":0,"color":"red","redditID":"t3_20q9rf","isTrueCluster":"true","timestamp":1.395189884E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/WouldYouRather/comments/20q9rf/wyr_only_be_allowed_to_hang_out_with_graduate/","permalink":"/r/WouldYouRather/comments/20q9rf/wyr_only_be_allowed_to_hang_out_with_graduate/?ref\u003dsearch_posts","author":"MKorostoff","title":"WYR only be allowed to hang out with graduate students, or rednecks?","subreddit":"WouldYouRather","subredditId":"t5_2qr1y","thumbnail":"","selftext":"If you pick graduate students, they\u0027ll mostly be like normal people, except occasionally their ivory towered elitism will shine through.  They like to hang in bars, but judge you pretty hard for liking sports.  You\u0027ll be able to have interesting conversations about art, literature, philosophy, and economics, though you\u0027ll often be frustrated by their oblivious, fantasy-world, academic outlook on these subjects.  They\u0027ll use words like \"intersectionality\" and \"neoliberalism\" in casual conversation.  They\u0027ll object to innocuous things with meaningless theoretical explanations about \"prescriptive modes of social engagement\" and \"hypercapitalist tragedy recontextualized as farce.\"  They quote Slavoj Zizek and Noam Chomsky while trying to order a pizza.  They\u0027ll sneer at you for giving change to a homeless person and call it \"problematic.\"\n\nIf you pick rednecks, they\u0027ll mostly be like normal people, except occasionally their inbred, racist ignorance will shine through.  They love classic rock, but judge you pretty hard for liking jazz.  You\u0027ll be able to go to awesome concerts, honky-tonks, fairs, rodeos, and drag races, though you\u0027ll often be frustrated by the provincial, hick conversation you\u0027re constantly subjected to.  They\u0027ll call you a \"homo\" for ordering pineapple on pizza.  They\u0027ll call you a homo for not owning a gun.  They\u0027ll call you a homo for the size of your tires, the color of your shirt, the beer you buy, and basically anything that is even remotely unfamiliar to them.  They collect welfare while simultaneously spouting nonsense about lazy black people on welfare.  They think Obama is a Muslim.  They think the Democrats raised their taxes, despite never having paid taxes.  They\u0027ll sneer at you for giving change to a homeless person and call you a homo.  Then slap you on the back and say \"come on, chug this beer with me.\"","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;If you pick graduate students, they\u0026amp;#39;ll mostly be like normal people, except occasionally their ivory towered elitism will shine through.  They like to hang in bars, but judge you pretty hard for liking sports.  You\u0026amp;#39;ll be able to have interesting conversations about art, literature, philosophy, and economics, though you\u0026amp;#39;ll often be frustrated by their oblivious, fantasy-world, academic outlook on these subjects.  They\u0026amp;#39;ll use words like \u0026amp;quot;intersectionality\u0026amp;quot; and \u0026amp;quot;neoliberalism\u0026amp;quot; in casual conversation.  They\u0026amp;#39;ll object to innocuous things with meaningless theoretical explanations about \u0026amp;quot;prescriptive modes of social engagement\u0026amp;quot; and \u0026amp;quot;hypercapitalist tragedy recontextualized as farce.\u0026amp;quot;  They quote Slavoj Zizek and Noam Chomsky while trying to order a pizza.  They\u0026amp;#39;ll sneer at you for giving change to a homeless person and call it \u0026amp;quot;problematic.\u0026amp;quot;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;If you pick rednecks, they\u0026amp;#39;ll mostly be like normal people, except occasionally their inbred, racist ignorance will shine through.  They love classic rock, but judge you pretty hard for liking jazz.  You\u0026amp;#39;ll be able to go to awesome concerts, honky-tonks, fairs, rodeos, and drag races, though you\u0026amp;#39;ll often be frustrated by the provincial, hick conversation you\u0026amp;#39;re constantly subjected to.  They\u0026amp;#39;ll call you a \u0026amp;quot;homo\u0026amp;quot; for ordering pineapple on pizza.  They\u0026amp;#39;ll call you a homo for not owning a gun.  They\u0026amp;#39;ll call you a homo for the size of your tires, the color of your shirt, the beer you buy, and basically anything that is even remotely unfamiliar to them.  They collect welfare while simultaneously spouting nonsense about lazy black people on welfare.  They think Obama is a Muslim.  They think the Democrats raised their taxes, despite never having paid taxes.  They\u0026amp;#39;ll sneer at you for giving change to a homeless person and call you a homo.  Then slap you on the back and say \u0026amp;quot;come on, chug this beer with me.\u0026amp;quot;\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.WouldYouRather","gilded":0,"commentCount":52,"score":78,"upVotes":78,"downVotes":0,"created":1.395189884E9,"createdUTC":1.395161084E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"20q9rf","fullName":"t3_20q9rf"}],"sankeyNodes":[],"sentiments":[]}