{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"Christian-Conservative culture is so draining...","label":"anobscurity","duration":"","id":0,"color":"red","redditID":"t3_31c8db","isTrueCluster":"true","timestamp":1.428115883E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/exchristian/comments/31c8db/christianconservative_culture_is_so_draining/","permalink":"/r/exchristian/comments/31c8db/christianconservative_culture_is_so_draining/?ref\u003dsearch_posts","author":"anObscurity","title":"Christian-Conservative culture is so draining...","subreddit":"exchristian","subredditId":"t5_2r95q","thumbnail":"self","selftext":"Obama is trying to kill us. Muslims are trying to kill us. Atheists are trying to kill us. Progressive Christians have sided with Obama and are planning to kill us, and our way of life. Democrats are out to destroy Christianity. We need to pray, we need to fast, if we dont we will die because Obama and Atheists. We need revival, so that more of the country will vote the way we do. We need to protect freedom! but we need to deny homosexuals freedom. Every little thing Obama does is secretly to give the county over to the devil. Every article from western journalism is true. Every story from fox news is true. True christians would vote conservative. True christians would not associate with the world. Freaking Hillsong United, a chrisitan worship band, goes on the Today Show? Screw it, they are secular now, they are being influenced by satan now. Pastor so-and-so doesn\u0027t believe like I do? : Heretic. Paster so-and-so is friends with Justin Bieber? : Heretic. How dare he try to reach the sinful liberal celebrities. Tim Cook speaks out against the Indiana Religious Freedom law? screw it, our church is selling all of our Apple products, they are aiding in the devils work.\n\n\n...I am so glad I am done jumping through all of these hoops. \n\n/rant","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;Obama is trying to kill us. Muslims are trying to kill us. Atheists are trying to kill us. Progressive Christians have sided with Obama and are planning to kill us, and our way of life. Democrats are out to destroy Christianity. We need to pray, we need to fast, if we dont we will die because Obama and Atheists. We need revival, so that more of the country will vote the way we do. We need to protect freedom! but we need to deny homosexuals freedom. Every little thing Obama does is secretly to give the county over to the devil. Every article from western journalism is true. Every story from fox news is true. True christians would vote conservative. True christians would not associate with the world. Freaking Hillsong United, a chrisitan worship band, goes on the Today Show? Screw it, they are secular now, they are being influenced by satan now. Pastor so-and-so doesn\u0026amp;#39;t believe like I do? : Heretic. Paster so-and-so is friends with Justin Bieber? : Heretic. How dare he try to reach the sinful liberal celebrities. Tim Cook speaks out against the Indiana Religious Freedom law? screw it, our church is selling all of our Apple products, they are aiding in the devils work.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;...I am so glad I am done jumping through all of these hoops. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;/rant\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.exchristian","gilded":0,"commentCount":52,"score":116,"upVotes":116,"downVotes":0,"created":1.428115883E9,"createdUTC":1.428087083E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"31c8db","fullName":"t3_31c8db"}],"sankeyNodes":[],"sentiments":[]}