{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"He\u0027s almost gone, can we finally talk about the implications of Obama\u0027s tremendously obvious fake birth certificate?","label":"ghostpantsmcgee","duration":"","id":0,"color":"red","redditID":"t3_37kkzc","isTrueCluster":"true","timestamp":1.432831569E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/C_S_T/comments/37kkzc/hes_almost_gone_can_we_finally_talk_about_the/","permalink":"/r/C_S_T/comments/37kkzc/hes_almost_gone_can_we_finally_talk_about_the/?ref\u003dsearch_posts","author":"GhostPantsMcGee","title":"He\u0027s almost gone, can we finally talk about the implications of Obama\u0027s tremendously obvious fake birth certificate?","subreddit":"C_S_T","subredditId":"t5_37lis","thumbnail":"","selftext":"Primary source:\n\nhttps://www.whitehouse.gov/sites/default/files/rss_viewer/birth-certificate-long-form.pdf\n\nYou have to be literally insane to think this is an undoctored image.  **I\u0027m not accusing Obama of being a Muslim or a Kenyan or even of not being born in Hawaii**; all I\u0027m saying is that an obviously fake birth certificate was presented to the public at large and very, very few people didn\u0027t agree that 2+2\u003d5.\n\nThe most striking is the obvious and unnecessary extension of the background pattern.  I have no idea why this was done, and would actually be more comfortable with the veracity of the certificate if I was told the green background was added-post production in it\u0027s entirety.\n\nWhy?  All of the ink has white \"shadows\" around it that \"cover\" the \"background\".  Every last bit of it, zoom in anywhere you\u0027d like and you\u0027ll see black ink, outlined by white, which is supposedly on an undoctored birth certificate with a green pattern in the \"background\".\n\nThere are tons of inconsistencies in almost every cell of the document, like desperate pleas from its unwilling producer. I\u0027d specifically point out cells 18a, 21 and 22.\n\nWhile there\u0027s no shortage of oddities in cell 18a, I\u0027d ask you to pay particularly close attention to the \"D\" in \"Dunham\" and note how different it appears from the rest of the letters both in compression and composition.\n\nIn 21 we seesomewhat in eligible scrawl with the first and third rune seeming identical in composition and compression, with the second drastically different.\n\n22 has the strangest bit of all, with \"date a\" and \"aug\" below it both necessarily printed at different times (being the rubric and the input) showing the same fade. Again, there are several other problems here, such as the fade of the year alternating.\n\nAgain, almost every last cell contains oddities such as this, these are just a few striking examples.  Every inch of this document screams desperately of the fakery committed by it\u0027s creator.  Screams unheard by the masses and of no concern to those in power.\n\nWhat does it mean that the powers that be released and maintain such an incredibly obvious forgery?\n\nWhat does it mean that almost everyone accepts it as undoctored proof of our exiting presidents legitimacy?\n\nCan it be that 2+2 really does equal 5 in today\u0027s world, so long as the right person affirms that \"fact\"?\n\nEdit:  In the end the answer  to my question was a resounding \"No; let\u0027s bicker and fight about the birth certificate\u0027s veracity instead.\"\n\nI\u0027ll be sure to try a premise next time.","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;Primary source:\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"https://www.whitehouse.gov/sites/default/files/rss_viewer/birth-certificate-long-form.pdf\"\u0026gt;https://www.whitehouse.gov/sites/default/files/rss_viewer/birth-certificate-long-form.pdf\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;You have to be literally insane to think this is an undoctored image.  \u0026lt;strong\u0026gt;I\u0026amp;#39;m not accusing Obama of being a Muslim or a Kenyan or even of not being born in Hawaii\u0026lt;/strong\u0026gt;; all I\u0026amp;#39;m saying is that an obviously fake birth certificate was presented to the public at large and very, very few people didn\u0026amp;#39;t agree that 2+2\u003d5.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The most striking is the obvious and unnecessary extension of the background pattern.  I have no idea why this was done, and would actually be more comfortable with the veracity of the certificate if I was told the green background was added-post production in it\u0026amp;#39;s entirety.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Why?  All of the ink has white \u0026amp;quot;shadows\u0026amp;quot; around it that \u0026amp;quot;cover\u0026amp;quot; the \u0026amp;quot;background\u0026amp;quot;.  Every last bit of it, zoom in anywhere you\u0026amp;#39;d like and you\u0026amp;#39;ll see black ink, outlined by white, which is supposedly on an undoctored birth certificate with a green pattern in the \u0026amp;quot;background\u0026amp;quot;.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;There are tons of inconsistencies in almost every cell of the document, like desperate pleas from its unwilling producer. I\u0026amp;#39;d specifically point out cells 18a, 21 and 22.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;While there\u0026amp;#39;s no shortage of oddities in cell 18a, I\u0026amp;#39;d ask you to pay particularly close attention to the \u0026amp;quot;D\u0026amp;quot; in \u0026amp;quot;Dunham\u0026amp;quot; and note how different it appears from the rest of the letters both in compression and composition.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;In 21 we seesomewhat in eligible scrawl with the first and third rune seeming identical in composition and compression, with the second drastically different.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;22 has the strangest bit of all, with \u0026amp;quot;date a\u0026amp;quot; and \u0026amp;quot;aug\u0026amp;quot; below it both necessarily printed at different times (being the rubric and the input) showing the same fade. Again, there are several other problems here, such as the fade of the year alternating.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Again, almost every last cell contains oddities such as this, these are just a few striking examples.  Every inch of this document screams desperately of the fakery committed by it\u0026amp;#39;s creator.  Screams unheard by the masses and of no concern to those in power.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;What does it mean that the powers that be released and maintain such an incredibly obvious forgery?\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;What does it mean that almost everyone accepts it as undoctored proof of our exiting presidents legitimacy?\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Can it be that 2+2 really does equal 5 in today\u0026amp;#39;s world, so long as the right person affirms that \u0026amp;quot;fact\u0026amp;quot;?\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Edit:  In the end the answer  to my question was a resounding \u0026amp;quot;No; let\u0026amp;#39;s bicker and fight about the birth certificate\u0026amp;#39;s veracity instead.\u0026amp;quot;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;I\u0026amp;#39;ll be sure to try a premise next time.\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.C_S_T","gilded":0,"commentCount":115,"score":2,"upVotes":2,"downVotes":0,"created":1.432831569E9,"createdUTC":1.432802769E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"37kkzc","fullName":"t3_37kkzc"}],"sankeyNodes":[],"sentiments":[]}