{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"Aghast over my aunt\u0027s ignorant-ass Facebook post.","label":"atomikradio","duration":"","id":0,"color":"red","redditID":"t3_38b723","isTrueCluster":"true","timestamp":1.433326417E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/offmychest/comments/38b723/aghast_over_my_aunts_ignorantass_facebook_post/","permalink":"/r/offmychest/comments/38b723/aghast_over_my_aunts_ignorantass_facebook_post/?ref\u003dsearch_posts","author":"AtomikRadio","title":"Aghast over my aunt\u0027s ignorant-ass Facebook post.","subreddit":"offmychest","subredditId":"t5_2ranw","thumbnail":"","selftext":"I usually don\u0027t pay much attention to FB, and I pay even less attention to my mothers\u0027 siblings\u0027 posts. My family is the \"black sheep\" liberal democrat household in the family and everyone else it\u0027s all about how Barack HUSSEIN Obama is a Muslim and such.\n\nUsually I ignore the shit but jesus fucking christ\n\nhttp://i.imgur.com/Yrxji9w.png \n\n(Note that the post and comment are both her. She felt she hadn\u0027t said enough in the original post and, without any prompting, added the second comment a few minutes later.)\n\nWhy does anyone think \"Not only is this a subject on which I am informed and have a valid opinion on but that valid opinion is one that I should definitely share, unsolicited, on Facebook.\"\n\nWhy the fuck are people so damn negative? It\u0027s one thing to be uninformed. I just roll my eyes when she thinks vaccines cause Staph or that you can eat as much \"healthy\" food as you want because you can\u0027t gain weight from fruit. But to be ignorant *and* so damn negative about the life and choices of someone you don\u0027t even know?\n\nWTF woman\n\nEdited to add: She\u0027s decided to talk about how Renee Richards is a *true* trans person now. And my super informed and expert-on-trans-issues aunt [started the entire post out by misgendering Richards too.](http://i.imgur.com/TNNBktY.png) Unbelievable.","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;I usually don\u0026amp;#39;t pay much attention to FB, and I pay even less attention to my mothers\u0026amp;#39; siblings\u0026amp;#39; posts. My family is the \u0026amp;quot;black sheep\u0026amp;quot; liberal democrat household in the family and everyone else it\u0026amp;#39;s all about how Barack HUSSEIN Obama is a Muslim and such.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Usually I ignore the shit but jesus fucking christ\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"http://i.imgur.com/Yrxji9w.png\"\u0026gt;http://i.imgur.com/Yrxji9w.png\u0026lt;/a\u0026gt; \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;(Note that the post and comment are both her. She felt she hadn\u0026amp;#39;t said enough in the original post and, without any prompting, added the second comment a few minutes later.)\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Why does anyone think \u0026amp;quot;Not only is this a subject on which I am informed and have a valid opinion on but that valid opinion is one that I should definitely share, unsolicited, on Facebook.\u0026amp;quot;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Why the fuck are people so damn negative? It\u0026amp;#39;s one thing to be uninformed. I just roll my eyes when she thinks vaccines cause Staph or that you can eat as much \u0026amp;quot;healthy\u0026amp;quot; food as you want because you can\u0026amp;#39;t gain weight from fruit. But to be ignorant \u0026lt;em\u0026gt;and\u0026lt;/em\u0026gt; so damn negative about the life and choices of someone you don\u0026amp;#39;t even know?\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;WTF woman\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Edited to add: She\u0026amp;#39;s decided to talk about how Renee Richards is a \u0026lt;em\u0026gt;true\u0026lt;/em\u0026gt; trans person now. And my super informed and expert-on-trans-issues aunt \u0026lt;a href\u003d\"http://i.imgur.com/TNNBktY.png\"\u0026gt;started the entire post out by misgendering Richards too.\u0026lt;/a\u0026gt; Unbelievable.\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.offmychest","gilded":0,"commentCount":15,"score":74,"upVotes":74,"downVotes":0,"created":1.433326417E9,"createdUTC":1.433297617E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"38b723","fullName":"t3_38b723"}],"sankeyNodes":[],"sentiments":[]}