{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"I believe American politics have gone downhill due to the marriage of the GOP to the religious right This began a few decades ago, but in recent years the RR has become the master of the GOP. Religious Right attitudes have bled into the system, causing division and inflexibility.","label":"cypressgreen","duration":"","id":0,"color":"red","redditID":"t3_3r1lvw","isTrueCluster":"true","timestamp":1.446377294E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/politics/comments/3r1lvw/i_believe_american_politics_have_gone_downhill/","permalink":"/r/politics/comments/3r1lvw/i_believe_american_politics_have_gone_downhill/?ref\u003dsearch_posts","author":"cypressgreen","title":"I believe American politics have gone downhill due to the marriage of the GOP to the religious right This began a few decades ago, but in recent years the RR has become the master of the GOP. Religious Right attitudes have bled into the system, causing division and inflexibility.","subreddit":"politics","subredditId":"t5_2cneq","thumbnail":"self","selftext":"Politics in the US have gone down the crapper. It wasn\u0027t ever a perfect system, but in the past couple of decades it\u0027s been increasingly difficult for cons and libs to work together. Younger people don’t even remember a time when they did. It\u0027s so bad that a con can ruin his chance to be a national figure *simply by complimenting someone on the other side.* (see Chris Christie) In fact, the opposite usually gets them brownie points with the base.\n\n\nI believe this is the end result of the GOP courting the far right religious vote for so long. Evangelicals have a very black and white view of the world. Read the Fox FB page, for example, and see how every time the Pope (or catholics, or mormons…) is brought up, the comments section is flooded with evangelicals screaming about how those people aren\u0027t Real Christians™. They aren\u0027t of god, they are of Satan. You can only be with us or against us. This also goes for anyone outside Christianity, but the only people evangelicals hate more than muslims and atheists is each other’ sects! I’ll call this “wrong” side “the camp of evil,” or COE for short.\n\n\nGOP politicians promised before each election to push the evangelical issues (like gay marriage) just to get their votes. People will come out to vote over hot button issues and politicians on both side know it.\n\n\nBut then the GOP didn\u0027t deliver because all presidential politicians pander to the extremes for votes and then drift towards the middle after the primaries. So more evangelical types started to run for office because they couldn\u0027t trust the GOP and they applied their “us vs them” mentality to everything. Obama was elected and many evangelicals were worked into a frenzy over the fact he\u0027s black, that he has an unusual name, that he doesn’t hate gay marriage, etc. Anyone who doesn’t toe the line is automatically in the COE. Not a True American. Not a Real Christian. If you don’t agree you should leave the country.\n\n\nNotice that after the first debate the many Trump supporters were outraged by the way Fox treated him. The backlash towards Meghan Kelly \u0026amp; Fox News was amazing. Hundreds of people commenting on even totally non-political Fox FB posts calling for Kelly to be fired, labeling the moderators \"liberals,\" and vowing to never watch Fox again.\n\n\nVisit any conservative conversation and the term RINO shows up often. On the liberal pages, however, you almost never see the term DINO. That’s because the cons have lost all ability to compromise even within their own ranks. Liberals tend to agree to disagree. Boehner tried to work with the factions and get things done. His reward? Labeled a traitor. And a RINO. And the ones yelling this the most are…you guessed it! The evangelical branch of the GOP. They brought their “hate anyone who isn’t my kind of christian – I am always right and you are always wrong” mentality and applied it to politics. This was an easy jump for them because for decades the GOP used hot button issues that appealed particularly to right wing christians in order to secure their votes. Hating abortion and gays isn’t just a church issue – it’s now it is political. The GOP and the church leaders saw to that.\n\n\nThe divisions in the GOP have grown so great that they’re eating each other alive, and it’s a situation they created themselves.\n\n\nOn the very night of Obama’s first inauguration, a group of prominent GOPers got together and vowed to block *anything the new president did.* Conservative talk radio had their back, with the likes of Riush Limbaugh saying flat out that they “hoped the president would fail.” Think about that. Whole swaths of cons think it’s better to hope our country fails rather than admit they are wrong about some things. They’re happy to make their point by freezing our legislative process, shutting down the government, and ruining our credit rating!\n\n\nThey’re prepared to do it again, all over Planned Parenthood funding, even though the money PP gets from the government goes solely to health care services. Remember above when I said, “They aren\u0027t of god, they are of Satan. You can only be with us or against us?” They will lie, bend the truth, and refuse to listen to facts just to further their anti-abortion agenda. PP is a part of the COE, so it’s okay to deprive women of health care to shut them down over a single service they provide which isn’t even paid for by tax dollars - even if most clinics don\u0027t even have abortion services on site.\n\nThe only reason Planned Parenthood and abortion are such a huge issue right now is because of gay marriage. The GOP has been using the specter of gay marriage as a fundraising and vote getting tool for decades. This is the first major election cycle since the SCOTUS decision. We all should have seen it coming - the rabid attacks on abortion rights. The anti abortion group which produced the undercover videos has been working on them for a few years, but it can\u0027t be a coincidence that they were released now.  I feel really stupid that I didn\u0027t see this coming!\n\n\nThe GOP and evangelicals have the average conservative so turned around that they’ll happily vote against their own interests whilst simultaneously demonizing large swaths of the populace. Help the poor? Oh, no, they are freeloaders. Instead of fixing the system lets just cut them off, require drugs tests, and print their names in the paper. Young women accidentally got pregnant? Tough shit. Let’s say if she wasn’t a whore she wouldn’t be in this fix. Let’s not help her out with prenatal care or after the baby is born. But she can’t have an abortion, either. Pregnancy is her punishment for not having evangelical ideals. Pay people a living wage? Hell no! why should they get that? If they only bootstrapped their way into better (nonexistent) jobs they’d be all set. Immigrants? Refugees of war? NO. They’re all freeloaders and stealth terrorists. Doesn’t matter that these conservatives consider themselves to be the best kind of christian. Jesus was a supporter of capitalism! He would agree that those people are not worth helping! Of course, Christians who don’t agree are not Real Christians.\n\n\nThese newer far right GOP people think the way politics works is to demand everyone fall in line and give them what they want. A good government cannot function without actual debate and compromise. Broken welfare programs and a broken immigration system can only be solved with real conversation and real compromise.\n\n\nFacts mean nothing to them. Planned Parenthood doesn’t spend any tax money on abortions? Well if they get any tax dollars that *does* support abortions. What do you mean it’s physically and financially impossible to toss out all illegal immigrants and build a wall? I need to hang onto the dream! Numerous investigations, even GOP led, found no fault with Hilary Clinton in the Benghazi incident? We need to keep having investigations until we get the result we want! Obama is a muslim born in Kenya. I don’t care if we saw his birth certificate, Hawaiian newspaper birth notice, and know he’s been a Christian his whole life. I’M RIGHT. 97% of scientists agree that climate change is real and huge industries with skin in the game have spent billions saying it’s a lie? Pfft. I might lose my coal mine job and have to trade in my Hummer if that’s true, so it isn’t true. The 3% of scientists are obviously right. Fox News tells me cops are being murdered by thugs at an unprecedented rate. Oh, statistics say cop shootings are down? I don\u0027t believe it. LALALALALA I CAN\u0027T HEAR YOU.\n\n\nGOP politicians lie at will and the cons eat it up. When caught in a lie, they don’t respond, blame the source that corrects them, and/or even say “my comment wasn’t meant to be factually correct” – and the cons love them for it. Oh, pardon me. It\u0027s not just the politicians who do it. Try supplying facts online and watch the personal attacks and denial run rampant. Any source they don\u0027t like is \"lamestream liberal media.\"\n\n\nNow that Boehner is gone it should get pretty interesting. The far right branch will still not compromise with the moderate branch, and certainly not with the dems. I think it doesn\u0027t matter who became the new Speaker. Nothing will get done, and, once again, the GOP will lose the presidential election. And although the anti abortion crowd has made great strides in recent years in their attempts to restrict access to the point where an abortion is essentially impossible to get, I think they tide will turn.\n\nMillenials are much less religious and much less socially conservative than the older generations. I am 48 years old and, young Redditors, you are my hope for the future! I only wish I was a good 20 years younger so I\u0027d live long enough to see how this all works out and help you make America a more accepting, prosperous country.\n\nOpinions wanted.","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;Politics in the US have gone down the crapper. It wasn\u0026amp;#39;t ever a perfect system, but in the past couple of decades it\u0026amp;#39;s been increasingly difficult for cons and libs to work together. Younger people don’t even remember a time when they did. It\u0026amp;#39;s so bad that a con can ruin his chance to be a national figure \u0026lt;em\u0026gt;simply by complimenting someone on the other side.\u0026lt;/em\u0026gt; (see Chris Christie) In fact, the opposite usually gets them brownie points with the base.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;I believe this is the end result of the GOP courting the far right religious vote for so long. Evangelicals have a very black and white view of the world. Read the Fox FB page, for example, and see how every time the Pope (or catholics, or mormons…) is brought up, the comments section is flooded with evangelicals screaming about how those people aren\u0026amp;#39;t Real Christians™. They aren\u0026amp;#39;t of god, they are of Satan. You can only be with us or against us. This also goes for anyone outside Christianity, but the only people evangelicals hate more than muslims and atheists is each other’ sects! I’ll call this “wrong” side “the camp of evil,” or COE for short.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;GOP politicians promised before each election to push the evangelical issues (like gay marriage) just to get their votes. People will come out to vote over hot button issues and politicians on both side know it.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;But then the GOP didn\u0026amp;#39;t deliver because all presidential politicians pander to the extremes for votes and then drift towards the middle after the primaries. So more evangelical types started to run for office because they couldn\u0026amp;#39;t trust the GOP and they applied their “us vs them” mentality to everything. Obama was elected and many evangelicals were worked into a frenzy over the fact he\u0026amp;#39;s black, that he has an unusual name, that he doesn’t hate gay marriage, etc. Anyone who doesn’t toe the line is automatically in the COE. Not a True American. Not a Real Christian. If you don’t agree you should leave the country.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Notice that after the first debate the many Trump supporters were outraged by the way Fox treated him. The backlash towards Meghan Kelly \u0026amp;amp; Fox News was amazing. Hundreds of people commenting on even totally non-political Fox FB posts calling for Kelly to be fired, labeling the moderators \u0026amp;quot;liberals,\u0026amp;quot; and vowing to never watch Fox again.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Visit any conservative conversation and the term RINO shows up often. On the liberal pages, however, you almost never see the term DINO. That’s because the cons have lost all ability to compromise even within their own ranks. Liberals tend to agree to disagree. Boehner tried to work with the factions and get things done. His reward? Labeled a traitor. And a RINO. And the ones yelling this the most are…you guessed it! The evangelical branch of the GOP. They brought their “hate anyone who isn’t my kind of christian – I am always right and you are always wrong” mentality and applied it to politics. This was an easy jump for them because for decades the GOP used hot button issues that appealed particularly to right wing christians in order to secure their votes. Hating abortion and gays isn’t just a church issue – it’s now it is political. The GOP and the church leaders saw to that.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The divisions in the GOP have grown so great that they’re eating each other alive, and it’s a situation they created themselves.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;On the very night of Obama’s first inauguration, a group of prominent GOPers got together and vowed to block \u0026lt;em\u0026gt;anything the new president did.\u0026lt;/em\u0026gt; Conservative talk radio had their back, with the likes of Riush Limbaugh saying flat out that they “hoped the president would fail.” Think about that. Whole swaths of cons think it’s better to hope our country fails rather than admit they are wrong about some things. They’re happy to make their point by freezing our legislative process, shutting down the government, and ruining our credit rating!\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;They’re prepared to do it again, all over Planned Parenthood funding, even though the money PP gets from the government goes solely to health care services. Remember above when I said, “They aren\u0026amp;#39;t of god, they are of Satan. You can only be with us or against us?” They will lie, bend the truth, and refuse to listen to facts just to further their anti-abortion agenda. PP is a part of the COE, so it’s okay to deprive women of health care to shut them down over a single service they provide which isn’t even paid for by tax dollars - even if most clinics don\u0026amp;#39;t even have abortion services on site.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The only reason Planned Parenthood and abortion are such a huge issue right now is because of gay marriage. The GOP has been using the specter of gay marriage as a fundraising and vote getting tool for decades. This is the first major election cycle since the SCOTUS decision. We all should have seen it coming - the rabid attacks on abortion rights. The anti abortion group which produced the undercover videos has been working on them for a few years, but it can\u0026amp;#39;t be a coincidence that they were released now.  I feel really stupid that I didn\u0026amp;#39;t see this coming!\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The GOP and evangelicals have the average conservative so turned around that they’ll happily vote against their own interests whilst simultaneously demonizing large swaths of the populace. Help the poor? Oh, no, they are freeloaders. Instead of fixing the system lets just cut them off, require drugs tests, and print their names in the paper. Young women accidentally got pregnant? Tough shit. Let’s say if she wasn’t a whore she wouldn’t be in this fix. Let’s not help her out with prenatal care or after the baby is born. But she can’t have an abortion, either. Pregnancy is her punishment for not having evangelical ideals. Pay people a living wage? Hell no! why should they get that? If they only bootstrapped their way into better (nonexistent) jobs they’d be all set. Immigrants? Refugees of war? NO. They’re all freeloaders and stealth terrorists. Doesn’t matter that these conservatives consider themselves to be the best kind of christian. Jesus was a supporter of capitalism! He would agree that those people are not worth helping! Of course, Christians who don’t agree are not Real Christians.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;These newer far right GOP people think the way politics works is to demand everyone fall in line and give them what they want. A good government cannot function without actual debate and compromise. Broken welfare programs and a broken immigration system can only be solved with real conversation and real compromise.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Facts mean nothing to them. Planned Parenthood doesn’t spend any tax money on abortions? Well if they get any tax dollars that \u0026lt;em\u0026gt;does\u0026lt;/em\u0026gt; support abortions. What do you mean it’s physically and financially impossible to toss out all illegal immigrants and build a wall? I need to hang onto the dream! Numerous investigations, even GOP led, found no fault with Hilary Clinton in the Benghazi incident? We need to keep having investigations until we get the result we want! Obama is a muslim born in Kenya. I don’t care if we saw his birth certificate, Hawaiian newspaper birth notice, and know he’s been a Christian his whole life. I’M RIGHT. 97% of scientists agree that climate change is real and huge industries with skin in the game have spent billions saying it’s a lie? Pfft. I might lose my coal mine job and have to trade in my Hummer if that’s true, so it isn’t true. The 3% of scientists are obviously right. Fox News tells me cops are being murdered by thugs at an unprecedented rate. Oh, statistics say cop shootings are down? I don\u0026amp;#39;t believe it. LALALALALA I CAN\u0026amp;#39;T HEAR YOU.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;GOP politicians lie at will and the cons eat it up. When caught in a lie, they don’t respond, blame the source that corrects them, and/or even say “my comment wasn’t meant to be factually correct” – and the cons love them for it. Oh, pardon me. It\u0026amp;#39;s not just the politicians who do it. Try supplying facts online and watch the personal attacks and denial run rampant. Any source they don\u0026amp;#39;t like is \u0026amp;quot;lamestream liberal media.\u0026amp;quot;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Now that Boehner is gone it should get pretty interesting. The far right branch will still not compromise with the moderate branch, and certainly not with the dems. I think it doesn\u0026amp;#39;t matter who became the new Speaker. Nothing will get done, and, once again, the GOP will lose the presidential election. And although the anti abortion crowd has made great strides in recent years in their attempts to restrict access to the point where an abortion is essentially impossible to get, I think they tide will turn.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Millenials are much less religious and much less socially conservative than the older generations. I am 48 years old and, young Redditors, you are my hope for the future! I only wish I was a good 20 years younger so I\u0026amp;#39;d live long enough to see how this all works out and help you make America a more accepting, prosperous country.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Opinions wanted.\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.politics","gilded":0,"commentCount":200,"score":986,"upVotes":986,"downVotes":0,"created":1.446377294E9,"createdUTC":1.446348494E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"3r1lvw","fullName":"t3_3r1lvw"}],"sankeyNodes":[],"sentiments":[]}