{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"Upvote this to all so that those uninformed can learn that Trump has 100% authority as president to ban all muslim immigration: \"Whenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States\"","label":"compute_","duration":"","id":0,"color":"red","redditID":"t3_4b07ov","isTrueCluster":"true","timestamp":1.45836363E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/The_Donald/comments/4b07ov/upvote_this_to_all_so_that_those_uninformed_can/","permalink":"/r/The_Donald/comments/4b07ov/upvote_this_to_all_so_that_those_uninformed_can/?ref\u003dsearch_posts","author":"compute_","title":"Upvote this to all so that those uninformed can learn that Trump has 100% authority as president to ban all muslim immigration: \"Whenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States\"","subreddit":"The_Donald","subredditId":"t5_38unr","thumbnail":"self","selftext":"~~The Consitution~~ federal statute - US CODE 1182: \n\n\u0026gt; (f) Suspension of entry or imposition of restrictions by President Whenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate. Whenever the Attorney General finds that a commercial airline has failed to comply with regulations of the Attorney General relating to requirements of airlines for the detection of fraudulent documents used by passengers traveling to the United States (including the training of personnel in such detection), the Attorney General may suspend the entry of some or all aliens transported to the United States by such airline.\n\nCritics who call Trump\u0027s policy position \"unconstitutional\" are not only wrong but the exact inverse is true. The power to suspend the admission of \"any aliens or any class of aliens into the United States” is expressly reserved by statute to the president whenever the president finds that such admission “would be detrimental to the interests of the United States.\"\n\nFurthermore, the Supreme Court or any judiciary branch wouldn\u0027t have to agree with Trump, and Congress wouldn\u0027t have a say. This is per the leading case of Fiallo v. Bell in which the Supreme Court ruled that Carter\u0027s temporary ban on Iranian immigration was legal since the president exercised his \"broad power over immigration and naturalization\", also the 1952 Supreme Court case stated that \"any policy toward aliens is interwoven with foreign relations, the war power, and the maintenance of a republican form of government. Such matters are so exclusively entrusted to the political branches of government as to be largely immune from judicial inquiry or interference\". No, instead of fighting muslim terrorism we should probably dismiss ISIS as a \"junior varsity league\" as Obama did a few weeks before the Paris terror attacks.\n\nThe executive branch ALONE has a \"broad power over immigration and naturalization\" that Trump would use to institute his policies, which is not only not unconstitutional but is explicitly stated in it as a RIGHT.\n\n**Edit:** Fixed a couple typos and I should note that \"powers\" is probably a more accurate term than \"rights\" in this instance. How about this: It\u0027s his job.","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;\u0026lt;del\u0026gt;The Consitution\u0026lt;/del\u0026gt; federal statute - US CODE 1182: \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;(f) Suspension of entry or imposition of restrictions by President Whenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate. Whenever the Attorney General finds that a commercial airline has failed to comply with regulations of the Attorney General relating to requirements of airlines for the detection of fraudulent documents used by passengers traveling to the United States (including the training of personnel in such detection), the Attorney General may suspend the entry of some or all aliens transported to the United States by such airline.\u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Critics who call Trump\u0026amp;#39;s policy position \u0026amp;quot;unconstitutional\u0026amp;quot; are not only wrong but the exact inverse is true. The power to suspend the admission of \u0026amp;quot;any aliens or any class of aliens into the United States” is expressly reserved by statute to the president whenever the president finds that such admission “would be detrimental to the interests of the United States.\u0026amp;quot;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Furthermore, the Supreme Court or any judiciary branch wouldn\u0026amp;#39;t have to agree with Trump, and Congress wouldn\u0026amp;#39;t have a say. This is per the leading case of Fiallo v. Bell in which the Supreme Court ruled that Carter\u0026amp;#39;s temporary ban on Iranian immigration was legal since the president exercised his \u0026amp;quot;broad power over immigration and naturalization\u0026amp;quot;, also the 1952 Supreme Court case stated that \u0026amp;quot;any policy toward aliens is interwoven with foreign relations, the war power, and the maintenance of a republican form of government. Such matters are so exclusively entrusted to the political branches of government as to be largely immune from judicial inquiry or interference\u0026amp;quot;. No, instead of fighting muslim terrorism we should probably dismiss ISIS as a \u0026amp;quot;junior varsity league\u0026amp;quot; as Obama did a few weeks before the Paris terror attacks.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The executive branch ALONE has a \u0026amp;quot;broad power over immigration and naturalization\u0026amp;quot; that Trump would use to institute his policies, which is not only not unconstitutional but is explicitly stated in it as a RIGHT.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;Edit:\u0026lt;/strong\u0026gt; Fixed a couple typos and I should note that \u0026amp;quot;powers\u0026amp;quot; is probably a more accurate term than \u0026amp;quot;rights\u0026amp;quot; in this instance. How about this: It\u0026amp;#39;s his job.\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.The_Donald","gilded":0,"commentCount":55,"score":1033,"upVotes":1033,"downVotes":0,"created":1.45836363E9,"createdUTC":1.45833483E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"4b07ov","fullName":"t3_4b07ov"}],"sankeyNodes":[],"sentiments":[]}