{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"True American Patriot™ encounters an SRS Cuck in \"his\" natural habitat.","label":"oneyearsteakday","duration":"","id":0,"color":"red","redditID":"t3_48zmtr","isTrueCluster":"true","timestamp":1.457158741E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/circlebroke/comments/48zmtr/true_american_patriot_encounters_an_srs_cuck_in/","permalink":"/r/circlebroke/comments/48zmtr/true_american_patriot_encounters_an_srs_cuck_in/?ref\u003dsearch_posts","author":"OneYearSteakDay","title":"True American Patriot™ encounters an SRS Cuck in \"his\" natural habitat.","subreddit":"circlebroke","subredditId":"t5_2tnz9","thumbnail":"","selftext":"[The thread in question.](https://np.reddit.com/r/The_Donald/comments/48y8xx/time_for_me_to_come_out_of_hiding_lets_discuss/)  \n  \n\u0026gt;Today I gave a presentation about Donald Drumpf for a class. In my presentation, I mentioned that I ran this place and it immediately piqued the interest of a man who will henceforth be known as Captain Cuckold: Master of SRS.  \n  \nWell, we\u0027re off to a good start!  Captain Cuckold: Master of SRS, truly a fitting name, because:  \n  \n\u0026gt;It\u0027s quite fitting since he actually told me afterwards, he is an active SRS Cuck and came by to tell me how mean our mod team is.  \n  \nI\u0027m sure those were his exact words, too.  \"Hi, I\u0027m an active SRS Cuck, you can call me Captain Cuckold: Master of SRS!  Your mods are being mean.\"  \n  \n\u0026gt;I won\u0027t provide his picture, but Captain Cuckold is EXACTLY how you\u0027d picture an SRS male. He\u0027s incredibly overweight, has an overgrown and unkept neckbeard  \n  \nThis may be surprising, but that\u0027s the same mental image that comes to mind when I think of a Donald Drumpf supporter, except that he\u0027d be wearing a Bud Lite tee-shirt with an open carry AR-15 strapped to his back.  But it was very nice of OP not to post a picture, very considerate.  \n  \n\u0026gt;Now despite being the dreaded \"well educated rich white male\", this \"man\" is not privileged. He clearly had no fatherly guidance growing up. His body is an embarrassment and I\u0027d bet my testicles that he\u0027s never kissed a girl. Right before my eyes, I had all of my SRS suspicions confirmed---Not the least of which being that he does not listen to logic (or else he\u0027d exercise and eat right).  \n  \n\"Man.\"  Clearly he had no fatherly guidance growing up, or else he\u0027d be voting for Donald Drumpf!  \n  \n\u0026gt;What \"men\" like this listen to is fear.   \n  \nExactly, and well founded fears too!  Fears like illegal immigrants coming to steal his job, rape his mother, murder his father, then sell him drugs.  Fear of President Obama being a secret kenyan Muslim.  Fear of the Democrats coming to take their guns away.  Fear of Islamic Extremism (which is why we need to stop ALL immigration of Muslims immediately.)  Fear of the Rapture.  Fear of... oh, wait... I was describing Donald Drumpf supporters, wasn\u0027t I?  \n   \n\u0026gt;First and foremost: SJWs are not going to reciprocate. They get their social validation by the people they agree with and the moral authorities who do not ban them.  \n  \n\"Hello Pot?  This is Kettle.  You need to take a bath.\"  \n  \n\u0026gt;They\u0027re terrified to go against their friends and so they will NEVER say: \"The_Donald let\u0027s us speak, maybe we should return the favor?\"   \n  \nI mean except for the bans, harassment, downvotes, and calling the disagreeing side \"Cucks.\"  But yeah, The_Donald lets us speak.  \n  \n\u0026gt;I cannot stress this enough: It\u0027s fear of rejection and not logic that decides their views. You can never out-logic fear. Don\u0027t even try.  \n  \nI\u0027m quickly coming to realize that, too.  \n  \n\u0026gt;Because that message will NEVER be received, allowing them to shill here sends the complete opposite message. It says: \"We will let you speak, whether or not you allow us to speak.\" That may sound noble, but let me translate it for you. The true message is \"You may have all the speech you want provided that you\u0027re a leftist SJW. The rest of us will stay in our corner where you allow us to be.\" Not such a good message, right?  \n  \nReddit is a well-known bastion of Leftist ideology.  Just look at how many feminists post *directly* to the front page.  \n\nGeeze Sheeple, get it together!  \n  \n\u0026gt;Secondly: Nothing meaningful will be heard. I repeat: These cuckolds are not reaching their views logically. They\u0027re just terrified of being asked \"Doesn\u0027t building a wall mean you hate women?\"  \n  \nHold still for just a moment, it looks like there\u0027s a bit of straw sticking out of your collar.  Let me just get that for you...  \n  \n\u0026gt;You CANNOT fight fear with logic. Fear always wins.   \n  \nI wonder if that\u0027s why Donald Drumpf is leading in the Republican polls.  \"If we don\u0027t build a wall the Mexicans will come to rape and murder your family, then sell you shitty mids!  Don\u0027t worry, they\u0027ll never invent a 21ft tall ladder...\"  \n  \n\u0026gt;When the day comes that Shill Pits don\u0027t ban people who think Drumpf is a winner or that restricting muslim immigration isn\u0027t racist, are allowed to speak on SRS, we\u0027ll let BernieBots in.  \n  \nShill Pits?  That\u0027s a new one.  \n  \nStill, it\u0027s cool to think that all SRS has to do is agree that The Donald is a winner, then the Sanders supporters can join in the conversation!  That makes perfect... um... what\u0027s the word?  It\u0027s not sense...  Well whatever, I\u0027m sure it\u0027s completely logical even if it *doesn\u0027t* make sense.  They\u0027re just too nimble for me!  I\u0027m stumped.  \n  \nSo how do we do this, Cap\u0027n Cock?  \n  \n\u0026gt;First, we\u0027re gonna ban all the BernieBots. Shitlord communities mostly already do this.  \n  \nThat should be perfectly easy.  \u0027sides, nothing like banning free speech in your community to show how strongly you support free speech!  \n  \n\u0026gt;Second, we\u0027re gonna let Shills brew in the pot they\u0027ve created. They come here because deep down, they do seek alternative viewpoints, debates against opponents who are not made of straw, and the opposing side. They really do. They say they don\u0027t, but they do.  \n  \nOpposing view points like:  \n\n * Childhood vaccinations cause autism.  \n * Global warming is a hoax...  \n * ...perpetrated by the Chinese to undermine American manufacturing.  \n * African \"American\" \"President\" Obama was actually born in Kenya.  \n * Favorite bible verses.  \n * The size of Donald Drumpf\u0027s dicklet.  \n * Who are the Real Americans™ in this country.  \n * Heritage vs. Hate.  You decide.  \n * And many more!  \n  \n\u0026gt;Third, we\u0027re gonna let them get sick of it.  \n  \nI kind of feel like this step should have been first.  But what do I know, I actively cuck myself by posting to shill pits like /r/openbroke.  \n  \n\u0026gt;Fourth, we\u0027re gonna let them beg their mods and other community leaders to be a little better and less polarizing.  \n  \nTop kek.  (Am I using that correctly?  I don\u0027t actually know what a kek is.)  \n  \n\u0026gt;Fifth, we\u0027ll match them.  \n  \nOnly by first cucking one\u0027s self, can one hope to cuck others.  \n  \n\u0026gt;So here is our policy on Free Speech and what we\u0027ll allow: We will allow viewpoints that are (a) Relevant to Drumpf obviously, (b) that are shunned elsewhere, and (c) that are \"friends\" with viewpoints shunned elsewhere. However, we will NOT allow ourselves to provide the little vacation island resort to BernieBots and other shills who would NEVER provide the same service to us.  \n  \nFreeze Peaches are conditional.  If your facts disagree with my opinions, maybe you should move back to the USSR.  \n  \n\u0026gt;Speech is ultimately about power and communication. If only one side can communicate their views, that side gains a lot of power.  \n  \nHence why SRS, Cucks, and Berniebots are going to be banned.  Can\u0027t let those little rascals get too powerful!  \n  \n\u0026gt;When SRS abuses their monopoly to make it seem like the only possible viable viewpoint, that\u0027s bad for everyone---including Mr. Captain Cuck who was intimidated away from ever forming his own opinion.   \n  \nCurrently /r/ShitRedditSays has 74,000 subscribers.  Totally monopolistic compared to poor, little, disenfranchised /r/The_Donald.  How can they possibly hope to repel privledge of this magnitude!?  \n  \n\u0026gt;We will however, recognize that this is not a contest of virtue and logic, and respond appropriately by not treating it as one, rather than let ourselves be swayed and abused by taking another approach.  \n  \nNice!  So Drumpf supporters aren\u0027t even going to *try* to use virtue and logic to argue their points.  I presume they\u0027ll instead look to memes, shit posting, and name calling.  It\u0027ll be a shame to see /r/The_Donald change so much, but times are what they are.  \n  \n\u0026gt;\"But won\u0027t that make this sub an echo chamber?\" Frankly, reddit is not a closed off community and it is absolutely not free of liberal or anti-Drumpf viewpoints.   \n  \nSAFE SPACE!!  THIS GUY WANTS A SAFE SPACE OVER HERE!!  See?  Nobody cares.  \n  \n\u0026gt;This sub will be the vacation island resort for people we like and people who support us, not for Cuckolds who deep down hate being surrounded by Cucks just as badly as we do.   \n  \nIT\u0027S AN ISLAND!  BUILD A WALL AROUND THE ISLAND SO THE SEA CAN\u0027T GET IN!  \n  \n\u0026gt;And BTW, any comparisons between this and safespacing will result in a ban. Safespaces are responses to triggering, to scary views, and the patheticness of those who inhabit them.   \n  \nOh.  Woops!  My bad.  \n  \n-------------------------\n  \nWell I can\u0027t speak for you, but this post really convinced me that I should be voting for Drumpf.  \n\nWhat do you guys think?  \n\nTime to throw in the towel, admit we\u0027re cucks, and vote for the candidate with the massive dick and the best words?  \n  \n----------------\n\nAddendum: Two things of note.  First, I initially posted this to /r/OpenBroke. (Because I really have trouble sorting the meta-communities out.  Who\u0027s actually progressive?  Who\u0027s mocking progressives?  Are they sincere, or am I a victim of Poe\u0027s law?)  But it got little attention and it took like an hour to write, so I\u0027m being bold and risking a cross-post.  Secondly: If I\u0027m *still* not in the right place, and I\u0027m actually buying into Poe\u0027s law, please feel free to express the state of your jimmie rustles with the downvote button, at least then I\u0027ll know for sure that I\u0027m not supposed to be here and I can get out of your hairs.","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"https://np.reddit.com/r/The_Donald/comments/48y8xx/time_for_me_to_come_out_of_hiding_lets_discuss/\"\u0026gt;The thread in question.\u0026lt;/a\u0026gt;  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;Today I gave a presentation about Donald Drumpf for a class. In my presentation, I mentioned that I ran this place and it immediately piqued the interest of a man who will henceforth be known as Captain Cuckold: Master of SRS.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Well, we\u0026amp;#39;re off to a good start!  Captain Cuckold: Master of SRS, truly a fitting name, because:  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;It\u0026amp;#39;s quite fitting since he actually told me afterwards, he is an active SRS Cuck and came by to tell me how mean our mod team is.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;I\u0026amp;#39;m sure those were his exact words, too.  \u0026amp;quot;Hi, I\u0026amp;#39;m an active SRS Cuck, you can call me Captain Cuckold: Master of SRS!  Your mods are being mean.\u0026amp;quot;  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;I won\u0026amp;#39;t provide his picture, but Captain Cuckold is EXACTLY how you\u0026amp;#39;d picture an SRS male. He\u0026amp;#39;s incredibly overweight, has an overgrown and unkept neckbeard  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;This may be surprising, but that\u0026amp;#39;s the same mental image that comes to mind when I think of a Donald Drumpf supporter, except that he\u0026amp;#39;d be wearing a Bud Lite tee-shirt with an open carry AR-15 strapped to his back.  But it was very nice of OP not to post a picture, very considerate.  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;Now despite being the dreaded \u0026amp;quot;well educated rich white male\u0026amp;quot;, this \u0026amp;quot;man\u0026amp;quot; is not privileged. He clearly had no fatherly guidance growing up. His body is an embarrassment and I\u0026amp;#39;d bet my testicles that he\u0026amp;#39;s never kissed a girl. Right before my eyes, I had all of my SRS suspicions confirmed---Not the least of which being that he does not listen to logic (or else he\u0026amp;#39;d exercise and eat right).  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026amp;quot;Man.\u0026amp;quot;  Clearly he had no fatherly guidance growing up, or else he\u0026amp;#39;d be voting for Donald Drumpf!  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;What \u0026amp;quot;men\u0026amp;quot; like this listen to is fear.   \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Exactly, and well founded fears too!  Fears like illegal immigrants coming to steal his job, rape his mother, murder his father, then sell him drugs.  Fear of President Obama being a secret kenyan Muslim.  Fear of the Democrats coming to take their guns away.  Fear of Islamic Extremism (which is why we need to stop ALL immigration of Muslims immediately.)  Fear of the Rapture.  Fear of... oh, wait... I was describing Donald Drumpf supporters, wasn\u0026amp;#39;t I?  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;First and foremost: SJWs are not going to reciprocate. They get their social validation by the people they agree with and the moral authorities who do not ban them.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026amp;quot;Hello Pot?  This is Kettle.  You need to take a bath.\u0026amp;quot;  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;They\u0026amp;#39;re terrified to go against their friends and so they will NEVER say: \u0026amp;quot;The_Donald let\u0026amp;#39;s us speak, maybe we should return the favor?\u0026amp;quot;   \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;I mean except for the bans, harassment, downvotes, and calling the disagreeing side \u0026amp;quot;Cucks.\u0026amp;quot;  But yeah, The_Donald lets us speak.  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;I cannot stress this enough: It\u0026amp;#39;s fear of rejection and not logic that decides their views. You can never out-logic fear. Don\u0026amp;#39;t even try.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;I\u0026amp;#39;m quickly coming to realize that, too.  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;Because that message will NEVER be received, allowing them to shill here sends the complete opposite message. It says: \u0026amp;quot;We will let you speak, whether or not you allow us to speak.\u0026amp;quot; That may sound noble, but let me translate it for you. The true message is \u0026amp;quot;You may have all the speech you want provided that you\u0026amp;#39;re a leftist SJW. The rest of us will stay in our corner where you allow us to be.\u0026amp;quot; Not such a good message, right?  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Reddit is a well-known bastion of Leftist ideology.  Just look at how many feminists post \u0026lt;em\u0026gt;directly\u0026lt;/em\u0026gt; to the front page.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Geeze Sheeple, get it together!  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;Secondly: Nothing meaningful will be heard. I repeat: These cuckolds are not reaching their views logically. They\u0026amp;#39;re just terrified of being asked \u0026amp;quot;Doesn\u0026amp;#39;t building a wall mean you hate women?\u0026amp;quot;  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Hold still for just a moment, it looks like there\u0026amp;#39;s a bit of straw sticking out of your collar.  Let me just get that for you...  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;You CANNOT fight fear with logic. Fear always wins.   \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;I wonder if that\u0026amp;#39;s why Donald Drumpf is leading in the Republican polls.  \u0026amp;quot;If we don\u0026amp;#39;t build a wall the Mexicans will come to rape and murder your family, then sell you shitty mids!  Don\u0026amp;#39;t worry, they\u0026amp;#39;ll never invent a 21ft tall ladder...\u0026amp;quot;  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;When the day comes that Shill Pits don\u0026amp;#39;t ban people who think Drumpf is a winner or that restricting muslim immigration isn\u0026amp;#39;t racist, are allowed to speak on SRS, we\u0026amp;#39;ll let BernieBots in.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Shill Pits?  That\u0026amp;#39;s a new one.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Still, it\u0026amp;#39;s cool to think that all SRS has to do is agree that The Donald is a winner, then the Sanders supporters can join in the conversation!  That makes perfect... um... what\u0026amp;#39;s the word?  It\u0026amp;#39;s not sense...  Well whatever, I\u0026amp;#39;m sure it\u0026amp;#39;s completely logical even if it \u0026lt;em\u0026gt;doesn\u0026amp;#39;t\u0026lt;/em\u0026gt; make sense.  They\u0026amp;#39;re just too nimble for me!  I\u0026amp;#39;m stumped.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;So how do we do this, Cap\u0026amp;#39;n Cock?  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;First, we\u0026amp;#39;re gonna ban all the BernieBots. Shitlord communities mostly already do this.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;That should be perfectly easy.  \u0026amp;#39;sides, nothing like banning free speech in your community to show how strongly you support free speech!  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;Second, we\u0026amp;#39;re gonna let Shills brew in the pot they\u0026amp;#39;ve created. They come here because deep down, they do seek alternative viewpoints, debates against opponents who are not made of straw, and the opposing side. They really do. They say they don\u0026amp;#39;t, but they do.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Opposing view points like:  \u0026lt;/p\u0026gt;\n\n\u0026lt;ul\u0026gt;\n\u0026lt;li\u0026gt;Childhood vaccinations cause autism.\u0026lt;br/\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Global warming is a hoax...\u0026lt;br/\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;...perpetrated by the Chinese to undermine American manufacturing.\u0026lt;br/\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;African \u0026amp;quot;American\u0026amp;quot; \u0026amp;quot;President\u0026amp;quot; Obama was actually born in Kenya.\u0026lt;br/\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Favorite bible verses.\u0026lt;br/\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;The size of Donald Drumpf\u0026amp;#39;s dicklet.\u0026lt;br/\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Who are the Real Americans™ in this country.\u0026lt;br/\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Heritage vs. Hate.  You decide.\u0026lt;br/\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;And many more!\u0026lt;br/\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;/ul\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;Third, we\u0026amp;#39;re gonna let them get sick of it.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;I kind of feel like this step should have been first.  But what do I know, I actively cuck myself by posting to shill pits like \u0026lt;a href\u003d\"/r/openbroke\"\u0026gt;/r/openbroke\u0026lt;/a\u0026gt;.  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;Fourth, we\u0026amp;#39;re gonna let them beg their mods and other community leaders to be a little better and less polarizing.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Top kek.  (Am I using that correctly?  I don\u0026amp;#39;t actually know what a kek is.)  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;Fifth, we\u0026amp;#39;ll match them.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Only by first cucking one\u0026amp;#39;s self, can one hope to cuck others.  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;So here is our policy on Free Speech and what we\u0026amp;#39;ll allow: We will allow viewpoints that are (a) Relevant to Drumpf obviously, (b) that are shunned elsewhere, and (c) that are \u0026amp;quot;friends\u0026amp;quot; with viewpoints shunned elsewhere. However, we will NOT allow ourselves to provide the little vacation island resort to BernieBots and other shills who would NEVER provide the same service to us.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Freeze Peaches are conditional.  If your facts disagree with my opinions, maybe you should move back to the USSR.  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;Speech is ultimately about power and communication. If only one side can communicate their views, that side gains a lot of power.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Hence why SRS, Cucks, and Berniebots are going to be banned.  Can\u0026amp;#39;t let those little rascals get too powerful!  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;When SRS abuses their monopoly to make it seem like the only possible viable viewpoint, that\u0026amp;#39;s bad for everyone---including Mr. Captain Cuck who was intimidated away from ever forming his own opinion.   \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Currently \u0026lt;a href\u003d\"/r/ShitRedditSays\"\u0026gt;/r/ShitRedditSays\u0026lt;/a\u0026gt; has 74,000 subscribers.  Totally monopolistic compared to poor, little, disenfranchised \u0026lt;a href\u003d\"/r/The_Donald\"\u0026gt;/r/The_Donald\u0026lt;/a\u0026gt;.  How can they possibly hope to repel privledge of this magnitude!?  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;We will however, recognize that this is not a contest of virtue and logic, and respond appropriately by not treating it as one, rather than let ourselves be swayed and abused by taking another approach.  \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Nice!  So Drumpf supporters aren\u0026amp;#39;t even going to \u0026lt;em\u0026gt;try\u0026lt;/em\u0026gt; to use virtue and logic to argue their points.  I presume they\u0026amp;#39;ll instead look to memes, shit posting, and name calling.  It\u0026amp;#39;ll be a shame to see \u0026lt;a href\u003d\"/r/The_Donald\"\u0026gt;/r/The_Donald\u0026lt;/a\u0026gt; change so much, but times are what they are.  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;\u0026amp;quot;But won\u0026amp;#39;t that make this sub an echo chamber?\u0026amp;quot; Frankly, reddit is not a closed off community and it is absolutely not free of liberal or anti-Drumpf viewpoints.   \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;SAFE SPACE!!  THIS GUY WANTS A SAFE SPACE OVER HERE!!  See?  Nobody cares.  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;This sub will be the vacation island resort for people we like and people who support us, not for Cuckolds who deep down hate being surrounded by Cucks just as badly as we do.   \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;IT\u0026amp;#39;S AN ISLAND!  BUILD A WALL AROUND THE ISLAND SO THE SEA CAN\u0026amp;#39;T GET IN!  \u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;And BTW, any comparisons between this and safespacing will result in a ban. Safespaces are responses to triggering, to scary views, and the patheticness of those who inhabit them.   \u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;Oh.  Woops!  My bad.  \u0026lt;/p\u0026gt;\n\n\u0026lt;hr/\u0026gt;\n\n\u0026lt;p\u0026gt;Well I can\u0026amp;#39;t speak for you, but this post really convinced me that I should be voting for Drumpf.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;What do you guys think?  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Time to throw in the towel, admit we\u0026amp;#39;re cucks, and vote for the candidate with the massive dick and the best words?  \u0026lt;/p\u0026gt;\n\n\u0026lt;hr/\u0026gt;\n\n\u0026lt;p\u0026gt;Addendum: Two things of note.  First, I initially posted this to \u0026lt;a href\u003d\"/r/OpenBroke\"\u0026gt;/r/OpenBroke\u0026lt;/a\u0026gt;. (Because I really have trouble sorting the meta-communities out.  Who\u0026amp;#39;s actually progressive?  Who\u0026amp;#39;s mocking progressives?  Are they sincere, or am I a victim of Poe\u0026amp;#39;s law?)  But it got little attention and it took like an hour to write, so I\u0026amp;#39;m being bold and risking a cross-post.  Secondly: If I\u0026amp;#39;m \u0026lt;em\u0026gt;still\u0026lt;/em\u0026gt; not in the right place, and I\u0026amp;#39;m actually buying into Poe\u0026amp;#39;s law, please feel free to express the state of your jimmie rustles with the downvote button, at least then I\u0026amp;#39;ll know for sure that I\u0026amp;#39;m not supposed to be here and I can get out of your hairs.\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.circlebroke","gilded":0,"commentCount":220,"score":306,"upVotes":306,"downVotes":0,"created":1.457158741E9,"createdUTC":1.457129941E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"48zmtr","fullName":"t3_48zmtr"}],"sankeyNodes":[],"sentiments":[]}