{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"Tired Of All The \"Obama Hate\" E-mail Fowards, So I Replied To ALL...","label":"pixelmagic","duration":"","id":0,"color":"red","redditID":"t3_am3rx","isTrueCluster":"true","timestamp":1.262787926E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/politics/comments/am3rx/tired_of_all_the_obama_hate_email_fowards_so_i/","permalink":"/r/politics/comments/am3rx/tired_of_all_the_obama_hate_email_fowards_so_i/?ref\u003dsearch_posts","author":"PixelMagic","title":"Tired Of All The \"Obama Hate\" E-mail Fowards, So I Replied To ALL...","subreddit":"politics","subredditId":"t5_2cneq","thumbnail":"self","selftext":"So my aunt forwards me one of those right-wing Obama hate machine e-mails, and I finally had enough.  Here is the poll see forwarded me so that all her right wing friends could make Obama look bad in a pointless online poll...\n\n[Obama Poll](http://js.polls.yahoo.com/quiz/quiziframe.php?poll_id\u003d46067)\n\nSo I replied as follows...\n\nThe results of this poll are hilarious.  It was clearly circulated among the right-wing Obama hating e-mail circles common these days, hence the very skewed negative results.  I will concede that Obama is not perfect, he has some improvements to make for sure, but the right hate him almost as much as Satan himself.  All the nonsense calling him Muslim, socialist, and questioning his birth in the US, just shows that the right has lost their minds. Firstly, Obama is not a Muslim, [Source](http://www.snopes.com/politics/obama/muslim.asp) but even if he was, who cares? Separation of church and state, and all. Perhaps we should have an atheist president, so there won\u0027t be any silly arguments over religion.  Secondly, Obama is not a socialist. [Source](http://www.washingtonpost.com/wp-dyn/content/article/2009/03/13/AR2009031301899.html) Thirdly, he has been verified to have been born in the United States through birth records.[Source](http://www.city-data.com/forum/attachments/2008-presidential-election/21432d1213364575-obama-s-birth-certificate-bo_birthcert.jpg)  So why has all this nonsense spread? Bigoted and ignorant republicans grasping at straws to have \"dirt\" on the guy because they don\u0027t like a black Democrat in office.\n\nThey forget or, rather, dismiss the fact that George W. Bush was in office when the economy went down the tubes. Not to mention the $950,000,000,000 cost of unnecessary wars. Oh, but health care is too expensive. We can\u0027t spend money to help our own people, but we\u0027ve got loads of money to go kill people in other countries.  Where were all the right wing protesters and tea parties then? Funny since George W. Bush was one of the worst presidents of all time.  Oh,  that\u0027s right, W was a white republican...no need to complain.\n\nThe Obama hate by the right is really out of control.  I don\u0027t consider myself a Republican nor a Democrat, but it\u0027s clear from my view that the extreme-right Republicans have lost their minds. Feel free to forward this to whoever you wish. :) ","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;So my aunt forwards me one of those right-wing Obama hate machine e-mails, and I finally had enough.  Here is the poll see forwarded me so that all her right wing friends could make Obama look bad in a pointless online poll...\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"http://js.polls.yahoo.com/quiz/quiziframe.php?poll_id\u003d46067\"\u0026gt;Obama Poll\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;So I replied as follows...\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The results of this poll are hilarious.  It was clearly circulated among the right-wing Obama hating e-mail circles common these days, hence the very skewed negative results.  I will concede that Obama is not perfect, he has some improvements to make for sure, but the right hate him almost as much as Satan himself.  All the nonsense calling him Muslim, socialist, and questioning his birth in the US, just shows that the right has lost their minds. Firstly, Obama is not a Muslim, \u0026lt;a href\u003d\"http://www.snopes.com/politics/obama/muslim.asp\"\u0026gt;Source\u0026lt;/a\u0026gt; but even if he was, who cares? Separation of church and state, and all. Perhaps we should have an atheist president, so there won\u0026amp;#39;t be any silly arguments over religion.  Secondly, Obama is not a socialist. \u0026lt;a href\u003d\"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/13/AR2009031301899.html\"\u0026gt;Source\u0026lt;/a\u0026gt; Thirdly, he has been verified to have been born in the United States through birth records.\u0026lt;a href\u003d\"http://www.city-data.com/forum/attachments/2008-presidential-election/21432d1213364575-obama-s-birth-certificate-bo_birthcert.jpg\"\u0026gt;Source\u0026lt;/a\u0026gt;  So why has all this nonsense spread? Bigoted and ignorant republicans grasping at straws to have \u0026amp;quot;dirt\u0026amp;quot; on the guy because they don\u0026amp;#39;t like a black Democrat in office.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;They forget or, rather, dismiss the fact that George W. Bush was in office when the economy went down the tubes. Not to mention the $950,000,000,000 cost of unnecessary wars. Oh, but health care is too expensive. We can\u0026amp;#39;t spend money to help our own people, but we\u0026amp;#39;ve got loads of money to go kill people in other countries.  Where were all the right wing protesters and tea parties then? Funny since George W. Bush was one of the worst presidents of all time.  Oh,  that\u0026amp;#39;s right, W was a white republican...no need to complain.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The Obama hate by the right is really out of control.  I don\u0026amp;#39;t consider myself a Republican nor a Democrat, but it\u0026amp;#39;s clear from my view that the extreme-right Republicans have lost their minds. Feel free to forward this to whoever you wish. :) \u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.politics","gilded":0,"commentCount":69,"score":22,"upVotes":22,"downVotes":0,"created":1.262787926E9,"createdUTC":1.262759126E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"am3rx","fullName":"t3_am3rx"}],"sankeyNodes":[],"sentiments":[]}