{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"Senator Al Franken Has Answered Your Questions","label":"pardonmyfranton","duration":"","id":0,"color":"red","redditID":"t3_g90uv","isTrueCluster":"true","timestamp":1.300839973E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/IAmA/comments/g90uv/senator_al_franken_has_answered_your_questions/","permalink":"/r/IAmA/comments/g90uv/senator_al_franken_has_answered_your_questions/?ref\u003dsearch_posts","author":"pardonmyfranton","title":"Senator Al Franken Has Answered Your Questions","subreddit":"IAmA","subredditId":"t5_2qzb6","thumbnail":"self","selftext":"*Note: This was posted in r/iama yesterday but got caught in the spam filter and relegated to Reddit purgatory. So, with the blessing from the mods, I have reposted it today.*\n\n-------------------------------------------------------------------------------\n\nLast November, [/rpac](http://www.reddit.com/r/rpac) (now the OSDF) started with a post to r/politics [calling for the members of Reddit to form a political action committee.](http://www.reddit.com/r/politics/comments/e2to6/you_know_what_fuck_this_idea_that_we_cant_get/) Well, we’re still here fighting for Net Neutrality. As part of our ongoing efforts to raise awareness on this issue, we asked Senator Al Franken (one of Net Neutrality’s most outspoken supporters) if he would answer a few questions. You guys asked [a number of good ones](http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/)--in addition to sharing a few [gripes.](http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k42jk) Hiccups aside, we are grateful for the Senator’s time and excited to push forward in light of an [onslaught of attacks on Net Neutrality](http://thehill.com/blogs/hillicon-valley/technology/149755-house-panel-votes-to-repeal-net-neutrality)--not to mention [bandwidth caps](http://arstechnica.com/tech-policy/news/2011/03/att-officially-announces-data-caps-wont-talk-about-congestion.ars) and [giant mergers.](http://dealbook.nytimes.com/2011/03/20/att-to-buy-t-mobile-usa-for-39-billion/)\n\nAs you can imagine, we really want the OSDF to succeed. And with Reddit being the 55th most popular website in the US, it might just be the perfect place to [“use the internet to save the internet.”](http://www.guardian.co.uk/technology/blog/2011/mar/14/sxsw-2011-al-franken-net-neutrality). If you’d like to help, then please drop by [/rpac](http://www.reddit.com/r/rpac) and share some ideas or sign up to [volunteer](http://theosdf.org/signup). We are starting to lay down a plan for how we want to lobby Congress over the next year and how to continue to spread the word on Net Neutrality. \n\nWithout further ado, here are the Senator’s answers:\n\n------------------------------------------------------------------------------------------\n\nThank you very much for all of your questions. While I wasn’t able to get to all of them, I’ve answered the questions that represent the issues brought up most frequently in this discussion.\n\n[*KipMo asks:*](http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k0fgi) *What can I do as a normal citizen to help fight for net neutrality?*\n\nAs I recently said in a speech at SXSW, it’s time to use the Internet to save the Internet. If you have a blog or large social network, then you have access to a tremendous source of social and political capital. And you\u0027re the only ones who can tap into that network to help build the movement we\u0027ll need to win this fight.\n \nIf we\u0027re going to win these legislative battles, we need to engage more voices in this debate, including people who would be hurt if net neutrality became a thing of the past. Congress and the FCC need to hear this is important to you and your friends.\n \nOf course, that includes artists and entrepreneurs.  But it also includes the American people as a whole.  Most of them just don\u0027t know that the Internet they rely on could cease to exist as they know it. They hear a lot of talk about how innovative and exciting these corporations\u0027 plans are--and they don\u0027t realize that those plans would raise their rates, make it harder to access their favorite content online, and kill off creative and ideological viewpoints. Tell them. And then tell them to tell Congress and the FCC. \n\n\n\n[*CaroKhan asks:*](http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k18qv) *The Republicans argue that allowing ISPs to run their networks as they see fit in a free market will result in more, better consumer choices than imposing Net Neutrality regulations will. How would you respond?*\n\nLet’s be clear: we basically have net neutrality right now; all I’m saying is that we don’t want to lose it. Big corporations want to change the way the Internet works to maximize their profit at the expense of consumers. \n \nFor example, Comcast now owns the pipes that deliver content and they own a lot of the content itself. If net neutrality principles are enforced, it wouldn’t change what they are doing now, but it would prevent them from putting competing video streaming services, like Netflix, out of business.  \n \nRight now a mom and pop bookstore’s website can load as fast as Amazon.com. That’s because of the net neutrality we currently enjoy. If we don’t protect this framework, then corporations like Amazon, or Barnes \u0026amp; Noble.com, can pay to have their websites load faster or even to have the mom and pop’s website not load at all. \n \nThe very fact that some ISPs are opposing the FCC’s very modest net neutrality regulations should serve as a warning that they want to change the rules of the road going forward.\n\nAll the freedom of speech online we have now comes from a de facto net neutrality policy. The big telecom companies are trying to abandon net neutrality rules, and we need to take formal steps to make sure that the de facto rules of today become formal legal obligations going forward. \n\n\n\n[*Snoharm asks:*](http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k0f31) *Are there any particular senators or congressmen you think have an especially good grip on the issue?*\n\nLet’s just say, there are some who get it and some who really don’t. Sen. Maria Cantwell (D-Wash.), for example, really knows what she is talking about. In fact, she and I introduced the Internet Freedom, Broadband Promotion, and Consumer Protection Act of 2011 in January.  I also really respect Sens. Ron Wyden (D-Ore.) and John Kerry (D-Mass.) and Rep. Ed Markey (D-Mass.) for their great leadership on technology and net neutrality issues. They have been great allies in this fight.\n \n\n\n[*Nosecohn asks:*](http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k373c) *Do you believe the majority of legislators who will be voting on net neutrality really understand what it is, and all of its ramifications? Do they understand that this is an effort to preserve the freedom of the system, not impede it? Are there any net neutrality proponents lobbying the Senate that are strong enough to truly have some influence?*\n\nUnfortunately, it’s clear that not everybody understands net neutrality. That’s because part of the strategy being used by people who want to destroy net neutrality is to confuse Americans about what the term even means.\n \nNet neutrality means that content--a web page, an email, a download--moves over the Internet freely, and it moves at the same speed no matter what it is or who owns it in a content-neutral manner.\n \nOpponents will tell you that putting rules in place to preserve net neutrality as it exists today amounts to a \"government takeover\" of the Internet, a talking point that deserves a place alongside \"death panels\" and \"Obama\u0027s a Muslim\" in the pantheon of lies that aren\u0027t just baldly false, but completely ridiculous.\n \nThe word \"takeover\" implies that we want to change the Internet.  We don\u0027t.  And it\u0027s not the government trying to exert more control over the Internet; it\u0027s big corporations who want to put tollbooths on the information superhighway.\n \nSo join me in building a movement to spread awareness and create momentum. Contact your representatives and tell your friends about how important net neutrality is to the Internet and the future of online innovation.\n \n\n\n[*Slacker525600 asks:*](http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k1bvp) *How can you support net neutrality while supporting COICA?*\n\nOnline piracy of copyrighted content and counterfeit goods hurt American workers and businesses, and it ultimately means lost jobs. It’s simply unacceptable, and I believe we need to be doing more to halt this type of piracy. That’s why I think the Combating Online Infringement and Counterfeits Act (COICA) is necessary.\n\nHowever, I had some concerns with the approach that was taken last Congress, and I worked to make it better.  For example, when the bill first came before us last year, I opposed a provision that created a blacklist of Internet sites without adequate due process, and ultimately that provision was removed.  \n\nWe also need to move cautiously before we create a structure that will direct Internet service providers to block content at the domain name level.  This is a very big step, and we want to make sure that our approach to this problem is as targeted as possible so that we do not censor legitimate free speech.  A significant number of engineers who assisted in the design of the Internet have raised concerns with this part of the bill, and I am taking their concerns seriously.\n\n\n\n[*Wargazm asks:*](http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k0biu) *Why did you vote to extend provisions of the PATRIOT Act?*\n\nI believe that counterterrorism officials should have the tools they need to help keep us safe. At the same time, we must ensure that the privacy of innocent Americans isn’t threatened, and that the powers granted under the PATRIOT Act aren’t abused.\n \nIn February, Congress voted to extend the three expiring provisions of the PATRIOT Act for three months so that we could have more time to make improvements to these provisions before we reauthorize them for a longer period of time. We’ll be taking up that longer reauthorization in the full Senate later this spring.\n \nBut we’ve already made some positive changes. In the Senate Judiciary Committee, which I’m a member of, we recently passed an updated 3-year extension of three provisions, all of which I think we improved.  This extension strengthened safeguards against abuse of these provisions by creating increased congressional oversight and greater judicial review, which will hopefully curb abuse and hold law enforcement officials more accountable. We also added an important new “sunset” for National Security Letters—which allow the FBI to collect a range of information without court approval—that would stop the FBI from using them after 2013 unless Congress intervenes to allow their continued use. Together, these changes are real improvements and will help keep law enforcement agencies accountable.\n\n------------------------------------------------------------------------------------------------------------------------------\nEdit - [Incorrect word usage.](http://www.reddit.com/r/IAmA/comments/g90uv/senator_al_franken_has_answered_your_questions/c1lvvc4?context\u003d3)","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;\u0026lt;em\u0026gt;Note: This was posted in \u0026lt;a href\u003d\"/r/iama\"\u0026gt;r/iama\u0026lt;/a\u0026gt; yesterday but got caught in the spam filter and relegated to Reddit purgatory. So, with the blessing from the mods, I have reposted it today.\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;hr/\u0026gt;\n\n\u0026lt;p\u0026gt;Last November, \u0026lt;a href\u003d\"http://www.reddit.com/r/rpac\"\u0026gt;/rpac\u0026lt;/a\u0026gt; (now the OSDF) started with a post to \u0026lt;a href\u003d\"/r/politics\"\u0026gt;r/politics\u0026lt;/a\u0026gt; \u0026lt;a href\u003d\"http://www.reddit.com/r/politics/comments/e2to6/you_know_what_fuck_this_idea_that_we_cant_get/\"\u0026gt;calling for the members of Reddit to form a political action committee.\u0026lt;/a\u0026gt; Well, we’re still here fighting for Net Neutrality. As part of our ongoing efforts to raise awareness on this issue, we asked Senator Al Franken (one of Net Neutrality’s most outspoken supporters) if he would answer a few questions. You guys asked \u0026lt;a href\u003d\"http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/\"\u0026gt;a number of good ones\u0026lt;/a\u0026gt;--in addition to sharing a few \u0026lt;a href\u003d\"http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k42jk\"\u0026gt;gripes.\u0026lt;/a\u0026gt; Hiccups aside, we are grateful for the Senator’s time and excited to push forward in light of an \u0026lt;a href\u003d\"http://thehill.com/blogs/hillicon-valley/technology/149755-house-panel-votes-to-repeal-net-neutrality\"\u0026gt;onslaught of attacks on Net Neutrality\u0026lt;/a\u0026gt;--not to mention \u0026lt;a href\u003d\"http://arstechnica.com/tech-policy/news/2011/03/att-officially-announces-data-caps-wont-talk-about-congestion.ars\"\u0026gt;bandwidth caps\u0026lt;/a\u0026gt; and \u0026lt;a href\u003d\"http://dealbook.nytimes.com/2011/03/20/att-to-buy-t-mobile-usa-for-39-billion/\"\u0026gt;giant mergers.\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;As you can imagine, we really want the OSDF to succeed. And with Reddit being the 55th most popular website in the US, it might just be the perfect place to \u0026lt;a href\u003d\"http://www.guardian.co.uk/technology/blog/2011/mar/14/sxsw-2011-al-franken-net-neutrality\"\u0026gt;“use the internet to save the internet.”\u0026lt;/a\u0026gt;. If you’d like to help, then please drop by \u0026lt;a href\u003d\"http://www.reddit.com/r/rpac\"\u0026gt;/rpac\u0026lt;/a\u0026gt; and share some ideas or sign up to \u0026lt;a href\u003d\"http://theosdf.org/signup\"\u0026gt;volunteer\u0026lt;/a\u0026gt;. We are starting to lay down a plan for how we want to lobby Congress over the next year and how to continue to spread the word on Net Neutrality. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Without further ado, here are the Senator’s answers:\u0026lt;/p\u0026gt;\n\n\u0026lt;hr/\u0026gt;\n\n\u0026lt;p\u0026gt;Thank you very much for all of your questions. While I wasn’t able to get to all of them, I’ve answered the questions that represent the issues brought up most frequently in this discussion.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k0fgi\"\u0026gt;\u0026lt;em\u0026gt;KipMo asks:\u0026lt;/em\u0026gt;\u0026lt;/a\u0026gt; \u0026lt;em\u0026gt;What can I do as a normal citizen to help fight for net neutrality?\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;As I recently said in a speech at SXSW, it’s time to use the Internet to save the Internet. If you have a blog or large social network, then you have access to a tremendous source of social and political capital. And you\u0026amp;#39;re the only ones who can tap into that network to help build the movement we\u0026amp;#39;ll need to win this fight.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;If we\u0026amp;#39;re going to win these legislative battles, we need to engage more voices in this debate, including people who would be hurt if net neutrality became a thing of the past. Congress and the FCC need to hear this is important to you and your friends.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Of course, that includes artists and entrepreneurs.  But it also includes the American people as a whole.  Most of them just don\u0026amp;#39;t know that the Internet they rely on could cease to exist as they know it. They hear a lot of talk about how innovative and exciting these corporations\u0026amp;#39; plans are--and they don\u0026amp;#39;t realize that those plans would raise their rates, make it harder to access their favorite content online, and kill off creative and ideological viewpoints. Tell them. And then tell them to tell Congress and the FCC. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k18qv\"\u0026gt;\u0026lt;em\u0026gt;CaroKhan asks:\u0026lt;/em\u0026gt;\u0026lt;/a\u0026gt; \u0026lt;em\u0026gt;The Republicans argue that allowing ISPs to run their networks as they see fit in a free market will result in more, better consumer choices than imposing Net Neutrality regulations will. How would you respond?\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Let’s be clear: we basically have net neutrality right now; all I’m saying is that we don’t want to lose it. Big corporations want to change the way the Internet works to maximize their profit at the expense of consumers. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;For example, Comcast now owns the pipes that deliver content and they own a lot of the content itself. If net neutrality principles are enforced, it wouldn’t change what they are doing now, but it would prevent them from putting competing video streaming services, like Netflix, out of business.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Right now a mom and pop bookstore’s website can load as fast as Amazon.com. That’s because of the net neutrality we currently enjoy. If we don’t protect this framework, then corporations like Amazon, or Barnes \u0026amp;amp; Noble.com, can pay to have their websites load faster or even to have the mom and pop’s website not load at all. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The very fact that some ISPs are opposing the FCC’s very modest net neutrality regulations should serve as a warning that they want to change the rules of the road going forward.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;All the freedom of speech online we have now comes from a de facto net neutrality policy. The big telecom companies are trying to abandon net neutrality rules, and we need to take formal steps to make sure that the de facto rules of today become formal legal obligations going forward. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k0f31\"\u0026gt;\u0026lt;em\u0026gt;Snoharm asks:\u0026lt;/em\u0026gt;\u0026lt;/a\u0026gt; \u0026lt;em\u0026gt;Are there any particular senators or congressmen you think have an especially good grip on the issue?\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Let’s just say, there are some who get it and some who really don’t. Sen. Maria Cantwell (D-Wash.), for example, really knows what she is talking about. In fact, she and I introduced the Internet Freedom, Broadband Promotion, and Consumer Protection Act of 2011 in January.  I also really respect Sens. Ron Wyden (D-Ore.) and John Kerry (D-Mass.) and Rep. Ed Markey (D-Mass.) for their great leadership on technology and net neutrality issues. They have been great allies in this fight.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k373c\"\u0026gt;\u0026lt;em\u0026gt;Nosecohn asks:\u0026lt;/em\u0026gt;\u0026lt;/a\u0026gt; \u0026lt;em\u0026gt;Do you believe the majority of legislators who will be voting on net neutrality really understand what it is, and all of its ramifications? Do they understand that this is an effort to preserve the freedom of the system, not impede it? Are there any net neutrality proponents lobbying the Senate that are strong enough to truly have some influence?\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Unfortunately, it’s clear that not everybody understands net neutrality. That’s because part of the strategy being used by people who want to destroy net neutrality is to confuse Americans about what the term even means.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Net neutrality means that content--a web page, an email, a download--moves over the Internet freely, and it moves at the same speed no matter what it is or who owns it in a content-neutral manner.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Opponents will tell you that putting rules in place to preserve net neutrality as it exists today amounts to a \u0026amp;quot;government takeover\u0026amp;quot; of the Internet, a talking point that deserves a place alongside \u0026amp;quot;death panels\u0026amp;quot; and \u0026amp;quot;Obama\u0026amp;#39;s a Muslim\u0026amp;quot; in the pantheon of lies that aren\u0026amp;#39;t just baldly false, but completely ridiculous.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The word \u0026amp;quot;takeover\u0026amp;quot; implies that we want to change the Internet.  We don\u0026amp;#39;t.  And it\u0026amp;#39;s not the government trying to exert more control over the Internet; it\u0026amp;#39;s big corporations who want to put tollbooths on the information superhighway.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;So join me in building a movement to spread awareness and create momentum. Contact your representatives and tell your friends about how important net neutrality is to the Internet and the future of online innovation.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k1bvp\"\u0026gt;\u0026lt;em\u0026gt;Slacker525600 asks:\u0026lt;/em\u0026gt;\u0026lt;/a\u0026gt; \u0026lt;em\u0026gt;How can you support net neutrality while supporting COICA?\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Online piracy of copyrighted content and counterfeit goods hurt American workers and businesses, and it ultimately means lost jobs. It’s simply unacceptable, and I believe we need to be doing more to halt this type of piracy. That’s why I think the Combating Online Infringement and Counterfeits Act (COICA) is necessary.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;However, I had some concerns with the approach that was taken last Congress, and I worked to make it better.  For example, when the bill first came before us last year, I opposed a provision that created a blacklist of Internet sites without adequate due process, and ultimately that provision was removed.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;We also need to move cautiously before we create a structure that will direct Internet service providers to block content at the domain name level.  This is a very big step, and we want to make sure that our approach to this problem is as targeted as possible so that we do not censor legitimate free speech.  A significant number of engineers who assisted in the design of the Internet have raised concerns with this part of the bill, and I am taking their concerns seriously.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"http://www.reddit.com/r/IAmA/comments/g0hir/ask_senator_al_franken_anything/c1k0biu\"\u0026gt;\u0026lt;em\u0026gt;Wargazm asks:\u0026lt;/em\u0026gt;\u0026lt;/a\u0026gt; \u0026lt;em\u0026gt;Why did you vote to extend provisions of the PATRIOT Act?\u0026lt;/em\u0026gt;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;I believe that counterterrorism officials should have the tools they need to help keep us safe. At the same time, we must ensure that the privacy of innocent Americans isn’t threatened, and that the powers granted under the PATRIOT Act aren’t abused.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;In February, Congress voted to extend the three expiring provisions of the PATRIOT Act for three months so that we could have more time to make improvements to these provisions before we reauthorize them for a longer period of time. We’ll be taking up that longer reauthorization in the full Senate later this spring.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;But we’ve already made some positive changes. In the Senate Judiciary Committee, which I’m a member of, we recently passed an updated 3-year extension of three provisions, all of which I think we improved.  This extension strengthened safeguards against abuse of these provisions by creating increased congressional oversight and greater judicial review, which will hopefully curb abuse and hold law enforcement officials more accountable. We also added an important new “sunset” for National Security Letters—which allow the FBI to collect a range of information without court approval—that would stop the FBI from using them after 2013 unless Congress intervenes to allow their continued use. Together, these changes are real improvements and will help keep law enforcement agencies accountable.\u0026lt;/p\u0026gt;\n\n\u0026lt;hr/\u0026gt;\n\n\u0026lt;p\u0026gt;Edit - \u0026lt;a href\u003d\"http://www.reddit.com/r/IAmA/comments/g90uv/senator_al_franken_has_answered_your_questions/c1lvvc4?context\u003d3\"\u0026gt;Incorrect word usage.\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.IAmA","gilded":0,"commentCount":188,"score":351,"upVotes":351,"downVotes":0,"created":1.300839973E9,"createdUTC":1.300811173E9,"visited":false,"self":false,"saved":false,"edited":true,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"g90uv","fullName":"t3_g90uv"}],"sankeyNodes":[],"sentiments":[]}