{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"Proof that there is hope...My mom supports OWS","label":"burnt-orange","duration":"","id":0,"color":"red","redditID":"t3_mlv43","isTrueCluster":"true","timestamp":1.322022942E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/occupywallstreet/comments/mlv43/proof_that_there_is_hopemy_mom_supports_ows/","permalink":"/r/occupywallstreet/comments/mlv43/proof_that_there_is_hopemy_mom_supports_ows/?ref\u003dsearch_posts","author":"Burnt-Orange","title":"Proof that there is hope...My mom supports OWS","subreddit":"occupywallstreet","subredditId":"t5_2sn7r","thumbnail":"self","selftext":"I thought I\u0027d share a success story of OWS that would never reach the media.\n\nI grew up in an exceptionally Republican household.  My mom has every Rush Limbaugh book he has written, and rarely misses his radio show.  Regan was worshiped, Clinton was vilified, and I remember on more than one occasion having to respond to a chain email that Obama is NOT a Marxist Muslim.  In fact, politics is such a point of contention between everyone, it is FORBIDDEN in my house.  \n\nUntil about 2 weeks ago.  My mom was over visiting and she said she couldn\u0027t believe how things were twisted in the media.  I expected a normal \"MSM is reporting X while Fox is reporting Y\" type thing.  But then I heard the words I never expected to hear. \n\n\"You can\u0027t trust *any* of the media anymore.  They say there\u0027s no jobs, then they say get jobs, and those kids out there just can\u0027t find them.\"\n\nORLY?\n\nI nearly fell over.  We talked for nearly 2 hours about OWS and how important it is.  Of course there were still disagreements, she was a huge Tea Party supporter, so there was an expected \"too many people on welfare\" type of comment or two.  But that\u0027s ok, because that is a rational dispute to have.  The bigger picture, that we both agreed on, was about too much money in politics, too much corruption in the government/banking system, and how our two party system is failing us.  She denounced Fox and Limbaugh, and said Beck was a loon.  We both agree on Obama’s faults, and there were no “Obama’s not American” remarks.\n\nFolks of OWS, you are making a difference.  YOU were able to get a die-hard republican in the rural Midwest to question the status quo.  YOU were able to get a message out to the masses in spite of the biased media.  There is a light at the end of the tunnel, and for once, it\u0027s not an oncoming train.\n\nKeep up the fight.\n","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;I thought I\u0026amp;#39;d share a success story of OWS that would never reach the media.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;I grew up in an exceptionally Republican household.  My mom has every Rush Limbaugh book he has written, and rarely misses his radio show.  Regan was worshiped, Clinton was vilified, and I remember on more than one occasion having to respond to a chain email that Obama is NOT a Marxist Muslim.  In fact, politics is such a point of contention between everyone, it is FORBIDDEN in my house.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Until about 2 weeks ago.  My mom was over visiting and she said she couldn\u0026amp;#39;t believe how things were twisted in the media.  I expected a normal \u0026amp;quot;MSM is reporting X while Fox is reporting Y\u0026amp;quot; type thing.  But then I heard the words I never expected to hear. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026amp;quot;You can\u0026amp;#39;t trust \u0026lt;em\u0026gt;any\u0026lt;/em\u0026gt; of the media anymore.  They say there\u0026amp;#39;s no jobs, then they say get jobs, and those kids out there just can\u0026amp;#39;t find them.\u0026amp;quot;\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;ORLY?\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;I nearly fell over.  We talked for nearly 2 hours about OWS and how important it is.  Of course there were still disagreements, she was a huge Tea Party supporter, so there was an expected \u0026amp;quot;too many people on welfare\u0026amp;quot; type of comment or two.  But that\u0026amp;#39;s ok, because that is a rational dispute to have.  The bigger picture, that we both agreed on, was about too much money in politics, too much corruption in the government/banking system, and how our two party system is failing us.  She denounced Fox and Limbaugh, and said Beck was a loon.  We both agree on Obama’s faults, and there were no “Obama’s not American” remarks.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Folks of OWS, you are making a difference.  YOU were able to get a die-hard republican in the rural Midwest to question the status quo.  YOU were able to get a message out to the masses in spite of the biased media.  There is a light at the end of the tunnel, and for once, it\u0026amp;#39;s not an oncoming train.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Keep up the fight.\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.occupywallstreet","gilded":0,"commentCount":34,"score":224,"upVotes":224,"downVotes":0,"created":1.322022942E9,"createdUTC":1.321994142E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"mlv43","fullName":"t3_mlv43"}],"sankeyNodes":[],"sentiments":[]}