{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"To Muslims (And I guess any other religion as well): Do you find the idea of Obama being Muslim ridiculous?","label":"eyulfable","duration":"","id":0,"color":"red","redditID":"t3_uhc04","isTrueCluster":"true","timestamp":1.338684655E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/DebateReligion/comments/uhc04/to_muslims_and_i_guess_any_other_religion_as_well/","permalink":"/r/DebateReligion/comments/uhc04/to_muslims_and_i_guess_any_other_religion_as_well/?ref\u003dsearch_posts","author":"Eyulfable","title":"To Muslims (And I guess any other religion as well): Do you find the idea of Obama being Muslim ridiculous?","subreddit":"DebateReligion","subredditId":"t5_2snuc","thumbnail":"","selftext":"I\u0027m going to ignore the part of whether or not it even matters what religion he is. If you try to play the terrorist card, know that not all Muslims are terrorists, and the WBC and Rush Limbaugh and several other Christians fall into the category of terrorism by making people fear things in order to make people change their opinions.\n\nMy question is the ridiculousness of it, simply because of the little I\u0027ve studied of Islam. One of the 5 pillars alone should have easily revealed him as Muslim by now. If I\u0027m right, a Muslim is supposed to pray 5 times a day. This is nothing like the Christian form of praying when you can just whisper it in your head. Granted, it\u0027s not as ostentatious as Tim Tebow, how made a career out of praying, but it still involves a mat facing Mecca and a bunch of bowing involved. If he was Muslim, this would have been very easily seen praying, and you would be able to tell certain times where he is always rather absent.","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;I\u0026amp;#39;m going to ignore the part of whether or not it even matters what religion he is. If you try to play the terrorist card, know that not all Muslims are terrorists, and the WBC and Rush Limbaugh and several other Christians fall into the category of terrorism by making people fear things in order to make people change their opinions.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;My question is the ridiculousness of it, simply because of the little I\u0026amp;#39;ve studied of Islam. One of the 5 pillars alone should have easily revealed him as Muslim by now. If I\u0026amp;#39;m right, a Muslim is supposed to pray 5 times a day. This is nothing like the Christian form of praying when you can just whisper it in your head. Granted, it\u0026amp;#39;s not as ostentatious as Tim Tebow, how made a career out of praying, but it still involves a mat facing Mecca and a bunch of bowing involved. If he was Muslim, this would have been very easily seen praying, and you would be able to tell certain times where he is always rather absent.\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.DebateReligion","gilded":0,"commentCount":59,"score":3,"upVotes":3,"downVotes":0,"created":1.338684655E9,"createdUTC":1.338655855E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"uhc04","fullName":"t3_uhc04"}],"sankeyNodes":[],"sentiments":[]}