{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"Christianity Today: Point/counterpoint on whether Obama is a Christian","label":"pensivebadger","duration":"","id":0,"color":"red","redditID":"t3_vfmff","isTrueCluster":"true","timestamp":1.340399051E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/Christianity/comments/vfmff/christianity_today_pointcounterpoint_on_whether/","permalink":"/r/Christianity/comments/vfmff/christianity_today_pointcounterpoint_on_whether/?ref\u003dsearch_posts","author":"pensivebadger","title":"Christianity Today: Point/counterpoint on whether Obama is a Christian","subreddit":"Christianity","subredditId":"t5_2qh6c","thumbnail":"","selftext":"[Obama is not a Christian](http://www.christianitytoday.com/ct/2012/juneweb-only/why-we-should-reexamine-the-faith-of-barack-obama.html?paging\u003doff):\n\u0026gt;He sometimes sounds the thrilling chords of the gospel of life, but his policies smack of the culture of death. How can a man who shows such charm toward his wife help to destroy the foundational institution of human society? How can a man who so clearly loves his adorable daughters stand on the floor of the Illinois senate and declaim the right to life of a child who, against the terrible odds only a womb-bloodying scalpel can produce, miraculously survives an abortion? Saving faith creates a relentless desire in the name of Christ to heal the wounded, restore the weak, and defend tiny fetuses that kick and spin and wave their miniscule arms when they hear their parents\u0027 voices. Saving faith causes us to weep and yell and wrestle with God in prayer for infants that are savaged in the womb. Saving faith cannot abide unlawful death. It must and will decry it.\n\n[Obama is a Christian](http://www.christianitytoday.com/ct/2012/juneweb-only/barack-obama-evangelical-in-chief.html?paging\u003doff):\n\u0026gt; We are accustomed to hearing politicians offering guarded generalities about the goodness of faith. It\u0027s quite another thing for the President of the United States to personally affirm the atoning death and resurrection of Jesus Christ. If Obama is a secret Muslim, he\u0027s really good at making his closet Islamic beliefs sound a lot like crucicentric Christianity.","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"http://www.christianitytoday.com/ct/2012/juneweb-only/why-we-should-reexamine-the-faith-of-barack-obama.html?paging\u003doff\"\u0026gt;Obama is not a Christian\u0026lt;/a\u0026gt;:\u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;He sometimes sounds the thrilling chords of the gospel of life, but his policies smack of the culture of death. How can a man who shows such charm toward his wife help to destroy the foundational institution of human society? How can a man who so clearly loves his adorable daughters stand on the floor of the Illinois senate and declaim the right to life of a child who, against the terrible odds only a womb-bloodying scalpel can produce, miraculously survives an abortion? Saving faith creates a relentless desire in the name of Christ to heal the wounded, restore the weak, and defend tiny fetuses that kick and spin and wave their miniscule arms when they hear their parents\u0026amp;#39; voices. Saving faith causes us to weep and yell and wrestle with God in prayer for infants that are savaged in the womb. Saving faith cannot abide unlawful death. It must and will decry it.\u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;a href\u003d\"http://www.christianitytoday.com/ct/2012/juneweb-only/barack-obama-evangelical-in-chief.html?paging\u003doff\"\u0026gt;Obama is a Christian\u0026lt;/a\u0026gt;:\u0026lt;/p\u0026gt;\n\n\u0026lt;blockquote\u0026gt;\n\u0026lt;p\u0026gt;We are accustomed to hearing politicians offering guarded generalities about the goodness of faith. It\u0026amp;#39;s quite another thing for the President of the United States to personally affirm the atoning death and resurrection of Jesus Christ. If Obama is a secret Muslim, he\u0026amp;#39;s really good at making his closet Islamic beliefs sound a lot like crucicentric Christianity.\u0026lt;/p\u0026gt;\n\u0026lt;/blockquote\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.Christianity","gilded":0,"commentCount":85,"score":1,"upVotes":1,"downVotes":0,"created":1.340399051E9,"createdUTC":1.340370251E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"vfmff","fullName":"t3_vfmff"}],"sankeyNodes":[],"sentiments":[]}