{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"As the republican party moves to the right and I refuse to move along with it, I am mad because I now have a one party system. Here is my rant.","label":"thinkexist","duration":"","id":0,"color":"red","redditID":"t3_ysp6p","isTrueCluster":"true","timestamp":1.345904905E9,"simScore":0.0,"sentiment":"N/A"}],"userNodes":[],"links":[],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"o0079qom4v819525379b4b9013a8baad081458880d4a186d73","cookie":"43916988,2016-03-22T10:36:49,20b221a9b1949d7834ff26a81c39ebe89b4d13eb","password":"111111"},"url":"https://www.reddit.com/r/politics/comments/ysp6p/as_the_republican_party_moves_to_the_right_and_i/","permalink":"/r/politics/comments/ysp6p/as_the_republican_party_moves_to_the_right_and_i/?ref\u003dsearch_posts","author":"ThinkExist","title":"As the republican party moves to the right and I refuse to move along with it, I am mad because I now have a one party system. Here is my rant.","subreddit":"politics","subredditId":"t5_2cneq","thumbnail":"self","selftext":"Up or down vote me, whatever, I\u0027d like a place to vent where I wont be further socially ostracized because I\u0027ve been watching to much \"liberal media\". To be fair, in the current political climate I guess I should be considered a liberal, at least in-as-much as Eisenhower or Reagan would be considered today. I am the kind of person who had a tough time considering who to vote for in 08. I may have even wrote Ron Paul in to protest the two party system, but then McCain picks his VP. Thats when everything changed. I knew I had no chose but to vote against that crazy. But thats not specifically why I came here to vent, I already lost a lot of my credibility to my family on that discussion. \n\nWhat has really been getting my dingle berry recently is how Willard Romney has been playing the white card in an attempt to seem more american then Obama. The man cannot even release his tax returns for fucks sake. Do you know whats even worse then having a two party system? Having a **Fucking** one party system. Now only can I not vote for them, they are taking the power away from me to not vote for the democrats! Buts thats not even the worse part, not for me anyways. The worst part, and the sole reason I came here to rant, is that they make me look like some crazy person to most of my family and friends because I cannot accept their bullshit (Obama is a muslim? Really? Fuck. Have some dignity.). I know the republicans have a plantform they can run on and win, I almost voted for it! I really really tried my hardest to give the new Republican party a chance, to see their logic, but all I see is a bunch of mean people being mean to everyone, including themselves if necessary, just making it up as they go along, trading intellectual debate for sensationalism. \n\nTL;DR As the republican party moves to the right and I refuse to move with it, I am mad because they have turned our two party system into a one party system and worse of all I am being ostracized by my own family by not accepting unintelligent sensational arguments.\n\nEdit: Thanks for all the intellectual discussion! I always need some one to distract me from studying for the pGRE!","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;Up or down vote me, whatever, I\u0026amp;#39;d like a place to vent where I wont be further socially ostracized because I\u0026amp;#39;ve been watching to much \u0026amp;quot;liberal media\u0026amp;quot;. To be fair, in the current political climate I guess I should be considered a liberal, at least in-as-much as Eisenhower or Reagan would be considered today. I am the kind of person who had a tough time considering who to vote for in 08. I may have even wrote Ron Paul in to protest the two party system, but then McCain picks his VP. Thats when everything changed. I knew I had no chose but to vote against that crazy. But thats not specifically why I came here to vent, I already lost a lot of my credibility to my family on that discussion. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;What has really been getting my dingle berry recently is how Willard Romney has been playing the white card in an attempt to seem more american then Obama. The man cannot even release his tax returns for fucks sake. Do you know whats even worse then having a two party system? Having a \u0026lt;strong\u0026gt;Fucking\u0026lt;/strong\u0026gt; one party system. Now only can I not vote for them, they are taking the power away from me to not vote for the democrats! Buts thats not even the worse part, not for me anyways. The worst part, and the sole reason I came here to rant, is that they make me look like some crazy person to most of my family and friends because I cannot accept their bullshit (Obama is a muslim? Really? Fuck. Have some dignity.). I know the republicans have a plantform they can run on and win, I almost voted for it! I really really tried my hardest to give the new Republican party a chance, to see their logic, but all I see is a bunch of mean people being mean to everyone, including themselves if necessary, just making it up as they go along, trading intellectual debate for sensationalism. \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;TL;DR As the republican party moves to the right and I refuse to move with it, I am mad because they have turned our two party system into a one party system and worse of all I am being ostracized by my own family by not accepting unintelligent sensational arguments.\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Edit: Thanks for all the intellectual discussion! I always need some one to distract me from studying for the pGRE!\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.politics","gilded":0,"commentCount":59,"score":25,"upVotes":25,"downVotes":0,"created":1.345904905E9,"createdUTC":1.345876105E9,"visited":false,"self":false,"saved":false,"edited":false,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"ysp6p","fullName":"t3_ysp6p"}],"sankeyNodes":[],"sentiments":[]}