{"nodes":[{"index":0,"links":[],"score":4.0,"level":5,"title":"UGH, CP24, a 24h news channel has a \"psychic\" on their show. ","label":"clairvoyanttruth","duration":"","id":0,"color":"red","redditID":"t3_gqv27","isTrueCluster":"true","timestamp":1.302915401E9,"simScore":0.0,"sentiment":"N/A"},{"index":1,"links":[0],"score":5.0,"level":5,"title":"clairvoyanttruth","label":"I had to email them as this stored bother me enough. Tip of the hat to callum_cglp for making a [video](http://youtu.be/u8LuJXKYJCo) earlier that pissed me off enough and had the [contact link to email them.](http://www.cp24.com/contactUs/)\n\n\"I was watching CP24 as it is a quick way of getting all the current events in a quick 5 minutes. You had a guest on discussing the Royal Wedding, which is fine, but your guest was a self-proclaimed psychic. As a news station with a goal of spreading the truth, how can you explain having a psychic on your program? There has been no evidence suggesting that psychics can exist. When your host was interviewing the psychic, she took her at her word and said her predictions come true. I went to her site and she claims 300+ predictions of 2011. Of course some are going to come true, that probability not psychic ability.\n\nI can no longer watch your news channel as it is clear it is devised for entertainment and not news 24h, as you purportedly claim. These are the issues why television is mocked and looked down upon in the online community, and your \"psychic news story\" is no exception.\n\nHoping for intelligent progression,  \nClairvoyanttruth","duration":"","id":1,"color":"blue","redditID":"t1_c1plawz","isTrueCluster":"true","parentID":{"index":0,"links":[],"score":4.0,"level":5,"title":"UGH, CP24, a 24h news channel has a \"psychic\" on their show. ","label":"clairvoyanttruth","duration":"","id":0,"color":"red","redditID":"t3_gqv27","isTrueCluster":"true","timestamp":1.302915401E9,"simScore":0.0,"sentiment":"N/A"},"timestamp":1.302918327E9,"simScore":0.5973861234234645,"sentiment":"  Negative"},{"index":2,"links":[0],"score":5.0,"level":5,"title":"clairvoyanttruth","label":"[predictions continued]\n\nThe Royals  \nA royal pregnancy.   A horse accident around the royal family.   The Queen has to watch for kidnapping.   The Duke of Edinborough has to watch his health.   A royal wedding.   Wedding in Monaco.   Danger around the Queen.   Buckingham Palace on fire.   Royal staff will quit because of too many ghosts at Buckingham Palace.   Prince Harry has to be careful of fast cars.   The royal Crown Jewels will be stolen.   The Queen has to watch health.   Windsor Castle on fire.   A royal kidnapping.   A royal funeral.   Sports Predictions\nA new national hockey league for women.   A racehorse and jockey die at a race.   A spectacular crash of three formula race cars together.   Another sting ray death.   A shark attack off the coast of Maine.   A riot at a soccer stadium.   A riot on a basketball court.   Tragedy at an air show.   Tiger Woods has to be careful of planes.   \n\nDeath and Health Watch  \nAnnette Funicello, Hillary Clinton, Charles Manson, Doris Day, Ben Kingsley, Willie Nelson, Penny Marshall, Clint Eastwood, Paul Tracey, Brittany Spears, Dario Franchetti, John Walsh, Latoya Jackson, Steven Harper, Alice Cooper, Ronnie Hawkins, Gordon Lightfoot, North Korean President, Prime Minister of Australia, Burt Reynolds, David Hasselhoff (The Hoff), Tiger Woods, Hulk Hogan, Mickey Rooney, Pamela Anderson, Shakira, Loretta Lynn, Kirstie Alley, Fidel Castro, Hugo Chavez, President Masharoff, Billy Graham, Jerry Lewis, Kirk Douglas, Michael Douglas, Joanne Woodward, Debbie Reynolds, Barak Obama, Zsa Zsa Gabor, Dick Clark, Ryan Seacrest, Nelson Mandela, Lindsay Lohan, Kanya West, Sean Combs, Nancy Reagan, Dick Cheney, Dick Clark, George Bush Senior, Jimmy Carter, Barbra Bush, Elizabeth Taylor, Larry King, Mick Jagger, Steve Tyler, Elton John, Arnold Swarzenhagger, Doris Day, Pink, Hugh Hefner, Shirley Temple Black, Alex Trebek, French President Sarkozy, Queen Elizabeth, Duke of Edinborough, Prime Minister of England, Amy Winehouse, Aretha Franklin, Bob Barker, Karl Lagerfield, Ralph Lauren, David Copperfield, Jackie Stallone, Sylvester Stallone, Chris Angel (Mind Freak), Tippi Hendren, Melanie Griffith, Keith Richards, the group Metallica’s David Blaine, Lauren Bacall, Marilyn Manson, Sean Penn, Madonna, Axel Rose of Guns and Roses, Larry King, former Prime Minister Tony Blair, Bill Clinton, Howie Mandel, Dog Dwayne Chapman the Bounty Hunter, Miko Brando, Michael Jackson’s father, Catharine Jackson, Carol Channing, Phyllis Diller, Barry Manilow, George Clooney, Jeremy Irons, Brad Pitt, Prince of Purple Rain, Robin Williams, Michael J.   Fox, John Travolta, Woody Allen, Al Pacino, Robert D’Niro, Jack Nicolson, Mariska Hargerty, Nicole Richie, Royal Prince’s Harry and William, David Letterman, Harry Bellefonte, Bill Cosby, Pamela Anderson, Sir Richard Branson, Jay Leno, Hillary Clinton, Barbra Streisand, Peter Falk, Robert Evans, Ernest Borgnine, Chaz Bono, Bob Barker, Michelle Williams, Heidi Montague, Justin Beiber, Ed Asner, Kreskin, and Lady Gaga.   \"\n","duration":"","id":2,"color":"blue","redditID":"t1_c1pl0dr","isTrueCluster":"true","parentID":{"index":0,"links":[],"score":4.0,"level":5,"title":"UGH, CP24, a 24h news channel has a \"psychic\" on their show. ","label":"clairvoyanttruth","duration":"","id":0,"color":"red","redditID":"t3_gqv27","isTrueCluster":"true","timestamp":1.302915401E9,"simScore":0.0,"sentiment":"N/A"},"timestamp":1.302915425E9,"simScore":0.8088982522138954,"sentiment":"  Negative"},{"index":3,"links":[0],"score":5.0,"level":5,"title":"lolconservatives","label":"What a fucking joke.  very similar to a certain american \"news\" station.","duration":"","id":3,"color":"blue","redditID":"t1_c1plbmy","isTrueCluster":"true","parentID":{"index":0,"links":[],"score":4.0,"level":5,"title":"UGH, CP24, a 24h news channel has a \"psychic\" on their show. ","label":"clairvoyanttruth","duration":"","id":0,"color":"red","redditID":"t3_gqv27","isTrueCluster":"true","timestamp":1.302915401E9,"simScore":0.0,"sentiment":"N/A"},"timestamp":1.302918528E9,"simScore":0.6282142756639847,"sentiment":"  Neutral"}],"userNodes":[],"links":[{"source":1,"target":0,"weight":0.5973861234234645},{"source":2,"target":0,"weight":0.8088982522138954},{"source":3,"target":0,"weight":0.6282142756639847}],"userLinks":[],"submissions":[{"user":{"username":"hellovn100","modhash":"5rspmrrvkyc51d5ba3a4e0a6f86e83584e34bdf6b0c606963d","cookie":"43916988,2015-11-22T15:23:46,e1d0f054f3fd0c68fa77e8db35ca08d907f73478","password":"111111"},"wikis":["psychic","news channel","ugh"],"url":"https://www.reddit.com/r/canada/comments/gqv27/ugh_cp24_a_24h_news_channel_has_a_psychic_on/","permalink":"/r/canada/comments/gqv27/ugh_cp24_a_24h_news_channel_has_a_psychic_on/?ref\u003dsearch_posts","author":"Clairvoyanttruth","title":"UGH, CP24, a 24h news channel has a \"psychic\" on their show. ","subreddit":"canada","subredditId":"t5_2qh68","thumbnail":"self","selftext":"It disgusts me, espeically since they are discussing the Royal Wedding.   They say she predicted the Japan hurricane and the death and issues with others.   Well I went to her site (which I don\u0027t want to link to to give it hits) and here are her predictions for 2011: \n\n\n\"World Predictions\n\nA terrorist attack in Toronto.    \nA gold rush in Hawaii.    \nPresident Obama has to be careful of parades.    \nPresident Obama’s children in danger.    \nDanger around President Obama.    \nSyria at war with the United States, the new Iraq.    \nMore UFO sightings.    \nThe Thames River poisoned in a terrorist attack.    \nTwo planes over Washington DC, United States, collide and crash.    \nMine disaster Pittsburgh, Pennsylvania.    \nIsrael and Iran at war.    \nA powerful quake rocks Chicago, Illinois.    \nA roller coaster will go out of control at a theme park in the US injuring many.    \nThe world’s first brain transplant.    \nA huge breakthrough in the cure for dementia and Alzheimer’s.    \nA dense fog - the worst in fifty years - disrupts air travel and transportation woes in London, England  \nA bionic eye will be invented by a French scientist.    \nHillary Clinton nominated for a Nobel Peace Prize.    \nA Japanese plane is hijacked on the way to Singapore from Tokyo, Japan.    \nA disease around maple trees.    \nA worm destroys the tea plant and plantations in Sri Lanka.    \nA UFO in the shape of a horseshoe hovers over Roswell, New Mexico.    \nA towering inferno in San Francisco.    \nThe world’s largest salmon will be caught in British Columbia.    \nA Hollywood starlet will give birth to a dwarf.    \nThe area of Brentwood in Los Angeles on fire.    \nNorth Korea and South Korea at war.    \nThe worst landslides in California history destroy thousands of homes.    \nA Paris suburb on fire.    \nAn oil spill in the Persian Gulf.    \nTerrorist attack in Manila in the Philippines.    \nA biological attack on a US city.    \nA cruise ship on fire destroying hundreds of lives.    \nA space tragedy.    \nAn explosion at an American Airforce base.    \nA terrorist attack at the Statue of Liberty in New York.    \nA terrorist attack at Grand Central Station in New York.    \nA bridge blows up in the United States.    \nTwo trains collide in southern England killing many.    \nA blimp explodes in Germany.  \nAn explosion at an American Express office in Europe.  \nA heist in Louisville, Kentucky.  \nA horse and jockey pass away at the Kentucky Derby.  \nA cruise ship turns upside down after an underwater earthquake under the Adriatic Sea.  \nDanger and health woes Hillary Clinton.  \nA prison riot New York.  \nPrison breakout and riot San Quentin.  \nA giant spider’s nest will be found in South America.  \nPolar bears and penguins moving south due to global warming.  \nAnother oil spill in the Persian Gulf.  \nWidespread damage when a meteorite hits two states in the southwestern United States.  \nBill Clinton has to watch his health\nBiological attack on the US and Britain.  \nA world wide computer virus.  \nTerrorist attacks in Germany, London, England, Los Angeles, New York and Chicago.  \nAn avalanche in Italy.  \nSex scandal around a famous political person in Washington, DC, USA.  \nA terrorist attack in Paris, France.  \nSarkozy in danger.  \nA trampese artist will fall at a circus.  \nA Turkish airliner is hijacked and blown up.  \nThe largest emerald in the world is found near Bogota, Columbia.  \nA new species of octopus is found in the Mediterranean Sea.  \nAn arrest in the Jon Benet Ramsey case.  \nPassing of Fidel Castro.  \nAn arrest in the Madeline McCann case.  \nA gorilla escapes from a German zoo injuring many.  \nA US naval ship is hijacked.  \nA tsunami in Japan.  \nThe Empire State Building on fire.  \nEarthquake in the Grand Canyon.  \nPandemic in Africa spreading worldwide.  \nA huge earthquake in Japan.  \nNorth Korea will attack Japan.  \nA terrorist attack Los Angeles.  \nTerrorist attack in Vancouver.  \nStock market up and down from one extreme to another.  \nGovernment change in Indonesia.  \nUprising in Venezuela.  \nChavez in danger.  \nThe painting of the Mona Lisa will be stolen.  \nA politician\u0027s children will be kidnapped.  \nThe Waldorf Astoria Hotel in New York will burn down.  \nA terrorist attack on Rodeo Drive in Beverly Hills, California.  \nA plane will crash into the Hollywood sign in LA.  \nMount St.   Helens will erupt.  \nEarthquake in Seattle and Oregon.  \nParts of the polar ice cap will melt.  \nTwo subways will collide head on in New York City.  \nMadam Tussard\u0027s wax museum in London, England will burn after a massive fire.  \nDick Cheney has to watch his health.  \nA large American newspaper will go bankrupt.  \nA new cat burglar in the South of France will rob the rich like in the movie \u0027To Catch A Thief\u0027.  \nSir Richard Branson in danger.  \nLife on other planets is stronger when new evidence is gathered.  \nA pill that makes you younger within thirty days.  \nBreakthroughs in the mystery of autism.  \nA Las Vegas hotel and casino on fire.  \n\nStar Predictions\n\nThe movie The Black Swan will be nominated for an Oscar.  \nNatalie Portman will be nominated for an Oscar.  \nGeorge Clooney will marry.  \nA remake of the movie The Godfather.  \nA remake of the movie Scarface.  \nLoretta Lynn has to watch health\nA remake of the movie Jaws in 3D.  \nThe TV series Boardwalk Empire will win many Emmy awards.  \nLady Gaga will turn to acting as well as music.  \nKaty Perry will be a mermaid in a music video.  \nA remake of the movie Cleopatra.  \nQueen Latifah will play in either on Broadway or TV, or a biography and I see her replacing someone on the View.  \nRosie O’Donnell makes a comeback.  \nPricilla Presley has to watch her health.  \nJustin Beiber has to watch his health and danger.  \nWarren Beatty and Annette Bening will split.  \nJustin Beiber will win lots of awards.  \nHealth watch - Aretha Franklin.  \nHealth problems - Shirley Maclaine\nHealth problems - Melanie Griffith.  \nParis Hilton kidnapped for ransom.  \nPaul Anka divorce.  \nBristol Palin engagement, but be careful of skiing and driving.  \nFormer Hollywood Madam Heidi Fleiss danger and health problems.  \nTiger Woods has to be careful of planes.  \nTaylor Swift has to be careful of transportation – cars, planes, etc.  \nMel Gibson will move to Australia and has to watch health.  \nChristine Agilera will pose for Playboy.  \nJosh Brolin and Diane Lane will separate.  \nWhoopi Goldberg will quit the View.  \nKim Kardashian baby and marriage.  \nNick Cage will split from wife.  \nAlex Baldwin will run for politics.  \nOprah Winfrey and Tyler Perry will produce a blockbuster movie which will be a hit.  \nLady Gaga will appear in a Hollywood movie.  \nKate Goslin will remarry.  \nSnookie from Jersey Shore has to watch for injury.  \nThere will be another TV series: \u0027Singing With The Stars\u0027.  \nA Hollywood hunk will save a child from drowning.  \nHalley Berry will have another child.  \nA movie starlet will have triplets.  \nBetty White has to watch health although I see her receiving a lot of awards.  \nTippi Hendren in danger.  \nA marriage for Angelina Jolie.  \nA marriage for Jennifer Anniston and baby.  \nA child for George Clooney.  \nHowie Mandel has to watch health.  \nA Hollywood starlet’s signifigant other has to be careful of their signifigant other on a motorcycle.  \nRachel McAdams will have her own sitcom.  \nMadonna will open her own hotel.  \nDonald Trump will be successful in politics.  \nFergie from the Black Eyed Peas has to watch her marriage.  \nA Victoria secret model will be kidnapped for ransom.  \nEllen Page will be an advocate for the environment\nHulk Hogan has to watch health\nElizabeth Taylor health woes\nA famous comedian will run for politics\nDanny Glover has to watch health.  \nHugh Hefner has to watch health.  \nA fire at the Playboy Mansion\nKristy Alley has to watch health.  \nAnother Hollywood hunk will confess to being gay.  \nThe success of his reality series Gene Simmons - will produce a feature film based on his TV series\nWith the success of \u0027Dancing With The Stars\u0027, dance studios will open all over the world.  \nDance clubs like the discos of the seventies and eighties will open up again\nTom Cruise and Katie Holmes will split.  \n\nWild Weather Predictions\n\nCategory five hurricane wipes out Miami.  \nThe worst mudslides in California’s history will occur.  \nMount St.   Helens erupting.  \nEarthquake Seattle, Washington.  \nEarthquake Chicago, Illinois.  \nPart of the polar ice cap melts.  \nWildfires spread to Beverley Hills and Los Angeles, Brentwood.  \nMore tsunamis Sumatra Indonesia, Alaska, Hawaii and Japan.  \nA great earthquake in Los Angeles, San Francisco and San Diego.  \nEarthquake Lake Tahoe.  \nEarthquake Toronto and Quebec.  \nEarthquake Oregon.  \nEarthquake Grand Canyon.  \nEarthquake New York, Alaska, Japan, Greece.  \nEarthquake British Columbia, China and Iran.  \nTornado in California.  \nFloods Amsterdam, Holland, Rhine River, Germany, Bangladesh, Great Britain.   Venice, Italy, Gulf Coast of Florida and France.  \nTsunami Malibu, California.  \nWildfires Greece, Australia, Texas, Hawaii.  \nMudslides in India, California.  \nTyphoon in Taiwan.  \nTornadoes Oklahoma, Indiana, Texas, Illinois, Tennessee.  \nGreat earthquake Rome and Naples, Italy.  \nHuge snowstorm and blizzards up the eastern seaboard affecting the great lakes – Toronto, Chicago, New York, Boston, etc.  \nEarthquake Yosemite and Yellowstone Park.  \n\n[continued in comments as it\u0027s too long]\n\n**It\u0027s really fucking easy to say you are psychic when a few of your 200+ predictions comes true - that\u0027s just probability**.  It disgusts me that is on a news channel, promoting false claims and the validity of psychics.  \n\nedit: added organizaton","selftextHTML":"\u0026lt;!-- SC_OFF --\u0026gt;\u0026lt;div class\u003d\"md\"\u0026gt;\u0026lt;p\u0026gt;It disgusts me, espeically since they are discussing the Royal Wedding.   They say she predicted the Japan hurricane and the death and issues with others.   Well I went to her site (which I don\u0026amp;#39;t want to link to to give it hits) and here are her predictions for 2011: \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026amp;quot;World Predictions\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;A terrorist attack in Toronto.\u0026lt;br/\u0026gt;\nA gold rush in Hawaii.\u0026lt;br/\u0026gt;\nPresident Obama has to be careful of parades.\u0026lt;br/\u0026gt;\nPresident Obama’s children in danger.\u0026lt;br/\u0026gt;\nDanger around President Obama.\u0026lt;br/\u0026gt;\nSyria at war with the United States, the new Iraq.\u0026lt;br/\u0026gt;\nMore UFO sightings.\u0026lt;br/\u0026gt;\nThe Thames River poisoned in a terrorist attack.\u0026lt;br/\u0026gt;\nTwo planes over Washington DC, United States, collide and crash.\u0026lt;br/\u0026gt;\nMine disaster Pittsburgh, Pennsylvania.\u0026lt;br/\u0026gt;\nIsrael and Iran at war.\u0026lt;br/\u0026gt;\nA powerful quake rocks Chicago, Illinois.\u0026lt;br/\u0026gt;\nA roller coaster will go out of control at a theme park in the US injuring many.\u0026lt;br/\u0026gt;\nThe world’s first brain transplant.\u0026lt;br/\u0026gt;\nA huge breakthrough in the cure for dementia and Alzheimer’s.\u0026lt;br/\u0026gt;\nA dense fog - the worst in fifty years - disrupts air travel and transportation woes in London, England\u0026lt;br/\u0026gt;\nA bionic eye will be invented by a French scientist.\u0026lt;br/\u0026gt;\nHillary Clinton nominated for a Nobel Peace Prize.\u0026lt;br/\u0026gt;\nA Japanese plane is hijacked on the way to Singapore from Tokyo, Japan.\u0026lt;br/\u0026gt;\nA disease around maple trees.\u0026lt;br/\u0026gt;\nA worm destroys the tea plant and plantations in Sri Lanka.\u0026lt;br/\u0026gt;\nA UFO in the shape of a horseshoe hovers over Roswell, New Mexico.\u0026lt;br/\u0026gt;\nA towering inferno in San Francisco.\u0026lt;br/\u0026gt;\nThe world’s largest salmon will be caught in British Columbia.\u0026lt;br/\u0026gt;\nA Hollywood starlet will give birth to a dwarf.\u0026lt;br/\u0026gt;\nThe area of Brentwood in Los Angeles on fire.\u0026lt;br/\u0026gt;\nNorth Korea and South Korea at war.\u0026lt;br/\u0026gt;\nThe worst landslides in California history destroy thousands of homes.\u0026lt;br/\u0026gt;\nA Paris suburb on fire.\u0026lt;br/\u0026gt;\nAn oil spill in the Persian Gulf.\u0026lt;br/\u0026gt;\nTerrorist attack in Manila in the Philippines.\u0026lt;br/\u0026gt;\nA biological attack on a US city.\u0026lt;br/\u0026gt;\nA cruise ship on fire destroying hundreds of lives.\u0026lt;br/\u0026gt;\nA space tragedy.\u0026lt;br/\u0026gt;\nAn explosion at an American Airforce base.\u0026lt;br/\u0026gt;\nA terrorist attack at the Statue of Liberty in New York.\u0026lt;br/\u0026gt;\nA terrorist attack at Grand Central Station in New York.\u0026lt;br/\u0026gt;\nA bridge blows up in the United States.\u0026lt;br/\u0026gt;\nTwo trains collide in southern England killing many.\u0026lt;br/\u0026gt;\nA blimp explodes in Germany.\u0026lt;br/\u0026gt;\nAn explosion at an American Express office in Europe.\u0026lt;br/\u0026gt;\nA heist in Louisville, Kentucky.\u0026lt;br/\u0026gt;\nA horse and jockey pass away at the Kentucky Derby.\u0026lt;br/\u0026gt;\nA cruise ship turns upside down after an underwater earthquake under the Adriatic Sea.\u0026lt;br/\u0026gt;\nDanger and health woes Hillary Clinton.\u0026lt;br/\u0026gt;\nA prison riot New York.\u0026lt;br/\u0026gt;\nPrison breakout and riot San Quentin.\u0026lt;br/\u0026gt;\nA giant spider’s nest will be found in South America.\u0026lt;br/\u0026gt;\nPolar bears and penguins moving south due to global warming.\u0026lt;br/\u0026gt;\nAnother oil spill in the Persian Gulf.\u0026lt;br/\u0026gt;\nWidespread damage when a meteorite hits two states in the southwestern United States.\u0026lt;br/\u0026gt;\nBill Clinton has to watch his health\nBiological attack on the US and Britain.\u0026lt;br/\u0026gt;\nA world wide computer virus.\u0026lt;br/\u0026gt;\nTerrorist attacks in Germany, London, England, Los Angeles, New York and Chicago.\u0026lt;br/\u0026gt;\nAn avalanche in Italy.\u0026lt;br/\u0026gt;\nSex scandal around a famous political person in Washington, DC, USA.\u0026lt;br/\u0026gt;\nA terrorist attack in Paris, France.\u0026lt;br/\u0026gt;\nSarkozy in danger.\u0026lt;br/\u0026gt;\nA trampese artist will fall at a circus.\u0026lt;br/\u0026gt;\nA Turkish airliner is hijacked and blown up.\u0026lt;br/\u0026gt;\nThe largest emerald in the world is found near Bogota, Columbia.\u0026lt;br/\u0026gt;\nA new species of octopus is found in the Mediterranean Sea.\u0026lt;br/\u0026gt;\nAn arrest in the Jon Benet Ramsey case.\u0026lt;br/\u0026gt;\nPassing of Fidel Castro.\u0026lt;br/\u0026gt;\nAn arrest in the Madeline McCann case.\u0026lt;br/\u0026gt;\nA gorilla escapes from a German zoo injuring many.\u0026lt;br/\u0026gt;\nA US naval ship is hijacked.\u0026lt;br/\u0026gt;\nA tsunami in Japan.\u0026lt;br/\u0026gt;\nThe Empire State Building on fire.\u0026lt;br/\u0026gt;\nEarthquake in the Grand Canyon.\u0026lt;br/\u0026gt;\nPandemic in Africa spreading worldwide.\u0026lt;br/\u0026gt;\nA huge earthquake in Japan.\u0026lt;br/\u0026gt;\nNorth Korea will attack Japan.\u0026lt;br/\u0026gt;\nA terrorist attack Los Angeles.\u0026lt;br/\u0026gt;\nTerrorist attack in Vancouver.\u0026lt;br/\u0026gt;\nStock market up and down from one extreme to another.\u0026lt;br/\u0026gt;\nGovernment change in Indonesia.\u0026lt;br/\u0026gt;\nUprising in Venezuela.\u0026lt;br/\u0026gt;\nChavez in danger.\u0026lt;br/\u0026gt;\nThe painting of the Mona Lisa will be stolen.\u0026lt;br/\u0026gt;\nA politician\u0026amp;#39;s children will be kidnapped.\u0026lt;br/\u0026gt;\nThe Waldorf Astoria Hotel in New York will burn down.\u0026lt;br/\u0026gt;\nA terrorist attack on Rodeo Drive in Beverly Hills, California.\u0026lt;br/\u0026gt;\nA plane will crash into the Hollywood sign in LA.\u0026lt;br/\u0026gt;\nMount St.   Helens will erupt.\u0026lt;br/\u0026gt;\nEarthquake in Seattle and Oregon.\u0026lt;br/\u0026gt;\nParts of the polar ice cap will melt.\u0026lt;br/\u0026gt;\nTwo subways will collide head on in New York City.\u0026lt;br/\u0026gt;\nMadam Tussard\u0026amp;#39;s wax museum in London, England will burn after a massive fire.\u0026lt;br/\u0026gt;\nDick Cheney has to watch his health.\u0026lt;br/\u0026gt;\nA large American newspaper will go bankrupt.\u0026lt;br/\u0026gt;\nA new cat burglar in the South of France will rob the rich like in the movie \u0026amp;#39;To Catch A Thief\u0026amp;#39;.\u0026lt;br/\u0026gt;\nSir Richard Branson in danger.\u0026lt;br/\u0026gt;\nLife on other planets is stronger when new evidence is gathered.\u0026lt;br/\u0026gt;\nA pill that makes you younger within thirty days.\u0026lt;br/\u0026gt;\nBreakthroughs in the mystery of autism.\u0026lt;br/\u0026gt;\nA Las Vegas hotel and casino on fire.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Star Predictions\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;The movie The Black Swan will be nominated for an Oscar.\u0026lt;br/\u0026gt;\nNatalie Portman will be nominated for an Oscar.\u0026lt;br/\u0026gt;\nGeorge Clooney will marry.\u0026lt;br/\u0026gt;\nA remake of the movie The Godfather.\u0026lt;br/\u0026gt;\nA remake of the movie Scarface.\u0026lt;br/\u0026gt;\nLoretta Lynn has to watch health\nA remake of the movie Jaws in 3D.\u0026lt;br/\u0026gt;\nThe TV series Boardwalk Empire will win many Emmy awards.\u0026lt;br/\u0026gt;\nLady Gaga will turn to acting as well as music.\u0026lt;br/\u0026gt;\nKaty Perry will be a mermaid in a music video.\u0026lt;br/\u0026gt;\nA remake of the movie Cleopatra.\u0026lt;br/\u0026gt;\nQueen Latifah will play in either on Broadway or TV, or a biography and I see her replacing someone on the View.\u0026lt;br/\u0026gt;\nRosie O’Donnell makes a comeback.\u0026lt;br/\u0026gt;\nPricilla Presley has to watch her health.\u0026lt;br/\u0026gt;\nJustin Beiber has to watch his health and danger.\u0026lt;br/\u0026gt;\nWarren Beatty and Annette Bening will split.\u0026lt;br/\u0026gt;\nJustin Beiber will win lots of awards.\u0026lt;br/\u0026gt;\nHealth watch - Aretha Franklin.\u0026lt;br/\u0026gt;\nHealth problems - Shirley Maclaine\nHealth problems - Melanie Griffith.\u0026lt;br/\u0026gt;\nParis Hilton kidnapped for ransom.\u0026lt;br/\u0026gt;\nPaul Anka divorce.\u0026lt;br/\u0026gt;\nBristol Palin engagement, but be careful of skiing and driving.\u0026lt;br/\u0026gt;\nFormer Hollywood Madam Heidi Fleiss danger and health problems.\u0026lt;br/\u0026gt;\nTiger Woods has to be careful of planes.\u0026lt;br/\u0026gt;\nTaylor Swift has to be careful of transportation – cars, planes, etc.\u0026lt;br/\u0026gt;\nMel Gibson will move to Australia and has to watch health.\u0026lt;br/\u0026gt;\nChristine Agilera will pose for Playboy.\u0026lt;br/\u0026gt;\nJosh Brolin and Diane Lane will separate.\u0026lt;br/\u0026gt;\nWhoopi Goldberg will quit the View.\u0026lt;br/\u0026gt;\nKim Kardashian baby and marriage.\u0026lt;br/\u0026gt;\nNick Cage will split from wife.\u0026lt;br/\u0026gt;\nAlex Baldwin will run for politics.\u0026lt;br/\u0026gt;\nOprah Winfrey and Tyler Perry will produce a blockbuster movie which will be a hit.\u0026lt;br/\u0026gt;\nLady Gaga will appear in a Hollywood movie.\u0026lt;br/\u0026gt;\nKate Goslin will remarry.\u0026lt;br/\u0026gt;\nSnookie from Jersey Shore has to watch for injury.\u0026lt;br/\u0026gt;\nThere will be another TV series: \u0026amp;#39;Singing With The Stars\u0026amp;#39;.\u0026lt;br/\u0026gt;\nA Hollywood hunk will save a child from drowning.\u0026lt;br/\u0026gt;\nHalley Berry will have another child.\u0026lt;br/\u0026gt;\nA movie starlet will have triplets.\u0026lt;br/\u0026gt;\nBetty White has to watch health although I see her receiving a lot of awards.\u0026lt;br/\u0026gt;\nTippi Hendren in danger.\u0026lt;br/\u0026gt;\nA marriage for Angelina Jolie.\u0026lt;br/\u0026gt;\nA marriage for Jennifer Anniston and baby.\u0026lt;br/\u0026gt;\nA child for George Clooney.\u0026lt;br/\u0026gt;\nHowie Mandel has to watch health.\u0026lt;br/\u0026gt;\nA Hollywood starlet’s signifigant other has to be careful of their signifigant other on a motorcycle.\u0026lt;br/\u0026gt;\nRachel McAdams will have her own sitcom.\u0026lt;br/\u0026gt;\nMadonna will open her own hotel.\u0026lt;br/\u0026gt;\nDonald Trump will be successful in politics.\u0026lt;br/\u0026gt;\nFergie from the Black Eyed Peas has to watch her marriage.\u0026lt;br/\u0026gt;\nA Victoria secret model will be kidnapped for ransom.\u0026lt;br/\u0026gt;\nEllen Page will be an advocate for the environment\nHulk Hogan has to watch health\nElizabeth Taylor health woes\nA famous comedian will run for politics\nDanny Glover has to watch health.\u0026lt;br/\u0026gt;\nHugh Hefner has to watch health.\u0026lt;br/\u0026gt;\nA fire at the Playboy Mansion\nKristy Alley has to watch health.\u0026lt;br/\u0026gt;\nAnother Hollywood hunk will confess to being gay.\u0026lt;br/\u0026gt;\nThe success of his reality series Gene Simmons - will produce a feature film based on his TV series\nWith the success of \u0026amp;#39;Dancing With The Stars\u0026amp;#39;, dance studios will open all over the world.\u0026lt;br/\u0026gt;\nDance clubs like the discos of the seventies and eighties will open up again\nTom Cruise and Katie Holmes will split.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Wild Weather Predictions\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;Category five hurricane wipes out Miami.\u0026lt;br/\u0026gt;\nThe worst mudslides in California’s history will occur.\u0026lt;br/\u0026gt;\nMount St.   Helens erupting.\u0026lt;br/\u0026gt;\nEarthquake Seattle, Washington.\u0026lt;br/\u0026gt;\nEarthquake Chicago, Illinois.\u0026lt;br/\u0026gt;\nPart of the polar ice cap melts.\u0026lt;br/\u0026gt;\nWildfires spread to Beverley Hills and Los Angeles, Brentwood.\u0026lt;br/\u0026gt;\nMore tsunamis Sumatra Indonesia, Alaska, Hawaii and Japan.\u0026lt;br/\u0026gt;\nA great earthquake in Los Angeles, San Francisco and San Diego.\u0026lt;br/\u0026gt;\nEarthquake Lake Tahoe.\u0026lt;br/\u0026gt;\nEarthquake Toronto and Quebec.\u0026lt;br/\u0026gt;\nEarthquake Oregon.\u0026lt;br/\u0026gt;\nEarthquake Grand Canyon.\u0026lt;br/\u0026gt;\nEarthquake New York, Alaska, Japan, Greece.\u0026lt;br/\u0026gt;\nEarthquake British Columbia, China and Iran.\u0026lt;br/\u0026gt;\nTornado in California.\u0026lt;br/\u0026gt;\nFloods Amsterdam, Holland, Rhine River, Germany, Bangladesh, Great Britain.   Venice, Italy, Gulf Coast of Florida and France.\u0026lt;br/\u0026gt;\nTsunami Malibu, California.\u0026lt;br/\u0026gt;\nWildfires Greece, Australia, Texas, Hawaii.\u0026lt;br/\u0026gt;\nMudslides in India, California.\u0026lt;br/\u0026gt;\nTyphoon in Taiwan.\u0026lt;br/\u0026gt;\nTornadoes Oklahoma, Indiana, Texas, Illinois, Tennessee.\u0026lt;br/\u0026gt;\nGreat earthquake Rome and Naples, Italy.\u0026lt;br/\u0026gt;\nHuge snowstorm and blizzards up the eastern seaboard affecting the great lakes – Toronto, Chicago, New York, Boston, etc.\u0026lt;br/\u0026gt;\nEarthquake Yosemite and Yellowstone Park.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;[continued in comments as it\u0026amp;#39;s too long]\u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;It\u0026amp;#39;s really fucking easy to say you are psychic when a few of your 200+ predictions comes true - that\u0026amp;#39;s just probability\u0026lt;/strong\u0026gt;.  It disgusts me that is on a news channel, promoting false claims and the validity of psychics.  \u0026lt;/p\u0026gt;\n\n\u0026lt;p\u0026gt;edit: added organizaton\u0026lt;/p\u0026gt;\n\u0026lt;/div\u0026gt;\u0026lt;!-- SC_ON --\u0026gt;","domain":"self.canada","gilded":0,"commentCount":5,"score":4,"upVotes":4,"downVotes":0,"created":1.302915401E9,"createdUTC":1.302886601E9,"visited":false,"self":false,"saved":false,"edited":true,"stickied":false,"nsfw":false,"hidden":false,"clicked":false,"kind":"t3","identifier":"gqv27","fullName":"t3_gqv27"}],"sankeyNodes":[],"sentiments":[]}